AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
/* Based on CPU DB MC9S08GB60, version 2.87.027 (RegistersPrg V1.061) */
/*
** ###################################################################
**     Filename  : MC9S08GB60.h
**     Processor : MC9S08GB60
**     FileFormat: V1.061
**     DataSheet : MC9S08GB60/D Rev. 2.0, 2/2004
**     Compiler  : Metrowerks C compiler
**     Date/Time : 08.04.2004, 10:52
**     Abstract  :
**         This implements an IO devices mapping.
**
**     (c) Copyright UNIS, spol. s r.o. 1997-2003
**     UNIS, spol. s r.o.
**     Jundrovska 33
**     624 00 Brno
**     Czech Republic
**     http      : www.processorexpert.com
**     mail      : info@processorexpert.com
** ###################################################################
*/

#ifndef _MC9S08GB60_H
#define _MC9S08GB60_H

/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

#ifndef __RESET_WATCHDOG_MACRO
#define __RESET_WATCHDOG_MACRO
/* Watchdog reset macro */
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() {asm sta SRS;}  /* Just write a byte to feed the dog */
#endif
#endif /* __RESET_WATCHDOG_MACRO */

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */

/**************** interrupt vector table ****************/
#define Vrti                    0x0000FFCC
#define Viic1                   0x0000FFCE
#define Vatd1                   0x0000FFD0
#define Vkeyboard1              0x0000FFD2
#define Vsci2tx                 0x0000FFD4
#define Vsci2rx                 0x0000FFD6
#define Vsci2err                0x0000FFD8
#define Vsci1tx                 0x0000FFDA
#define Vsci1rx                 0x0000FFDC
#define Vsci1err                0x0000FFDE
#define Vspi1                   0x0000FFE0
#define Vtpm2ovf                0x0000FFE2
#define Vtpm2ch4                0x0000FFE4
#define Vtpm2ch3                0x0000FFE6
#define Vtpm2ch2                0x0000FFE8
#define Vtpm2ch1                0x0000FFEA
#define Vtpm2ch0                0x0000FFEC
#define Vtpm1ovf                0x0000FFEE
#define Vtpm1ch2                0x0000FFF0
#define Vtpm1ch1                0x0000FFF2
#define Vtpm1ch0                0x0000FFF4
#define Vicg                    0x0000FFF6
#define Vlvd                    0x0000FFF8
#define Virq                    0x0000FFFA
#define Vswi                    0x0000FFFC
#define Vreset                  0x0000FFFE

/**************** registers I/O map ****************/

/*** PTAD - Port A Data Register; 0x00000000 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAD0       :1;                                       /* Port A Data Register Bit 0 */
    byte PTAD1       :1;                                       /* Port A Data Register Bit 1 */
    byte PTAD2       :1;                                       /* Port A Data Register Bit 2 */
    byte PTAD3       :1;                                       /* Port A Data Register Bit 3 */
    byte PTAD4       :1;                                       /* Port A Data Register Bit 4 */
    byte PTAD5       :1;                                       /* Port A Data Register Bit 5 */
    byte PTAD6       :1;                                       /* Port A Data Register Bit 6 */
    byte PTAD7       :1;                                       /* Port A Data Register Bit 7 */
  } Bits;
  struct {
    byte grpPTAD :8;
  } MergedBits;
} PTADSTR;
extern volatile PTADSTR _PTAD @0x00000000;
#define PTAD _PTAD.Byte
#define PTAD_PTAD0 _PTAD.Bits.PTAD0
#define PTAD_PTAD1 _PTAD.Bits.PTAD1
#define PTAD_PTAD2 _PTAD.Bits.PTAD2
#define PTAD_PTAD3 _PTAD.Bits.PTAD3
#define PTAD_PTAD4 _PTAD.Bits.PTAD4
#define PTAD_PTAD5 _PTAD.Bits.PTAD5
#define PTAD_PTAD6 _PTAD.Bits.PTAD6
#define PTAD_PTAD7 _PTAD.Bits.PTAD7
#define PTAD_PTAD _PTAD.MergedBits.grpPTAD

#define PTAD_PTAD0_MASK   1
#define PTAD_PTAD0_BITNUM 0
#define PTAD_PTAD1_MASK   2
#define PTAD_PTAD1_BITNUM 1
#define PTAD_PTAD2_MASK   4
#define PTAD_PTAD2_BITNUM 2
#define PTAD_PTAD3_MASK   8
#define PTAD_PTAD3_BITNUM 3
#define PTAD_PTAD4_MASK   16
#define PTAD_PTAD4_BITNUM 4
#define PTAD_PTAD5_MASK   32
#define PTAD_PTAD5_BITNUM 5
#define PTAD_PTAD6_MASK   64
#define PTAD_PTAD6_BITNUM 6
#define PTAD_PTAD7_MASK   128
#define PTAD_PTAD7_BITNUM 7
#define PTAD_PTAD_MASK  255
#define PTAD_PTAD_BITNUM  0


/*** PTAPE - Pullup Enable for Port A; 0x00000001 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAPE0      :1;                                       /* Pullup Enable for Port A Bit 0 */
    byte PTAPE1      :1;                                       /* Pullup Enable for Port A Bit 1 */
    byte PTAPE2      :1;                                       /* Pullup Enable for Port A Bit 2 */
    byte PTAPE3      :1;                                       /* Pullup Enable for Port A Bit 3 */
    byte PTAPE4      :1;                                       /* Pullup Enable for Port A Bit 4 */
    byte PTAPE5      :1;                                       /* Pullup Enable for Port A Bit 5 */
    byte PTAPE6      :1;                                       /* Pullup Enable for Port A Bit 6 */
    byte PTAPE7      :1;                                       /* Pullup Enable for Port A Bit 7 */
  } Bits;
  struct {
    byte grpPTAPE :8;
  } MergedBits;
} PTAPESTR;
extern volatile PTAPESTR _PTAPE @0x00000001;
#define PTAPE _PTAPE.Byte
#define PTAPE_PTAPE0 _PTAPE.Bits.PTAPE0
#define PTAPE_PTAPE1 _PTAPE.Bits.PTAPE1
#define PTAPE_PTAPE2 _PTAPE.Bits.PTAPE2
#define PTAPE_PTAPE3 _PTAPE.Bits.PTAPE3
#define PTAPE_PTAPE4 _PTAPE.Bits.PTAPE4
#define PTAPE_PTAPE5 _PTAPE.Bits.PTAPE5
#define PTAPE_PTAPE6 _PTAPE.Bits.PTAPE6
#define PTAPE_PTAPE7 _PTAPE.Bits.PTAPE7
#define PTAPE_PTAPE _PTAPE.MergedBits.grpPTAPE

#define PTAPE_PTAPE0_MASK   1
#define PTAPE_PTAPE0_BITNUM 0
#define PTAPE_PTAPE1_MASK   2
#define PTAPE_PTAPE1_BITNUM 1
#define PTAPE_PTAPE2_MASK   4
#define PTAPE_PTAPE2_BITNUM 2
#define PTAPE_PTAPE3_MASK   8
#define PTAPE_PTAPE3_BITNUM 3
#define PTAPE_PTAPE4_MASK   16
#define PTAPE_PTAPE4_BITNUM 4
#define PTAPE_PTAPE5_MASK   32
#define PTAPE_PTAPE5_BITNUM 5
#define PTAPE_PTAPE6_MASK   64
#define PTAPE_PTAPE6_BITNUM 6
#define PTAPE_PTAPE7_MASK   128
#define PTAPE_PTAPE7_BITNUM 7
#define PTAPE_PTAPE_MASK  255
#define PTAPE_PTAPE_BITNUM  0


/*** PTASE - Slew Rate Control Enable for Port A; 0x00000002 ***/
typedef union {
  byte Byte;
  struct {
    byte PTASE0      :1;                                       /* Slew Rate Control Enable for Port A Bit 0 */
    byte PTASE1      :1;                                       /* Slew Rate Control Enable for Port A Bit 1 */
    byte PTASE2      :1;                                       /* Slew Rate Control Enable for Port A Bit 2 */
    byte PTASE3      :1;                                       /* Slew Rate Control Enable for Port A Bit 3 */
    byte PTASE4      :1;                                       /* Slew Rate Control Enable for Port A Bit 4 */
    byte PTASE5      :1;                                       /* Slew Rate Control Enable for Port A Bit 5 */
    byte PTASE6      :1;                                       /* Slew Rate Control Enable for Port A Bit 6 */
    byte PTASE7      :1;                                       /* Slew Rate Control Enable for Port A Bit 7 */
  } Bits;
  struct {
    byte grpPTASE :8;
  } MergedBits;
} PTASESTR;
extern volatile PTASESTR _PTASE @0x00000002;
#define PTASE _PTASE.Byte
#define PTASE_PTASE0 _PTASE.Bits.PTASE0
#define PTASE_PTASE1 _PTASE.Bits.PTASE1
#define PTASE_PTASE2 _PTASE.Bits.PTASE2
#define PTASE_PTASE3 _PTASE.Bits.PTASE3
#define PTASE_PTASE4 _PTASE.Bits.PTASE4
#define PTASE_PTASE5 _PTASE.Bits.PTASE5
#define PTASE_PTASE6 _PTASE.Bits.PTASE6
#define PTASE_PTASE7 _PTASE.Bits.PTASE7
#define PTASE_PTASE _PTASE.MergedBits.grpPTASE

#define PTASE_PTASE0_MASK   1
#define PTASE_PTASE0_BITNUM 0
#define PTASE_PTASE1_MASK   2
#define PTASE_PTASE1_BITNUM 1
#define PTASE_PTASE2_MASK   4
#define PTASE_PTASE2_BITNUM 2
#define PTASE_PTASE3_MASK   8
#define PTASE_PTASE3_BITNUM 3
#define PTASE_PTASE4_MASK   16
#define PTASE_PTASE4_BITNUM 4
#define PTASE_PTASE5_MASK   32
#define PTASE_PTASE5_BITNUM 5
#define PTASE_PTASE6_MASK   64
#define PTASE_PTASE6_BITNUM 6
#define PTASE_PTASE7_MASK   128
#define PTASE_PTASE7_BITNUM 7
#define PTASE_PTASE_MASK  255
#define PTASE_PTASE_BITNUM  0


/*** PTADD - Data Direction Register A; 0x00000003 ***/
typedef union {
  byte Byte;
  struct {
    byte PTADD0      :1;                                       /* Data Direction for Port A Bit 0 */
    byte PTADD1      :1;                                       /* Data Direction for Port A Bit 1 */
    byte PTADD2      :1;                                       /* Data Direction for Port A Bit 2 */
    byte PTADD3      :1;                                       /* Data Direction for Port A Bit 3 */
    byte PTADD4      :1;                                       /* Data Direction for Port A Bit 4 */
    byte PTADD5      :1;                                       /* Data Direction for Port A Bit 5 */
    byte PTADD6      :1;                                       /* Data Direction for Port A Bit 6 */
    byte PTADD7      :1;                                       /* Data Direction for Port A Bit 7 */
  } Bits;
  struct {
    byte grpPTADD :8;
  } MergedBits;
} PTADDSTR;
extern volatile PTADDSTR _PTADD @0x00000003;
#define PTADD _PTADD.Byte
#define PTADD_PTADD0 _PTADD.Bits.PTADD0
#define PTADD_PTADD1 _PTADD.Bits.PTADD1
#define PTADD_PTADD2 _PTADD.Bits.PTADD2
#define PTADD_PTADD3 _PTADD.Bits.PTADD3
#define PTADD_PTADD4 _PTADD.Bits.PTADD4
#define PTADD_PTADD5 _PTADD.Bits.PTADD5
#define PTADD_PTADD6 _PTADD.Bits.PTADD6
#define PTADD_PTADD7 _PTADD.Bits.PTADD7
#define PTADD_PTADD _PTADD.MergedBits.grpPTADD

#define PTADD_PTADD0_MASK   1
#define PTADD_PTADD0_BITNUM 0
#define PTADD_PTADD1_MASK   2
#define PTADD_PTADD1_BITNUM 1
#define PTADD_PTADD2_MASK   4
#define PTADD_PTADD2_BITNUM 2
#define PTADD_PTADD3_MASK   8
#define PTADD_PTADD3_BITNUM 3
#define PTADD_PTADD4_MASK   16
#define PTADD_PTADD4_BITNUM 4
#define PTADD_PTADD5_MASK   32
#define PTADD_PTADD5_BITNUM 5
#define PTADD_PTADD6_MASK   64
#define PTADD_PTADD6_BITNUM 6
#define PTADD_PTADD7_MASK   128
#define PTADD_PTADD7_BITNUM 7
#define PTADD_PTADD_MASK  255
#define PTADD_PTADD_BITNUM  0


/*** PTBD - Port B Data Register; 0x00000004 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBD0       :1;                                       /* Port B Data Register Bit 0 */
    byte PTBD1       :1;                                       /* Port B Data Register Bit 1 */
    byte PTBD2       :1;                                       /* Port B Data Register Bit 2 */
    byte PTBD3       :1;                                       /* Port B Data Register Bit 3 */
    byte PTBD4       :1;                                       /* Port B Data Register Bit 4 */
    byte PTBD5       :1;                                       /* Port B Data Register Bit 5 */
    byte PTBD6       :1;                                       /* Port B Data Register Bit 6 */
    byte PTBD7       :1;                                       /* Port B Data Register Bit 7 */
  } Bits;
  struct {
    byte grpPTBD :8;
  } MergedBits;
} PTBDSTR;
extern volatile PTBDSTR _PTBD @0x00000004;
#define PTBD _PTBD.Byte
#define PTBD_PTBD0 _PTBD.Bits.PTBD0
#define PTBD_PTBD1 _PTBD.Bits.PTBD1
#define PTBD_PTBD2 _PTBD.Bits.PTBD2
#define PTBD_PTBD3 _PTBD.Bits.PTBD3
#define PTBD_PTBD4 _PTBD.Bits.PTBD4
#define PTBD_PTBD5 _PTBD.Bits.PTBD5
#define PTBD_PTBD6 _PTBD.Bits.PTBD6
#define PTBD_PTBD7 _PTBD.Bits.PTBD7
#define PTBD_PTBD _PTBD.MergedBits.grpPTBD

