AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
#define PTBD_PTBD0_MASK   1
#define PTBD_PTBD0_BITNUM 0
#define PTBD_PTBD1_MASK   2
#define PTBD_PTBD1_BITNUM 1
#define PTBD_PTBD2_MASK   4
#define PTBD_PTBD2_BITNUM 2
#define PTBD_PTBD3_MASK   8
#define PTBD_PTBD3_BITNUM 3
#define PTBD_PTBD4_MASK   16
#define PTBD_PTBD4_BITNUM 4
#define PTBD_PTBD5_MASK   32
#define PTBD_PTBD5_BITNUM 5
#define PTBD_PTBD6_MASK   64
#define PTBD_PTBD6_BITNUM 6
#define PTBD_PTBD7_MASK   128
#define PTBD_PTBD7_BITNUM 7
#define PTBD_PTBD_MASK  255
#define PTBD_PTBD_BITNUM  0


/*** PTBPE - Pullup Enable for Port B; 0x00000005 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBPE0      :1;                                       /* Pullup Enable for Port B Bit 0 */
    byte PTBPE1      :1;                                       /* Pullup Enable for Port B Bit 1 */
    byte PTBPE2      :1;                                       /* Pullup Enable for Port B Bit 2 */
    byte PTBPE3      :1;                                       /* Pullup Enable for Port B Bit 3 */
    byte PTBPE4      :1;                                       /* Pullup Enable for Port B Bit 4 */
    byte PTBPE5      :1;                                       /* Pullup Enable for Port B Bit 5 */
    byte PTBPE6      :1;                                       /* Pullup Enable for Port B Bit 6 */
    byte PTBPE7      :1;                                       /* Pullup Enable for Port B Bit 7 */
  } Bits;
  struct {
    byte grpPTBPE :8;
  } MergedBits;
} PTBPESTR;
extern volatile PTBPESTR _PTBPE @0x00000005;
#define PTBPE _PTBPE.Byte
#define PTBPE_PTBPE0 _PTBPE.Bits.PTBPE0
#define PTBPE_PTBPE1 _PTBPE.Bits.PTBPE1
#define PTBPE_PTBPE2 _PTBPE.Bits.PTBPE2
#define PTBPE_PTBPE3 _PTBPE.Bits.PTBPE3
#define PTBPE_PTBPE4 _PTBPE.Bits.PTBPE4
#define PTBPE_PTBPE5 _PTBPE.Bits.PTBPE5
#define PTBPE_PTBPE6 _PTBPE.Bits.PTBPE6
#define PTBPE_PTBPE7 _PTBPE.Bits.PTBPE7
#define PTBPE_PTBPE _PTBPE.MergedBits.grpPTBPE

#define PTBPE_PTBPE0_MASK   1
#define PTBPE_PTBPE0_BITNUM 0
#define PTBPE_PTBPE1_MASK   2
#define PTBPE_PTBPE1_BITNUM 1
#define PTBPE_PTBPE2_MASK   4
#define PTBPE_PTBPE2_BITNUM 2
#define PTBPE_PTBPE3_MASK   8
#define PTBPE_PTBPE3_BITNUM 3
#define PTBPE_PTBPE4_MASK   16
#define PTBPE_PTBPE4_BITNUM 4
#define PTBPE_PTBPE5_MASK   32
#define PTBPE_PTBPE5_BITNUM 5
#define PTBPE_PTBPE6_MASK   64
#define PTBPE_PTBPE6_BITNUM 6
#define PTBPE_PTBPE7_MASK   128
#define PTBPE_PTBPE7_BITNUM 7
#define PTBPE_PTBPE_MASK  255
#define PTBPE_PTBPE_BITNUM  0


/*** PTBSE - Slew Rate Control Enable for Port B; 0x00000006 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBSE0      :1;                                       /* Slew Rate Control Enable for Port B Bit 0 */
    byte PTBSE1      :1;                                       /* Slew Rate Control Enable for Port B Bit 1 */
    byte PTBSE2      :1;                                       /* Slew Rate Control Enable for Port B Bit 2 */
    byte PTBSE3      :1;                                       /* Slew Rate Control Enable for Port B Bit 3 */
    byte PTBSE4      :1;                                       /* Slew Rate Control Enable for Port B Bit 4 */
    byte PTBSE5      :1;                                       /* Slew Rate Control Enable for Port B Bit 5 */
    byte PTBSE6      :1;                                       /* Slew Rate Control Enable for Port B Bit 6 */
    byte PTBSE7      :1;                                       /* Slew Rate Control Enable for Port B Bit 7 */
  } Bits;
  struct {
    byte grpPTBSE :8;
  } MergedBits;
} PTBSESTR;
extern volatile PTBSESTR _PTBSE @0x00000006;
#define PTBSE _PTBSE.Byte
#define PTBSE_PTBSE0 _PTBSE.Bits.PTBSE0
#define PTBSE_PTBSE1 _PTBSE.Bits.PTBSE1
#define PTBSE_PTBSE2 _PTBSE.Bits.PTBSE2
#define PTBSE_PTBSE3 _PTBSE.Bits.PTBSE3
#define PTBSE_PTBSE4 _PTBSE.Bits.PTBSE4
#define PTBSE_PTBSE5 _PTBSE.Bits.PTBSE5
#define PTBSE_PTBSE6 _PTBSE.Bits.PTBSE6
#define PTBSE_PTBSE7 _PTBSE.Bits.PTBSE7
#define PTBSE_PTBSE _PTBSE.MergedBits.grpPTBSE

#define PTBSE_PTBSE0_MASK   1
#define PTBSE_PTBSE0_BITNUM 0
#define PTBSE_PTBSE1_MASK   2
#define PTBSE_PTBSE1_BITNUM 1
#define PTBSE_PTBSE2_MASK   4
#define PTBSE_PTBSE2_BITNUM 2
#define PTBSE_PTBSE3_MASK   8
#define PTBSE_PTBSE3_BITNUM 3
#define PTBSE_PTBSE4_MASK   16
#define PTBSE_PTBSE4_BITNUM 4
#define PTBSE_PTBSE5_MASK   32
#define PTBSE_PTBSE5_BITNUM 5
#define PTBSE_PTBSE6_MASK   64
#define PTBSE_PTBSE6_BITNUM 6
#define PTBSE_PTBSE7_MASK   128
#define PTBSE_PTBSE7_BITNUM 7
#define PTBSE_PTBSE_MASK  255
#define PTBSE_PTBSE_BITNUM  0


/*** PTBDD - Data Direction Register B; 0x00000007 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBDD0      :1;                                       /* Data Direction for Port B Bit 0 */
    byte PTBDD1      :1;                                       /* Data Direction for Port B Bit 1 */
    byte PTBDD2      :1;                                       /* Data Direction for Port B Bit 2 */
    byte PTBDD3      :1;                                       /* Data Direction for Port B Bit 3 */
    byte PTBDD4      :1;                                       /* Data Direction for Port B Bit 4 */
    byte PTBDD5      :1;                                       /* Data Direction for Port B Bit 5 */
    byte PTBDD6      :1;                                       /* Data Direction for Port B Bit 6 */
    byte PTBDD7      :1;                                       /* Data Direction for Port B Bit 7 */
  } Bits;
  struct {
    byte grpPTBDD :8;
  } MergedBits;
} PTBDDSTR;
extern volatile PTBDDSTR _PTBDD @0x00000007;
#define PTBDD _PTBDD.Byte
#define PTBDD_PTBDD0 _PTBDD.Bits.PTBDD0
#define PTBDD_PTBDD1 _PTBDD.Bits.PTBDD1
#define PTBDD_PTBDD2 _PTBDD.Bits.PTBDD2
#define PTBDD_PTBDD3 _PTBDD.Bits.PTBDD3
#define PTBDD_PTBDD4 _PTBDD.Bits.PTBDD4
#define PTBDD_PTBDD5 _PTBDD.Bits.PTBDD5
#define PTBDD_PTBDD6 _PTBDD.Bits.PTBDD6
#define PTBDD_PTBDD7 _PTBDD.Bits.PTBDD7
#define PTBDD_PTBDD _PTBDD.MergedBits.grpPTBDD

#define PTBDD_PTBDD0_MASK   1
#define PTBDD_PTBDD0_BITNUM 0
#define PTBDD_PTBDD1_MASK   2
#define PTBDD_PTBDD1_BITNUM 1
#define PTBDD_PTBDD2_MASK   4
#define PTBDD_PTBDD2_BITNUM 2
#define PTBDD_PTBDD3_MASK   8
#define PTBDD_PTBDD3_BITNUM 3
#define PTBDD_PTBDD4_MASK   16
#define PTBDD_PTBDD4_BITNUM 4
#define PTBDD_PTBDD5_MASK   32
#define PTBDD_PTBDD5_BITNUM 5
#define PTBDD_PTBDD6_MASK   64
#define PTBDD_PTBDD6_BITNUM 6
#define PTBDD_PTBDD7_MASK   128
#define PTBDD_PTBDD7_BITNUM 7
#define PTBDD_PTBDD_MASK  255
#define PTBDD_PTBDD_BITNUM  0


