AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
/*** PTCD - Port C Data Register; 0x00000008 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCD0       :1;                                       /* Port C Data Register Bit 0 */
    byte PTCD1       :1;                                       /* Port C Data Register Bit 1 */
    byte PTCD2       :1;                                       /* Port C Data Register Bit 2 */
    byte PTCD3       :1;                                       /* Port C Data Register Bit 3 */
    byte PTCD4       :1;                                       /* Port C Data Register Bit 4 */
    byte PTCD5       :1;                                       /* Port C Data Register Bit 5 */
    byte PTCD6       :1;                                       /* Port C Data Register Bit 6 */
    byte PTCD7       :1;                                       /* Port C Data Register Bit 7 */
  } Bits;
  struct {
    byte grpPTCD :8;
  } MergedBits;
} PTCDSTR;
extern volatile PTCDSTR _PTCD @0x00000008;
#define PTCD _PTCD.Byte
#define PTCD_PTCD0 _PTCD.Bits.PTCD0
#define PTCD_PTCD1 _PTCD.Bits.PTCD1
#define PTCD_PTCD2 _PTCD.Bits.PTCD2
#define PTCD_PTCD3 _PTCD.Bits.PTCD3
#define PTCD_PTCD4 _PTCD.Bits.PTCD4
#define PTCD_PTCD5 _PTCD.Bits.PTCD5
#define PTCD_PTCD6 _PTCD.Bits.PTCD6
#define PTCD_PTCD7 _PTCD.Bits.PTCD7
#define PTCD_PTCD _PTCD.MergedBits.grpPTCD

#define PTCD_PTCD0_MASK   1
#define PTCD_PTCD0_BITNUM 0
#define PTCD_PTCD1_MASK   2
#define PTCD_PTCD1_BITNUM 1
#define PTCD_PTCD2_MASK   4
#define PTCD_PTCD2_BITNUM 2
#define PTCD_PTCD3_MASK   8
#define PTCD_PTCD3_BITNUM 3
#define PTCD_PTCD4_MASK   16
#define PTCD_PTCD4_BITNUM 4
#define PTCD_PTCD5_MASK   32
#define PTCD_PTCD5_BITNUM 5
#define PTCD_PTCD6_MASK   64
#define PTCD_PTCD6_BITNUM 6
#define PTCD_PTCD7_MASK   128
#define PTCD_PTCD7_BITNUM 7
#define PTCD_PTCD_MASK  255
#define PTCD_PTCD_BITNUM  0


/*** PTCPE - Pullup Enable for Port C; 0x00000009 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCPE0      :1;                                       /* Pullup Enable for Port C Bit 0 */
    byte PTCPE1      :1;                                       /* Pullup Enable for Port C Bit 1 */
    byte PTCPE2      :1;                                       /* Pullup Enable for Port C Bit 2 */
    byte PTCPE3      :1;                                       /* Pullup Enable for Port C Bit 3 */
    byte PTCPE4      :1;                                       /* Pullup Enable for Port C Bit 4 */
    byte PTCPE5      :1;                                       /* Pullup Enable for Port C Bit 5 */
    byte PTCPE6      :1;                                       /* Pullup Enable for Port C Bit 6 */
    byte PTCPE7      :1;                                       /* Pullup Enable for Port C Bit 7 */
  } Bits;
  struct {
    byte grpPTCPE :8;
  } MergedBits;
} PTCPESTR;
extern volatile PTCPESTR _PTCPE @0x00000009;
#define PTCPE _PTCPE.Byte
#define PTCPE_PTCPE0 _PTCPE.Bits.PTCPE0
#define PTCPE_PTCPE1 _PTCPE.Bits.PTCPE1
#define PTCPE_PTCPE2 _PTCPE.Bits.PTCPE2
#define PTCPE_PTCPE3 _PTCPE.Bits.PTCPE3
#define PTCPE_PTCPE4 _PTCPE.Bits.PTCPE4
#define PTCPE_PTCPE5 _PTCPE.Bits.PTCPE5
#define PTCPE_PTCPE6 _PTCPE.Bits.PTCPE6
#define PTCPE_PTCPE7 _PTCPE.Bits.PTCPE7
#define PTCPE_PTCPE _PTCPE.MergedBits.grpPTCPE

#define PTCPE_PTCPE0_MASK   1
#define PTCPE_PTCPE0_BITNUM 0
#define PTCPE_PTCPE1_MASK   2
#define PTCPE_PTCPE1_BITNUM 1
#define PTCPE_PTCPE2_MASK   4
#define PTCPE_PTCPE2_BITNUM 2
#define PTCPE_PTCPE3_MASK   8
#define PTCPE_PTCPE3_BITNUM 3
#define PTCPE_PTCPE4_MASK   16
#define PTCPE_PTCPE4_BITNUM 4
#define PTCPE_PTCPE5_MASK   32
#define PTCPE_PTCPE5_BITNUM 5
#define PTCPE_PTCPE6_MASK   64
#define PTCPE_PTCPE6_BITNUM 6
#define PTCPE_PTCPE7_MASK   128
#define PTCPE_PTCPE7_BITNUM 7
#define PTCPE_PTCPE_MASK  255
#define PTCPE_PTCPE_BITNUM  0


/*** PTCSE - Slew Rate Control Enable for Port C; 0x0000000A ***/
typedef union {
  byte Byte;
  struct {
    byte PTCSE0      :1;                                       /* Slew Rate Control Enable for Port C Bit 0 */
    byte PTCSE1      :1;                                       /* Slew Rate Control Enable for Port C Bit 1 */
    byte PTCSE2      :1;                                       /* Slew Rate Control Enable for Port C Bit 2 */
    byte PTCSE3      :1;                                       /* Slew Rate Control Enable for Port C Bit 3 */
    byte PTCSE4      :1;                                       /* Slew Rate Control Enable for Port C Bit 4 */
    byte PTCSE5      :1;                                       /* Slew Rate Control Enable for Port C Bit 5 */
    byte PTCSE6      :1;                                       /* Slew Rate Control Enable for Port C Bit 6 */
    byte PTCSE7      :1;                                       /* Slew Rate Control Enable for Port C Bit 7 */
  } Bits;
  struct {
    byte grpPTCSE :8;
  } MergedBits;
} PTCSESTR;
extern volatile PTCSESTR _PTCSE @0x0000000A;
#define PTCSE _PTCSE.Byte
#define PTCSE_PTCSE0 _PTCSE.Bits.PTCSE0
#define PTCSE_PTCSE1 _PTCSE.Bits.PTCSE1
#define PTCSE_PTCSE2 _PTCSE.Bits.PTCSE2
#define PTCSE_PTCSE3 _PTCSE.Bits.PTCSE3
#define PTCSE_PTCSE4 _PTCSE.Bits.PTCSE4
#define PTCSE_PTCSE5 _PTCSE.Bits.PTCSE5
#define PTCSE_PTCSE6 _PTCSE.Bits.PTCSE6
#define PTCSE_PTCSE7 _PTCSE.Bits.PTCSE7
#define PTCSE_PTCSE _PTCSE.MergedBits.grpPTCSE

#define PTCSE_PTCSE0_MASK   1
#define PTCSE_PTCSE0_BITNUM 0
#define PTCSE_PTCSE1_MASK   2
#define PTCSE_PTCSE1_BITNUM 1
#define PTCSE_PTCSE2_MASK   4
#define PTCSE_PTCSE2_BITNUM 2
#define PTCSE_PTCSE3_MASK   8
#define PTCSE_PTCSE3_BITNUM 3
#define PTCSE_PTCSE4_MASK   16
#define PTCSE_PTCSE4_BITNUM 4
#define PTCSE_PTCSE5_MASK   32
#define PTCSE_PTCSE5_BITNUM 5
#define PTCSE_PTCSE6_MASK   64
#define PTCSE_PTCSE6_BITNUM 6
#define PTCSE_PTCSE7_MASK   128
#define PTCSE_PTCSE7_BITNUM 7
#define PTCSE_PTCSE_MASK  255
#define PTCSE_PTCSE_BITNUM  0


/*** PTCDD - Data Direction Register C; 0x0000000B ***/
typedef union {
  byte Byte;
  struct {
    byte PTCDD0      :1;                                       /* Data Direction for Port C Bit 0 */
    byte PTCDD1      :1;                                       /* Data Direction for Port C Bit 1 */
    byte PTCDD2      :1;                                       /* Data Direction for Port C Bit 2 */
    byte PTCDD3      :1;                                       /* Data Direction for Port C Bit 3 */
    byte PTCDD4      :1;                                       /* Data Direction for Port C Bit 4 */
    byte PTCDD5      :1;                                       /* Data Direction for Port C Bit 5 */
    byte PTCDD6      :1;                                       /* Data Direction for Port C Bit 6 */
    byte PTCDD7      :1;                                       /* Data Direction for Port C Bit 7 */
  } Bits;
  struct {
    byte grpPTCDD :8;
  } MergedBits;
} PTCDDSTR;
extern volatile PTCDDSTR _PTCDD @0x0000000B;
#define PTCDD _PTCDD.Byte
#define PTCDD_PTCDD0 _PTCDD.Bits.PTCDD0
#define PTCDD_PTCDD1 _PTCDD.Bits.PTCDD1
#define PTCDD_PTCDD2 _PTCDD.Bits.PTCDD2
#define PTCDD_PTCDD3 _PTCDD.Bits.PTCDD3
#define PTCDD_PTCDD4 _PTCDD.Bits.PTCDD4
#define PTCDD_PTCDD5 _PTCDD.Bits.PTCDD5
#define PTCDD_PTCDD6 _PTCDD.Bits.PTCDD6
#define PTCDD_PTCDD7 _PTCDD.Bits.PTCDD7
#define PTCDD_PTCDD _PTCDD.MergedBits.grpPTCDD

#define PTCDD_PTCDD0_MASK   1
#define PTCDD_PTCDD0_BITNUM 0
#define PTCDD_PTCDD1_MASK   2
#define PTCDD_PTCDD1_BITNUM 1
#define PTCDD_PTCDD2_MASK   4
#define PTCDD_PTCDD2_BITNUM 2
#define PTCDD_PTCDD3_MASK   8
#define PTCDD_PTCDD3_BITNUM 3
#define PTCDD_PTCDD4_MASK   16
#define PTCDD_PTCDD4_BITNUM 4
#define PTCDD_PTCDD5_MASK   32
#define PTCDD_PTCDD5_BITNUM 5
#define PTCDD_PTCDD6_MASK   64
#define PTCDD_PTCDD6_BITNUM 6
#define PTCDD_PTCDD7_MASK   128
#define PTCDD_PTCDD7_BITNUM 7
#define PTCDD_PTCDD_MASK  255
#define PTCDD_PTCDD_BITNUM  0


/*** PTDD - Port D Data Register; 0x0000000C ***/
typedef union {
  byte Byte;
  struct {
    byte PTDD0       :1;                                       /* Port D Data Register Bit 0 */
    byte PTDD1       :1;                                       /* Port D Data Register Bit 1 */
    byte PTDD2       :1;                                       /* Port D Data Register Bit 2 */
    byte PTDD3       :1;                                       /* Port D Data Register Bit 3 */
    byte PTDD4       :1;                                       /* Port D Data Register Bit 4 */
    byte PTDD5       :1;                                       /* Port D Data Register Bit 5 */
    byte PTDD6       :1;                                       /* Port D Data Register Bit 6 */
    byte PTDD7       :1;                                       /* Port D Data Register Bit 7 */
  } Bits;
  struct {
    byte grpPTDD :8;
  } MergedBits;
} PTDDSTR;
extern volatile PTDDSTR _PTDD @0x0000000C;
#define PTDD _PTDD.Byte
#define PTDD_PTDD0 _PTDD.Bits.PTDD0
#define PTDD_PTDD1 _PTDD.Bits.PTDD1
#define PTDD_PTDD2 _PTDD.Bits.PTDD2
#define PTDD_PTDD3 _PTDD.Bits.PTDD3
#define PTDD_PTDD4 _PTDD.Bits.PTDD4
#define PTDD_PTDD5 _PTDD.Bits.PTDD5
#define PTDD_PTDD6 _PTDD.Bits.PTDD6
#define PTDD_PTDD7 _PTDD.Bits.PTDD7
#define PTDD_PTDD _PTDD.MergedBits.grpPTDD

