AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
#define PTDD_PTDD0_MASK   1
#define PTDD_PTDD0_BITNUM 0
#define PTDD_PTDD1_MASK   2
#define PTDD_PTDD1_BITNUM 1
#define PTDD_PTDD2_MASK   4
#define PTDD_PTDD2_BITNUM 2
#define PTDD_PTDD3_MASK   8
#define PTDD_PTDD3_BITNUM 3
#define PTDD_PTDD4_MASK   16
#define PTDD_PTDD4_BITNUM 4
#define PTDD_PTDD5_MASK   32
#define PTDD_PTDD5_BITNUM 5
#define PTDD_PTDD6_MASK   64
#define PTDD_PTDD6_BITNUM 6
#define PTDD_PTDD7_MASK   128
#define PTDD_PTDD7_BITNUM 7
#define PTDD_PTDD_MASK  255
#define PTDD_PTDD_BITNUM  0


/*** PTDPE - Pullup Enable for Port D; 0x0000000D ***/
typedef union {
  byte Byte;
  struct {
    byte PTDPE0      :1;                                       /* Pullup Enable for Port D Bit 0 */
    byte PTDPE1      :1;                                       /* Pullup Enable for Port D Bit 1 */
    byte PTDPE2      :1;                                       /* Pullup Enable for Port D Bit 2 */
    byte PTDPE3      :1;                                       /* Pullup Enable for Port D Bit 3 */
    byte PTDPE4      :1;                                       /* Pullup Enable for Port D Bit 4 */
    byte PTDPE5      :1;                                       /* Pullup Enable for Port D Bit 5 */
    byte PTDPE6      :1;                                       /* Pullup Enable for Port D Bit 6 */
    byte PTDPE7      :1;                                       /* Pullup Enable for Port D Bit 7 */
  } Bits;
  struct {
    byte grpPTDPE :8;
  } MergedBits;
} PTDPESTR;
extern volatile PTDPESTR _PTDPE @0x0000000D;
#define PTDPE _PTDPE.Byte
#define PTDPE_PTDPE0 _PTDPE.Bits.PTDPE0
#define PTDPE_PTDPE1 _PTDPE.Bits.PTDPE1
#define PTDPE_PTDPE2 _PTDPE.Bits.PTDPE2
#define PTDPE_PTDPE3 _PTDPE.Bits.PTDPE3
#define PTDPE_PTDPE4 _PTDPE.Bits.PTDPE4
#define PTDPE_PTDPE5 _PTDPE.Bits.PTDPE5
#define PTDPE_PTDPE6 _PTDPE.Bits.PTDPE6
#define PTDPE_PTDPE7 _PTDPE.Bits.PTDPE7
#define PTDPE_PTDPE _PTDPE.MergedBits.grpPTDPE

#define PTDPE_PTDPE0_MASK   1
#define PTDPE_PTDPE0_BITNUM 0
#define PTDPE_PTDPE1_MASK   2
#define PTDPE_PTDPE1_BITNUM 1
#define PTDPE_PTDPE2_MASK   4
#define PTDPE_PTDPE2_BITNUM 2
#define PTDPE_PTDPE3_MASK   8
#define PTDPE_PTDPE3_BITNUM 3
#define PTDPE_PTDPE4_MASK   16
#define PTDPE_PTDPE4_BITNUM 4
#define PTDPE_PTDPE5_MASK   32
#define PTDPE_PTDPE5_BITNUM 5
#define PTDPE_PTDPE6_MASK   64
#define PTDPE_PTDPE6_BITNUM 6
#define PTDPE_PTDPE7_MASK   128
#define PTDPE_PTDPE7_BITNUM 7
#define PTDPE_PTDPE_MASK  255
#define PTDPE_PTDPE_BITNUM  0


/*** PTDSE - Slew Rate Control Enable for Port D; 0x0000000E ***/
typedef union {
  byte Byte;
  struct {
    byte PTDSE0      :1;                                       /* Slew Rate Control Enable for Port D Bit 0 */
    byte PTDSE1      :1;                                       /* Slew Rate Control Enable for Port D Bit 1 */
    byte PTDSE2      :1;                                       /* Slew Rate Control Enable for Port D Bit 2 */
    byte PTDSE3      :1;                                       /* Slew Rate Control Enable for Port D Bit 3 */
    byte PTDSE4      :1;                                       /* Slew Rate Control Enable for Port D Bit 4 */
    byte PTDSE5      :1;                                       /* Slew Rate Control Enable for Port D Bit 5 */
    byte PTDSE6      :1;                                       /* Slew Rate Control Enable for Port D Bit 6 */
    byte PTDSE7      :1;                                       /* Slew Rate Control Enable for Port D Bit 7 */
  } Bits;
  struct {
    byte grpPTDSE :8;
  } MergedBits;
} PTDSESTR;
extern volatile PTDSESTR _PTDSE @0x0000000E;
#define PTDSE _PTDSE.Byte
#define PTDSE_PTDSE0 _PTDSE.Bits.PTDSE0
#define PTDSE_PTDSE1 _PTDSE.Bits.PTDSE1
#define PTDSE_PTDSE2 _PTDSE.Bits.PTDSE2
#define PTDSE_PTDSE3 _PTDSE.Bits.PTDSE3
#define PTDSE_PTDSE4 _PTDSE.Bits.PTDSE4
#define PTDSE_PTDSE5 _PTDSE.Bits.PTDSE5
#define PTDSE_PTDSE6 _PTDSE.Bits.PTDSE6
#define PTDSE_PTDSE7 _PTDSE.Bits.PTDSE7
#define PTDSE_PTDSE _PTDSE.MergedBits.grpPTDSE

#define PTDSE_PTDSE0_MASK   1
#define PTDSE_PTDSE0_BITNUM 0
#define PTDSE_PTDSE1_MASK   2
#define PTDSE_PTDSE1_BITNUM 1
#define PTDSE_PTDSE2_MASK   4
#define PTDSE_PTDSE2_BITNUM 2
#define PTDSE_PTDSE3_MASK   8
#define PTDSE_PTDSE3_BITNUM 3
#define PTDSE_PTDSE4_MASK   16
#define PTDSE_PTDSE4_BITNUM 4
#define PTDSE_PTDSE5_MASK   32
#define PTDSE_PTDSE5_BITNUM 5
#define PTDSE_PTDSE6_MASK   64
#define PTDSE_PTDSE6_BITNUM 6
#define PTDSE_PTDSE7_MASK   128
#define PTDSE_PTDSE7_BITNUM 7
#define PTDSE_PTDSE_MASK  255
#define PTDSE_PTDSE_BITNUM  0


/*** PTDDD - Data Direction Register D; 0x0000000F ***/
typedef union {
  byte Byte;
  struct {
    byte PTDDD0      :1;                                       /* Data Direction for Port D Bit 0 */
    byte PTDDD1      :1;                                       /* Data Direction for Port D Bit 1 */
    byte PTDDD2      :1;                                       /* Data Direction for Port D Bit 2 */
    byte PTDDD3      :1;                                       /* Data Direction for Port D Bit 3 */
    byte PTDDD4      :1;                                       /* Data Direction for Port D Bit 4 */
    byte PTDDD5      :1;                                       /* Data Direction for Port D Bit 5 */
    byte PTDDD6      :1;                                       /* Data Direction for Port D Bit 6 */
    byte PTDDD7      :1;                                       /* Data Direction for Port D Bit 7 */
  } Bits;
  struct {
    byte grpPTDDD :8;
  } MergedBits;
} PTDDDSTR;
extern volatile PTDDDSTR _PTDDD @0x0000000F;
#define PTDDD _PTDDD.Byte
#define PTDDD_PTDDD0 _PTDDD.Bits.PTDDD0
#define PTDDD_PTDDD1 _PTDDD.Bits.PTDDD1
#define PTDDD_PTDDD2 _PTDDD.Bits.PTDDD2
#define PTDDD_PTDDD3 _PTDDD.Bits.PTDDD3
#define PTDDD_PTDDD4 _PTDDD.Bits.PTDDD4
#define PTDDD_PTDDD5 _PTDDD.Bits.PTDDD5
#define PTDDD_PTDDD6 _PTDDD.Bits.PTDDD6
#define PTDDD_PTDDD7 _PTDDD.Bits.PTDDD7
#define PTDDD_PTDDD _PTDDD.MergedBits.grpPTDDD

#define PTDDD_PTDDD0_MASK   1
#define PTDDD_PTDDD0_BITNUM 0
#define PTDDD_PTDDD1_MASK   2
#define PTDDD_PTDDD1_BITNUM 1
#define PTDDD_PTDDD2_MASK   4
#define PTDDD_PTDDD2_BITNUM 2
#define PTDDD_PTDDD3_MASK   8
#define PTDDD_PTDDD3_BITNUM 3
#define PTDDD_PTDDD4_MASK   16
#define PTDDD_PTDDD4_BITNUM 4
#define PTDDD_PTDDD5_MASK   32
#define PTDDD_PTDDD5_BITNUM 5
#define PTDDD_PTDDD6_MASK   64
#define PTDDD_PTDDD6_BITNUM 6
#define PTDDD_PTDDD7_MASK   128
#define PTDDD_PTDDD7_BITNUM 7
#define PTDDD_PTDDD_MASK  255
#define PTDDD_PTDDD_BITNUM  0


