AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
/*** PTED - Port E Data Register; 0x00000010 ***/
typedef union {
  byte Byte;
  struct {
    byte PTED0       :1;                                       /* Port E Data Register Bit 0 */
    byte PTED1       :1;                                       /* Port E Data Register Bit 1 */
    byte PTED2       :1;                                       /* Port E Data Register Bit 2 */
    byte PTED3       :1;                                       /* Port E Data Register Bit 3 */
    byte PTED4       :1;                                       /* Port E Data Register Bit 4 */
    byte PTED5       :1;                                       /* Port E Data Register Bit 5 */
    byte PTED6       :1;                                       /* Port E Data Register Bit 6 */
    byte PTED7       :1;                                       /* Port E Data Register Bit 7 */
  } Bits;
  struct {
    byte grpPTED :8;
  } MergedBits;
} PTEDSTR;
extern volatile PTEDSTR _PTED @0x00000010;
#define PTED _PTED.Byte
#define PTED_PTED0 _PTED.Bits.PTED0
#define PTED_PTED1 _PTED.Bits.PTED1
#define PTED_PTED2 _PTED.Bits.PTED2
#define PTED_PTED3 _PTED.Bits.PTED3
#define PTED_PTED4 _PTED.Bits.PTED4
#define PTED_PTED5 _PTED.Bits.PTED5
#define PTED_PTED6 _PTED.Bits.PTED6
#define PTED_PTED7 _PTED.Bits.PTED7
#define PTED_PTED _PTED.MergedBits.grpPTED

#define PTED_PTED0_MASK   1
#define PTED_PTED0_BITNUM 0
#define PTED_PTED1_MASK   2
#define PTED_PTED1_BITNUM 1
#define PTED_PTED2_MASK   4
#define PTED_PTED2_BITNUM 2
#define PTED_PTED3_MASK   8
#define PTED_PTED3_BITNUM 3
#define PTED_PTED4_MASK   16
#define PTED_PTED4_BITNUM 4
#define PTED_PTED5_MASK   32
#define PTED_PTED5_BITNUM 5
#define PTED_PTED6_MASK   64
#define PTED_PTED6_BITNUM 6
#define PTED_PTED7_MASK   128
#define PTED_PTED7_BITNUM 7
#define PTED_PTED_MASK  255
#define PTED_PTED_BITNUM  0


/*** PTEPE - Pullup Enable for Port E; 0x00000011 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEPE0      :1;                                       /* Pullup Enable for Port E Bit 0 */
    byte PTEPE1      :1;                                       /* Pullup Enable for Port E Bit 1 */
    byte PTEPE2      :1;                                       /* Pullup Enable for Port E Bit 2 */
    byte PTEPE3      :1;                                       /* Pullup Enable for Port E Bit 3 */
    byte PTEPE4      :1;                                       /* Pullup Enable for Port E Bit 4 */
    byte PTEPE5      :1;                                       /* Pullup Enable for Port E Bit 5 */
    byte PTEPE6      :1;                                       /* Pullup Enable for Port E Bit 6 */
    byte PTEPE7      :1;                                       /* Pullup Enable for Port E Bit 7 */
  } Bits;
  struct {
    byte grpPTEPE :8;
  } MergedBits;
} PTEPESTR;
extern volatile PTEPESTR _PTEPE @0x00000011;
#define PTEPE _PTEPE.Byte
#define PTEPE_PTEPE0 _PTEPE.Bits.PTEPE0
#define PTEPE_PTEPE1 _PTEPE.Bits.PTEPE1
#define PTEPE_PTEPE2 _PTEPE.Bits.PTEPE2
#define PTEPE_PTEPE3 _PTEPE.Bits.PTEPE3
#define PTEPE_PTEPE4 _PTEPE.Bits.PTEPE4
#define PTEPE_PTEPE5 _PTEPE.Bits.PTEPE5
#define PTEPE_PTEPE6 _PTEPE.Bits.PTEPE6
#define PTEPE_PTEPE7 _PTEPE.Bits.PTEPE7
#define PTEPE_PTEPE _PTEPE.MergedBits.grpPTEPE

#define PTEPE_PTEPE0_MASK   1
#define PTEPE_PTEPE0_BITNUM 0
#define PTEPE_PTEPE1_MASK   2
#define PTEPE_PTEPE1_BITNUM 1
#define PTEPE_PTEPE2_MASK   4
#define PTEPE_PTEPE2_BITNUM 2
#define PTEPE_PTEPE3_MASK   8
#define PTEPE_PTEPE3_BITNUM 3
#define PTEPE_PTEPE4_MASK   16
#define PTEPE_PTEPE4_BITNUM 4
#define PTEPE_PTEPE5_MASK   32
#define PTEPE_PTEPE5_BITNUM 5
#define PTEPE_PTEPE6_MASK   64
#define PTEPE_PTEPE6_BITNUM 6
#define PTEPE_PTEPE7_MASK   128
#define PTEPE_PTEPE7_BITNUM 7
#define PTEPE_PTEPE_MASK  255
#define PTEPE_PTEPE_BITNUM  0


/*** PTESE - Slew Rate Control Enable for Port E; 0x00000012 ***/
typedef union {
  byte Byte;
  struct {
    byte PTESE0      :1;                                       /* Slew Rate Control Enable for Port E Bit 0 */
    byte PTESE1      :1;                                       /* Slew Rate Control Enable for Port E Bit 1 */
    byte PTESE2      :1;                                       /* Slew Rate Control Enable for Port E Bit 2 */
    byte PTESE3      :1;                                       /* Slew Rate Control Enable for Port E Bit 3 */
    byte PTESE4      :1;                                       /* Slew Rate Control Enable for Port E Bit 4 */
    byte PTESE5      :1;                                       /* Slew Rate Control Enable for Port E Bit 5 */
    byte PTESE6      :1;                                       /* Slew Rate Control Enable for Port E Bit 6 */
    byte PTESE7      :1;                                       /* Slew Rate Control Enable for Port E Bit 7 */
  } Bits;
  struct {
    byte grpPTESE :8;
  } MergedBits;
} PTESESTR;
extern volatile PTESESTR _PTESE @0x00000012;
#define PTESE _PTESE.Byte
#define PTESE_PTESE0 _PTESE.Bits.PTESE0
#define PTESE_PTESE1 _PTESE.Bits.PTESE1
#define PTESE_PTESE2 _PTESE.Bits.PTESE2
#define PTESE_PTESE3 _PTESE.Bits.PTESE3
#define PTESE_PTESE4 _PTESE.Bits.PTESE4
#define PTESE_PTESE5 _PTESE.Bits.PTESE5
#define PTESE_PTESE6 _PTESE.Bits.PTESE6
#define PTESE_PTESE7 _PTESE.Bits.PTESE7
#define PTESE_PTESE _PTESE.MergedBits.grpPTESE

#define PTESE_PTESE0_MASK   1
#define PTESE_PTESE0_BITNUM 0
#define PTESE_PTESE1_MASK   2
#define PTESE_PTESE1_BITNUM 1
#define PTESE_PTESE2_MASK   4
#define PTESE_PTESE2_BITNUM 2
#define PTESE_PTESE3_MASK   8
#define PTESE_PTESE3_BITNUM 3
#define PTESE_PTESE4_MASK   16
#define PTESE_PTESE4_BITNUM 4
#define PTESE_PTESE5_MASK   32
#define PTESE_PTESE5_BITNUM 5
#define PTESE_PTESE6_MASK   64
#define PTESE_PTESE6_BITNUM 6
#define PTESE_PTESE7_MASK   128
#define PTESE_PTESE7_BITNUM 7
#define PTESE_PTESE_MASK  255
#define PTESE_PTESE_BITNUM  0


/*** PTEDD - Data Direction Register E; 0x00000013 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEDD0      :1;                                       /* Data Direction for Port E Bit 0 */
    byte PTEDD1      :1;                                       /* Data Direction for Port E Bit 1 */
    byte PTEDD2      :1;                                       /* Data Direction for Port E Bit 2 */
    byte PTEDD3      :1;                                       /* Data Direction for Port E Bit 3 */
    byte PTEDD4      :1;                                       /* Data Direction for Port E Bit 4 */
    byte PTEDD5      :1;                                       /* Data Direction for Port E Bit 5 */
    byte PTEDD6      :1;                                       /* Data Direction for Port E Bit 6 */
    byte PTEDD7      :1;                                       /* Data Direction for Port E Bit 7 */
  } Bits;
  struct {
    byte grpPTEDD :8;
  } MergedBits;
} PTEDDSTR;
