AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
extern volatile PTEDDSTR _PTEDD @0x00000013;
#define PTEDD _PTEDD.Byte
#define PTEDD_PTEDD0 _PTEDD.Bits.PTEDD0
#define PTEDD_PTEDD1 _PTEDD.Bits.PTEDD1
#define PTEDD_PTEDD2 _PTEDD.Bits.PTEDD2
#define PTEDD_PTEDD3 _PTEDD.Bits.PTEDD3
#define PTEDD_PTEDD4 _PTEDD.Bits.PTEDD4
#define PTEDD_PTEDD5 _PTEDD.Bits.PTEDD5
#define PTEDD_PTEDD6 _PTEDD.Bits.PTEDD6
#define PTEDD_PTEDD7 _PTEDD.Bits.PTEDD7
#define PTEDD_PTEDD _PTEDD.MergedBits.grpPTEDD

#define PTEDD_PTEDD0_MASK   1
#define PTEDD_PTEDD0_BITNUM 0
#define PTEDD_PTEDD1_MASK   2
#define PTEDD_PTEDD1_BITNUM 1
#define PTEDD_PTEDD2_MASK   4
#define PTEDD_PTEDD2_BITNUM 2
#define PTEDD_PTEDD3_MASK   8
#define PTEDD_PTEDD3_BITNUM 3
#define PTEDD_PTEDD4_MASK   16
#define PTEDD_PTEDD4_BITNUM 4
#define PTEDD_PTEDD5_MASK   32
#define PTEDD_PTEDD5_BITNUM 5
#define PTEDD_PTEDD6_MASK   64
#define PTEDD_PTEDD6_BITNUM 6
#define PTEDD_PTEDD7_MASK   128
#define PTEDD_PTEDD7_BITNUM 7
#define PTEDD_PTEDD_MASK  255
#define PTEDD_PTEDD_BITNUM  0


/*** IRQSC - Interrupt Request Status and Control Register; 0x00000014 ***/
typedef union {
  byte Byte;
  struct {
    byte IRQMOD      :1;                                       /* IRQ Detection Mode */
    byte IRQIE       :1;                                       /* IRQ Interrupt Enable */
    byte IRQACK      :1;                                       /* IRQ Acknowledge */
    byte IRQF        :1;                                       /* IRQ Flag */
    byte IRQPE       :1;                                       /* IRQ Pin Enable */
    byte IRQEDG      :1;                                       /* Interrupt Request (IRQ) Edge Select */
    byte             :1;
    byte             :1;
  } Bits;
} IRQSCSTR;
extern volatile IRQSCSTR _IRQSC @0x00000014;
#define IRQSC _IRQSC.Byte
#define IRQSC_IRQMOD _IRQSC.Bits.IRQMOD
#define IRQSC_IRQIE _IRQSC.Bits.IRQIE
#define IRQSC_IRQACK _IRQSC.Bits.IRQACK
#define IRQSC_IRQF _IRQSC.Bits.IRQF
#define IRQSC_IRQPE _IRQSC.Bits.IRQPE
#define IRQSC_IRQEDG _IRQSC.Bits.IRQEDG

#define IRQSC_IRQMOD_MASK   1
#define IRQSC_IRQMOD_BITNUM 0
#define IRQSC_IRQIE_MASK   2
#define IRQSC_IRQIE_BITNUM 1
#define IRQSC_IRQACK_MASK   4
#define IRQSC_IRQACK_BITNUM 2
#define IRQSC_IRQF_MASK   8
#define IRQSC_IRQF_BITNUM 3
#define IRQSC_IRQPE_MASK   16
#define IRQSC_IRQPE_BITNUM 4
#define IRQSC_IRQEDG_MASK   32
#define IRQSC_IRQEDG_BITNUM 5


/*** KBI1SC - KBI1 Status and Control; 0x00000016 ***/
typedef union {
  byte Byte;
  struct {
    byte KBIMOD      :1;                                       /* Keyboard Detection Mode */
    byte KBI1E       :1;                                       /* Keyboard Interrupt Enable */
    byte KBACK       :1;                                       /* Keyboard Interrupt Acknowledge */
    byte KBF         :1;                                       /* Keyboard Interrupt Flag */
    byte KBEDG4      :1;                                       /* Keyboard Edge Select for Port A Bit 4 */
    byte KBEDG5      :1;                                       /* Keyboard Edge Select for Port A Bit 5 */
    byte KBEDG6      :1;                                       /* Keyboard Edge Select for Port A Bit 6 */
    byte KBEDG7      :1;                                       /* Keyboard Edge Select for Port A Bit 7 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpKBEDG_4 :4;
  } MergedBits;
} KBI1SCSTR;
extern volatile KBI1SCSTR _KBI1SC @0x00000016;
#define KBI1SC _KBI1SC.Byte
#define KBI1SC_KBIMOD _KBI1SC.Bits.KBIMOD
#define KBI1SC_KBI1E _KBI1SC.Bits.KBI1E
#define KBI1SC_KBACK _KBI1SC.Bits.KBACK
#define KBI1SC_KBF _KBI1SC.Bits.KBF
#define KBI1SC_KBEDG4 _KBI1SC.Bits.KBEDG4
#define KBI1SC_KBEDG5 _KBI1SC.Bits.KBEDG5
#define KBI1SC_KBEDG6 _KBI1SC.Bits.KBEDG6
#define KBI1SC_KBEDG7 _KBI1SC.Bits.KBEDG7
#define KBI1SC_KBEDG_4 _KBI1SC.MergedBits.grpKBEDG_4
#define KBI1SC_KBEDG KBI1SC_KBEDG_4

#define KBI1SC_KBIMOD_MASK   1
#define KBI1SC_KBIMOD_BITNUM 0
#define KBI1SC_KBI1E_MASK   2
#define KBI1SC_KBI1E_BITNUM 1
#define KBI1SC_KBACK_MASK   4
#define KBI1SC_KBACK_BITNUM 2
#define KBI1SC_KBF_MASK   8
#define KBI1SC_KBF_BITNUM 3
#define KBI1SC_KBEDG4_MASK   16
#define KBI1SC_KBEDG4_BITNUM 4
#define KBI1SC_KBEDG5_MASK   32
#define KBI1SC_KBEDG5_BITNUM 5
#define KBI1SC_KBEDG6_MASK   64
#define KBI1SC_KBEDG6_BITNUM 6
#define KBI1SC_KBEDG7_MASK   128
#define KBI1SC_KBEDG7_BITNUM 7
#define KBI1SC_KBEDG_4_MASK  240
#define KBI1SC_KBEDG_4_BITNUM  4


/*** KBI1PE - KBI1 Pin Enable Register; 0x00000017 ***/
typedef union {
  byte Byte;
  struct {
    byte KBI1PE0     :1;                                       /* Keyboard Pin Enable for Port A Bit 0 */
    byte KBI1PE1     :1;                                       /* Keyboard Pin Enable for Port A Bit 1 */
    byte KBI1PE2     :1;                                       /* Keyboard Pin Enable for Port A Bit 2 */
    byte KBI1PE3     :1;                                       /* Keyboard Pin Enable for Port A Bit 3 */
    byte KBI1PE4     :1;                                       /* Keyboard Pin Enable for Port A Bit 4 */
    byte KBI1PE5     :1;                                       /* Keyboard Pin Enable for Port A Bit 5 */
    byte KBI1PE6     :1;                                       /* Keyboard Pin Enable for Port A Bit 6 */
    byte KBI1PE7     :1;                                       /* Keyboard Pin Enable for Port A Bit 7 */
  } Bits;
  struct {
    byte grpKBI1PE :8;
  } MergedBits;
} KBI1PESTR;
extern volatile KBI1PESTR _KBI1PE @0x00000017;
#define KBI1PE _KBI1PE.Byte
#define KBI1PE_KBI1PE0 _KBI1PE.Bits.KBI1PE0
#define KBI1PE_KBI1PE1 _KBI1PE.Bits.KBI1PE1
#define KBI1PE_KBI1PE2 _KBI1PE.Bits.KBI1PE2
#define KBI1PE_KBI1PE3 _KBI1PE.Bits.KBI1PE3
#define KBI1PE_KBI1PE4 _KBI1PE.Bits.KBI1PE4
#define KBI1PE_KBI1PE5 _KBI1PE.Bits.KBI1PE5
#define KBI1PE_KBI1PE6 _KBI1PE.Bits.KBI1PE6
#define KBI1PE_KBI1PE7 _KBI1PE.Bits.KBI1PE7
#define KBI1PE_KBI1PE _KBI1PE.MergedBits.grpKBI1PE

#define KBI1PE_KBI1PE0_MASK   1
#define KBI1PE_KBI1PE0_BITNUM 0
#define KBI1PE_KBI1PE1_MASK   2
#define KBI1PE_KBI1PE1_BITNUM 1
#define KBI1PE_KBI1PE2_MASK   4
#define KBI1PE_KBI1PE2_BITNUM 2
#define KBI1PE_KBI1PE3_MASK   8
#define KBI1PE_KBI1PE3_BITNUM 3
#define KBI1PE_KBI1PE4_MASK   16
#define KBI1PE_KBI1PE4_BITNUM 4
#define KBI1PE_KBI1PE5_MASK   32
#define KBI1PE_KBI1PE5_BITNUM 5
#define KBI1PE_KBI1PE6_MASK   64
#define KBI1PE_KBI1PE6_BITNUM 6
#define KBI1PE_KBI1PE7_MASK   128
#define KBI1PE_KBI1PE7_BITNUM 7
#define KBI1PE_KBI1PE_MASK  255
#define KBI1PE_KBI1PE_BITNUM  0


/*** SCI1BD - SCI1 Baud Rate Register; 0x00000018 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SCI1BDH - SCI1 Baud Rate Register High; 0x00000018 ***/
    union {
      byte Byte;
      struct {
        byte SBR8        :1;                                       /* Baud Rate Modulo Divisor Bit 8 */
        byte SBR9        :1;                                       /* Baud Rate Modulo Divisor Bit 9 */
        byte SBR10       :1;                                       /* Baud Rate Modulo Divisor Bit 10 */
        byte SBR11       :1;                                       /* Baud Rate Modulo Divisor Bit 11 */
        byte SBR12       :1;                                       /* Baud Rate Modulo Divisor Bit 12 */
        byte             :1;
        byte             :1;
        byte             :1;
      } Bits;
      struct {
        byte grpSBR_8 :5;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } SCI1BDHSTR;
    #define SCI1BDH _SCI1BD.Overlap_STR.SCI1BDHSTR.Byte
    #define SCI1BDH_SBR8 _SCI1BD.Overlap_STR.SCI1BDHSTR.Bits.SBR8
    #define SCI1BDH_SBR9 _SCI1BD.Overlap_STR.SCI1BDHSTR.Bits.SBR9
    #define SCI1BDH_SBR10 _SCI1BD.Overlap_STR.SCI1BDHSTR.Bits.SBR10
    #define SCI1BDH_SBR11 _SCI1BD.Overlap_STR.SCI1BDHSTR.Bits.SBR11
    #define SCI1BDH_SBR12 _SCI1BD.Overlap_STR.SCI1BDHSTR.Bits.SBR12

    #define SCI1BDH_SBR_8 _SCI1BD.Overlap_STR.SCI1BDHSTR.MergedBits.grpSBR_8
    #define SCI1BDH_SBR SCI1BDH_SBR_8

    #define SCI1BDH_SBR8_MASK   1
    #define SCI1BDH_SBR8_BITNUM 0
    #define SCI1BDH_SBR9_MASK   2
    #define SCI1BDH_SBR9_BITNUM 1
    #define SCI1BDH_SBR10_MASK   4
    #define SCI1BDH_SBR10_BITNUM 2
    #define SCI1BDH_SBR11_MASK   8
    #define SCI1BDH_SBR11_BITNUM 3
    #define SCI1BDH_SBR12_MASK   16
    #define SCI1BDH_SBR12_BITNUM 4
    #define SCI1BDH_SBR_8_MASK  31
    #define SCI1BDH_SBR_8_BITNUM  0


    /*** SCI1BDL - SCI1 Baud Rate Register Low; 0x00000019 ***/
    union {
      byte Byte;
      struct {
        byte SBR0        :1;                                       /* Baud Rate Modulo Divisor Bit 0 */
        byte SBR1        :1;                                       /* Baud Rate Modulo Divisor Bit 1 */
        byte SBR2        :1;                                       /* Baud Rate Modulo Divisor Bit 2 */
        byte SBR3        :1;                                       /* Baud Rate Modulo Divisor Bit 3 */
        byte SBR4        :1;                                       /* Baud Rate Modulo Divisor Bit 4 */
        byte SBR5        :1;                                       /* Baud Rate Modulo Divisor Bit 5 */
        byte SBR6        :1;                                       /* Baud Rate Modulo Divisor Bit 6 */
        byte SBR7        :1;                                       /* Baud Rate Modulo Divisor Bit 7 */
      } Bits;
      struct {
        byte grpSBR :8;
      } MergedBits;
    } SCI1BDLSTR;
    #define SCI1BDL _SCI1BD.Overlap_STR.SCI1BDLSTR.Byte
    #define SCI1BDL_SBR0 _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR0
    #define SCI1BDL_SBR1 _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR1
    #define SCI1BDL_SBR2 _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR2
    #define SCI1BDL_SBR3 _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR3
    #define SCI1BDL_SBR4 _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR4
    #define SCI1BDL_SBR5 _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR5
    #define SCI1BDL_SBR6 _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR6
    #define SCI1BDL_SBR7 _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR7

    #define SCI1BDL_SBR _SCI1BD.Overlap_STR.SCI1BDLSTR.MergedBits.grpSBR

    #define SCI1BDL_SBR0_MASK   1
    #define SCI1BDL_SBR0_BITNUM 0
    #define SCI1BDL_SBR1_MASK   2
    #define SCI1BDL_SBR1_BITNUM 1
    #define SCI1BDL_SBR2_MASK   4
    #define SCI1BDL_SBR2_BITNUM 2
    #define SCI1BDL_SBR3_MASK   8
    #define SCI1BDL_SBR3_BITNUM 3
    #define SCI1BDL_SBR4_MASK   16
    #define SCI1BDL_SBR4_BITNUM 4
    #define SCI1BDL_SBR5_MASK   32
    #define SCI1BDL_SBR5_BITNUM 5
    #define SCI1BDL_SBR6_MASK   64
    #define SCI1BDL_SBR6_BITNUM 6
    #define SCI1BDL_SBR7_MASK   128
    #define SCI1BDL_SBR7_BITNUM 7
    #define SCI1BDL_SBR_MASK  255
    #define SCI1BDL_SBR_BITNUM  0

  } Overlap_STR;

