AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
  struct {
    word SBR0        :1;                                       /* Baud Rate Modulo Divisor Bit 0 */
    word SBR1        :1;                                       /* Baud Rate Modulo Divisor Bit 1 */
    word SBR2        :1;                                       /* Baud Rate Modulo Divisor Bit 2 */
    word SBR3        :1;                                       /* Baud Rate Modulo Divisor Bit 3 */
    word SBR4        :1;                                       /* Baud Rate Modulo Divisor Bit 4 */
    word SBR5        :1;                                       /* Baud Rate Modulo Divisor Bit 5 */
    word SBR6        :1;                                       /* Baud Rate Modulo Divisor Bit 6 */
    word SBR7        :1;                                       /* Baud Rate Modulo Divisor Bit 7 */
    word SBR8        :1;                                       /* Baud Rate Modulo Divisor Bit 8 */
    word SBR9        :1;                                       /* Baud Rate Modulo Divisor Bit 9 */
    word SBR10       :1;                                       /* Baud Rate Modulo Divisor Bit 10 */
    word SBR11       :1;                                       /* Baud Rate Modulo Divisor Bit 11 */
    word SBR12       :1;                                       /* Baud Rate Modulo Divisor Bit 12 */
    word             :1;
    word             :1;
    word             :1;
  } Bits;
  struct {
    word grpSBR  :13;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} SCI1BDSTR;
extern volatile SCI1BDSTR _SCI1BD @0x00000018;
#define SCI1BD _SCI1BD.Word
#define SCI1BD_SBR0 _SCI1BD.Bits.SBR0
#define SCI1BD_SBR1 _SCI1BD.Bits.SBR1
#define SCI1BD_SBR2 _SCI1BD.Bits.SBR2
#define SCI1BD_SBR3 _SCI1BD.Bits.SBR3
#define SCI1BD_SBR4 _SCI1BD.Bits.SBR4
#define SCI1BD_SBR5 _SCI1BD.Bits.SBR5
#define SCI1BD_SBR6 _SCI1BD.Bits.SBR6
#define SCI1BD_SBR7 _SCI1BD.Bits.SBR7
#define SCI1BD_SBR8 _SCI1BD.Bits.SBR8
#define SCI1BD_SBR9 _SCI1BD.Bits.SBR9
#define SCI1BD_SBR10 _SCI1BD.Bits.SBR10
#define SCI1BD_SBR11 _SCI1BD.Bits.SBR11
#define SCI1BD_SBR12 _SCI1BD.Bits.SBR12
#define SCI1BD_SBR _SCI1BD.MergedBits.grpSBR

#define SCI1BD_SBR0_MASK   1
#define SCI1BD_SBR0_BITNUM 0
#define SCI1BD_SBR1_MASK   2
#define SCI1BD_SBR1_BITNUM 1
#define SCI1BD_SBR2_MASK   4
#define SCI1BD_SBR2_BITNUM 2
#define SCI1BD_SBR3_MASK   8
#define SCI1BD_SBR3_BITNUM 3
#define SCI1BD_SBR4_MASK   16
#define SCI1BD_SBR4_BITNUM 4
#define SCI1BD_SBR5_MASK   32
#define SCI1BD_SBR5_BITNUM 5
#define SCI1BD_SBR6_MASK   64
#define SCI1BD_SBR6_BITNUM 6
#define SCI1BD_SBR7_MASK   128
#define SCI1BD_SBR7_BITNUM 7
#define SCI1BD_SBR8_MASK   256
#define SCI1BD_SBR8_BITNUM 8
#define SCI1BD_SBR9_MASK   512
#define SCI1BD_SBR9_BITNUM 9
#define SCI1BD_SBR10_MASK   1024
#define SCI1BD_SBR10_BITNUM 10
#define SCI1BD_SBR11_MASK   2048
#define SCI1BD_SBR11_BITNUM 11
#define SCI1BD_SBR12_MASK   4096
#define SCI1BD_SBR12_BITNUM 12
#define SCI1BD_SBR_MASK  8191
#define SCI1BD_SBR_BITNUM  0


/*** SCI1C1 - SCI1 Control Register 1; 0x0000001A ***/
typedef union {
  byte Byte;
  struct {
    byte PT          :1;                                       /* Parity Type */
    byte PE          :1;                                       /* Parity Enable */
    byte ILT         :1;                                       /* Idle Line Type Select */
    byte WAKE        :1;                                       /* Receiver Wakeup Method Select */
    byte M           :1;                                       /* 9-Bit or 8-Bit Mode Select */
    byte RSRC        :1;                                       /* Receiver Source Select */
    byte SCISWAI     :1;                                       /* SCI Stops in Wait Mode */
    byte LOOPS       :1;                                       /* Loop Mode Select */
  } Bits;
} SCI1C1STR;
extern volatile SCI1C1STR _SCI1C1 @0x0000001A;
#define SCI1C1 _SCI1C1.Byte
#define SCI1C1_PT _SCI1C1.Bits.PT
#define SCI1C1_PE _SCI1C1.Bits.PE
#define SCI1C1_ILT _SCI1C1.Bits.ILT
#define SCI1C1_WAKE _SCI1C1.Bits.WAKE
#define SCI1C1_M _SCI1C1.Bits.M
#define SCI1C1_RSRC _SCI1C1.Bits.RSRC
#define SCI1C1_SCISWAI _SCI1C1.Bits.SCISWAI
#define SCI1C1_LOOPS _SCI1C1.Bits.LOOPS

#define SCI1C1_PT_MASK   1
#define SCI1C1_PT_BITNUM 0
#define SCI1C1_PE_MASK   2
#define SCI1C1_PE_BITNUM 1
#define SCI1C1_ILT_MASK   4
#define SCI1C1_ILT_BITNUM 2
#define SCI1C1_WAKE_MASK   8
#define SCI1C1_WAKE_BITNUM 3
#define SCI1C1_M_MASK   16
#define SCI1C1_M_BITNUM 4
#define SCI1C1_RSRC_MASK   32
#define SCI1C1_RSRC_BITNUM 5
#define SCI1C1_SCISWAI_MASK   64
#define SCI1C1_SCISWAI_BITNUM 6
#define SCI1C1_LOOPS_MASK   128
#define SCI1C1_LOOPS_BITNUM 7


/*** SCI1C2 - SCI1 Control Register 2; 0x0000001B ***/
typedef union {
  byte Byte;
  struct {
    byte SBK         :1;                                       /* Send Break */
    byte RWU         :1;                                       /* Receiver Wakeup Control */
    byte RE          :1;                                       /* Receiver Enable */
    byte TE          :1;                                       /* Transmitter Enable */
    byte ILIE        :1;                                       /* Idle Line Interrupt Enable (for IDLE) */
    byte RIE         :1;                                       /* Receiver Interrupt Enable (for RDRF) */
    byte TCIE        :1;                                       /* Transmission Complete Interrupt Enable (for TC) */
    byte TIE         :1;                                       /* Transmit Interrupt Enable (for TDRE) */
  } Bits;
} SCI1C2STR;
extern volatile SCI1C2STR _SCI1C2 @0x0000001B;
#define SCI1C2 _SCI1C2.Byte
#define SCI1C2_SBK _SCI1C2.Bits.SBK
#define SCI1C2_RWU _SCI1C2.Bits.RWU
#define SCI1C2_RE _SCI1C2.Bits.RE
#define SCI1C2_TE _SCI1C2.Bits.TE
#define SCI1C2_ILIE _SCI1C2.Bits.ILIE
#define SCI1C2_RIE _SCI1C2.Bits.RIE
#define SCI1C2_TCIE _SCI1C2.Bits.TCIE
#define SCI1C2_TIE _SCI1C2.Bits.TIE

#define SCI1C2_SBK_MASK   1
#define SCI1C2_SBK_BITNUM 0
#define SCI1C2_RWU_MASK   2
#define SCI1C2_RWU_BITNUM 1
#define SCI1C2_RE_MASK   4
#define SCI1C2_RE_BITNUM 2
#define SCI1C2_TE_MASK   8
#define SCI1C2_TE_BITNUM 3
#define SCI1C2_ILIE_MASK   16
#define SCI1C2_ILIE_BITNUM 4
#define SCI1C2_RIE_MASK   32
#define SCI1C2_RIE_BITNUM 5
#define SCI1C2_TCIE_MASK   64
#define SCI1C2_TCIE_BITNUM 6
#define SCI1C2_TIE_MASK   128
#define SCI1C2_TIE_BITNUM 7


/*** SCI1S1 - SCI1 Status Register 1; 0x0000001C ***/
typedef union {
  byte Byte;
  struct {
    byte PF          :1;                                       /* Parity Error Flag */
    byte FE          :1;                                       /* Framing Error Flag */
    byte NF          :1;                                       /* Noise Flag */
    byte OR          :1;                                       /* Receiver Overrun Flag */
    byte IDLE        :1;                                       /* Idle Line Flag */
    byte RDRF        :1;                                       /* Receive Data Register Full Flag */
    byte TC          :1;                                       /* Transmission Complete Flag */
    byte TDRE        :1;                                       /* Transmit Data Register Empty Flag */
  } Bits;
} SCI1S1STR;
