AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
    #define SCI2BDH_SBR_8 _SCI2BD.Overlap_STR.SCI2BDHSTR.MergedBits.grpSBR_8
    #define SCI2BDH_SBR SCI2BDH_SBR_8

    #define SCI2BDH_SBR8_MASK   1
    #define SCI2BDH_SBR8_BITNUM 0
    #define SCI2BDH_SBR9_MASK   2
    #define SCI2BDH_SBR9_BITNUM 1
    #define SCI2BDH_SBR10_MASK   4
    #define SCI2BDH_SBR10_BITNUM 2
    #define SCI2BDH_SBR11_MASK   8
    #define SCI2BDH_SBR11_BITNUM 3
    #define SCI2BDH_SBR12_MASK   16
    #define SCI2BDH_SBR12_BITNUM 4
    #define SCI2BDH_SBR_8_MASK  31
    #define SCI2BDH_SBR_8_BITNUM  0


    /*** SCI2BDL - SCI2 Baud Rate Register Low; 0x00000021 ***/
    union {
      byte Byte;
      struct {
        byte SBR0        :1;                                       /* Baud Rate Modulo Divisor Bit 0 */
        byte SBR1        :1;                                       /* Baud Rate Modulo Divisor Bit 1 */
        byte SBR2        :1;                                       /* Baud Rate Modulo Divisor Bit 2 */
        byte SBR3        :1;                                       /* Baud Rate Modulo Divisor Bit 3 */
        byte SBR4        :1;                                       /* Baud Rate Modulo Divisor Bit 4 */
        byte SBR5        :1;                                       /* Baud Rate Modulo Divisor Bit 5 */
        byte SBR6        :1;                                       /* Baud Rate Modulo Divisor Bit 6 */
        byte SBR7        :1;                                       /* Baud Rate Modulo Divisor Bit 7 */
      } Bits;
      struct {
        byte grpSBR :8;
      } MergedBits;
    } SCI2BDLSTR;
    #define SCI2BDL _SCI2BD.Overlap_STR.SCI2BDLSTR.Byte
    #define SCI2BDL_SBR0 _SCI2BD.Overlap_STR.SCI2BDLSTR.Bits.SBR0
    #define SCI2BDL_SBR1 _SCI2BD.Overlap_STR.SCI2BDLSTR.Bits.SBR1
    #define SCI2BDL_SBR2 _SCI2BD.Overlap_STR.SCI2BDLSTR.Bits.SBR2
    #define SCI2BDL_SBR3 _SCI2BD.Overlap_STR.SCI2BDLSTR.Bits.SBR3
    #define SCI2BDL_SBR4 _SCI2BD.Overlap_STR.SCI2BDLSTR.Bits.SBR4
    #define SCI2BDL_SBR5 _SCI2BD.Overlap_STR.SCI2BDLSTR.Bits.SBR5
    #define SCI2BDL_SBR6 _SCI2BD.Overlap_STR.SCI2BDLSTR.Bits.SBR6
    #define SCI2BDL_SBR7 _SCI2BD.Overlap_STR.SCI2BDLSTR.Bits.SBR7

    #define SCI2BDL_SBR _SCI2BD.Overlap_STR.SCI2BDLSTR.MergedBits.grpSBR

    #define SCI2BDL_SBR0_MASK   1
    #define SCI2BDL_SBR0_BITNUM 0
    #define SCI2BDL_SBR1_MASK   2
    #define SCI2BDL_SBR1_BITNUM 1
    #define SCI2BDL_SBR2_MASK   4
    #define SCI2BDL_SBR2_BITNUM 2
    #define SCI2BDL_SBR3_MASK   8
    #define SCI2BDL_SBR3_BITNUM 3
    #define SCI2BDL_SBR4_MASK   16
    #define SCI2BDL_SBR4_BITNUM 4
    #define SCI2BDL_SBR5_MASK   32
    #define SCI2BDL_SBR5_BITNUM 5
    #define SCI2BDL_SBR6_MASK   64
    #define SCI2BDL_SBR6_BITNUM 6
    #define SCI2BDL_SBR7_MASK   128
    #define SCI2BDL_SBR7_BITNUM 7
    #define SCI2BDL_SBR_MASK  255
    #define SCI2BDL_SBR_BITNUM  0

  } Overlap_STR;

  struct {
    word SBR0        :1;                                       /* Baud Rate Modulo Divisor Bit 0 */
    word SBR1        :1;                                       /* Baud Rate Modulo Divisor Bit 1 */
    word SBR2        :1;                                       /* Baud Rate Modulo Divisor Bit 2 */
    word SBR3        :1;                                       /* Baud Rate Modulo Divisor Bit 3 */
    word SBR4        :1;                                       /* Baud Rate Modulo Divisor Bit 4 */
    word SBR5        :1;                                       /* Baud Rate Modulo Divisor Bit 5 */
    word SBR6        :1;                                       /* Baud Rate Modulo Divisor Bit 6 */
    word SBR7        :1;                                       /* Baud Rate Modulo Divisor Bit 7 */
    word SBR8        :1;                                       /* Baud Rate Modulo Divisor Bit 8 */
    word SBR9        :1;                                       /* Baud Rate Modulo Divisor Bit 9 */
    word SBR10       :1;                                       /* Baud Rate Modulo Divisor Bit 10 */
    word SBR11       :1;                                       /* Baud Rate Modulo Divisor Bit 11 */
    word SBR12       :1;                                       /* Baud Rate Modulo Divisor Bit 12 */
    word             :1;
    word             :1;
    word             :1;
  } Bits;
  struct {
    word grpSBR  :13;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} SCI2BDSTR;
extern volatile SCI2BDSTR _SCI2BD @0x00000020;
#define SCI2BD _SCI2BD.Word
#define SCI2BD_SBR0 _SCI2BD.Bits.SBR0
#define SCI2BD_SBR1 _SCI2BD.Bits.SBR1
#define SCI2BD_SBR2 _SCI2BD.Bits.SBR2
#define SCI2BD_SBR3 _SCI2BD.Bits.SBR3
#define SCI2BD_SBR4 _SCI2BD.Bits.SBR4
#define SCI2BD_SBR5 _SCI2BD.Bits.SBR5
#define SCI2BD_SBR6 _SCI2BD.Bits.SBR6
#define SCI2BD_SBR7 _SCI2BD.Bits.SBR7
#define SCI2BD_SBR8 _SCI2BD.Bits.SBR8
#define SCI2BD_SBR9 _SCI2BD.Bits.SBR9
#define SCI2BD_SBR10 _SCI2BD.Bits.SBR10
#define SCI2BD_SBR11 _SCI2BD.Bits.SBR11
#define SCI2BD_SBR12 _SCI2BD.Bits.SBR12
#define SCI2BD_SBR _SCI2BD.MergedBits.grpSBR

#define SCI2BD_SBR0_MASK   1
#define SCI2BD_SBR0_BITNUM 0
#define SCI2BD_SBR1_MASK   2
#define SCI2BD_SBR1_BITNUM 1
#define SCI2BD_SBR2_MASK   4
#define SCI2BD_SBR2_BITNUM 2
#define SCI2BD_SBR3_MASK   8
#define SCI2BD_SBR3_BITNUM 3
#define SCI2BD_SBR4_MASK   16
#define SCI2BD_SBR4_BITNUM 4
#define SCI2BD_SBR5_MASK   32
#define SCI2BD_SBR5_BITNUM 5
#define SCI2BD_SBR6_MASK   64
#define SCI2BD_SBR6_BITNUM 6
#define SCI2BD_SBR7_MASK   128
#define SCI2BD_SBR7_BITNUM 7
#define SCI2BD_SBR8_MASK   256
#define SCI2BD_SBR8_BITNUM 8
#define SCI2BD_SBR9_MASK   512
#define SCI2BD_SBR9_BITNUM 9
#define SCI2BD_SBR10_MASK   1024
#define SCI2BD_SBR10_BITNUM 10
#define SCI2BD_SBR11_MASK   2048
#define SCI2BD_SBR11_BITNUM 11
#define SCI2BD_SBR12_MASK   4096
#define SCI2BD_SBR12_BITNUM 12
#define SCI2BD_SBR_MASK  8191
#define SCI2BD_SBR_BITNUM  0


/*** SCI2C1 - SCI1 Control Register 1; 0x00000022 ***/
typedef union {
  byte Byte;
  struct {
    byte PT          :1;                                       /* Parity Type */
    byte PE          :1;                                       /* Parity Enable */
    byte ILT         :1;                                       /* Idle Line Type Select */
    byte WAKE        :1;                                       /* Receiver Wakeup Method Select */
    byte M           :1;                                       /* 9-Bit or 8-Bit Mode Select */
    byte RSRC        :1;                                       /* Receiver Source Select */
    byte SCISWAI     :1;                                       /* SCI Stops in Wait Mode */
    byte LOOPS       :1;                                       /* Loop Mode Select */
  } Bits;
} SCI2C1STR;
