AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
extern volatile SCI2C1STR _SCI2C1 @0x00000022;
#define SCI2C1 _SCI2C1.Byte
#define SCI2C1_PT _SCI2C1.Bits.PT
#define SCI2C1_PE _SCI2C1.Bits.PE
#define SCI2C1_ILT _SCI2C1.Bits.ILT
#define SCI2C1_WAKE _SCI2C1.Bits.WAKE
#define SCI2C1_M _SCI2C1.Bits.M
#define SCI2C1_RSRC _SCI2C1.Bits.RSRC
#define SCI2C1_SCISWAI _SCI2C1.Bits.SCISWAI
#define SCI2C1_LOOPS _SCI2C1.Bits.LOOPS

#define SCI2C1_PT_MASK   1
#define SCI2C1_PT_BITNUM 0
#define SCI2C1_PE_MASK   2
#define SCI2C1_PE_BITNUM 1
#define SCI2C1_ILT_MASK   4
#define SCI2C1_ILT_BITNUM 2
#define SCI2C1_WAKE_MASK   8
#define SCI2C1_WAKE_BITNUM 3
#define SCI2C1_M_MASK   16
#define SCI2C1_M_BITNUM 4
#define SCI2C1_RSRC_MASK   32
#define SCI2C1_RSRC_BITNUM 5
#define SCI2C1_SCISWAI_MASK   64
#define SCI2C1_SCISWAI_BITNUM 6
#define SCI2C1_LOOPS_MASK   128
#define SCI2C1_LOOPS_BITNUM 7


/*** SCI2C2 - SCI2 Control Register 2; 0x00000023 ***/
typedef union {
  byte Byte;
  struct {
    byte SBK         :1;                                       /* Send Break */
    byte RWU         :1;                                       /* Receiver Wakeup Control */
    byte RE          :1;                                       /* Receiver Enable */
    byte TE          :1;                                       /* Transmitter Enable */
    byte ILIE        :1;                                       /* Idle Line Interrupt Enable (for IDLE) */
    byte RIE         :1;                                       /* Receiver Interrupt Enable (for RDRF) */
    byte TCIE        :1;                                       /* Transmission Complete Interrupt Enable (for TC) */
    byte TIE         :1;                                       /* Transmit Interrupt Enable (for TDRE) */
  } Bits;
} SCI2C2STR;
extern volatile SCI2C2STR _SCI2C2 @0x00000023;
#define SCI2C2 _SCI2C2.Byte
#define SCI2C2_SBK _SCI2C2.Bits.SBK
#define SCI2C2_RWU _SCI2C2.Bits.RWU
#define SCI2C2_RE _SCI2C2.Bits.RE
#define SCI2C2_TE _SCI2C2.Bits.TE
#define SCI2C2_ILIE _SCI2C2.Bits.ILIE
#define SCI2C2_RIE _SCI2C2.Bits.RIE
#define SCI2C2_TCIE _SCI2C2.Bits.TCIE
#define SCI2C2_TIE _SCI2C2.Bits.TIE

#define SCI2C2_SBK_MASK   1
#define SCI2C2_SBK_BITNUM 0
#define SCI2C2_RWU_MASK   2
#define SCI2C2_RWU_BITNUM 1
#define SCI2C2_RE_MASK   4
#define SCI2C2_RE_BITNUM 2
#define SCI2C2_TE_MASK   8
#define SCI2C2_TE_BITNUM 3
#define SCI2C2_ILIE_MASK   16
#define SCI2C2_ILIE_BITNUM 4
#define SCI2C2_RIE_MASK   32
#define SCI2C2_RIE_BITNUM 5
#define SCI2C2_TCIE_MASK   64
#define SCI2C2_TCIE_BITNUM 6
#define SCI2C2_TIE_MASK   128
#define SCI2C2_TIE_BITNUM 7


/*** SCI2S1 - SCI2 Status Register 1; 0x00000024 ***/
typedef union {
  byte Byte;
  struct {
    byte PF          :1;                                       /* Parity Error Flag */
    byte FE          :1;                                       /* Framing Error Flag */
    byte NF          :1;                                       /* Noise Flag */
    byte OR          :1;                                       /* Receiver Overrun Flag */
    byte IDLE        :1;                                       /* Idle Line Flag */
    byte RDRF        :1;                                       /* Receive Data Register Full Flag */
    byte TC          :1;                                       /* Transmission Complete Flag */
    byte TDRE        :1;                                       /* Transmit Data Register Empty Flag */
  } Bits;
} SCI2S1STR;
extern volatile SCI2S1STR _SCI2S1 @0x00000024;
#define SCI2S1 _SCI2S1.Byte
#define SCI2S1_PF _SCI2S1.Bits.PF
#define SCI2S1_FE _SCI2S1.Bits.FE
#define SCI2S1_NF _SCI2S1.Bits.NF
#define SCI2S1_OR _SCI2S1.Bits.OR
#define SCI2S1_IDLE _SCI2S1.Bits.IDLE
#define SCI2S1_RDRF _SCI2S1.Bits.RDRF
#define SCI2S1_TC _SCI2S1.Bits.TC
#define SCI2S1_TDRE _SCI2S1.Bits.TDRE

#define SCI2S1_PF_MASK   1
#define SCI2S1_PF_BITNUM 0
#define SCI2S1_FE_MASK   2
#define SCI2S1_FE_BITNUM 1
#define SCI2S1_NF_MASK   4
#define SCI2S1_NF_BITNUM 2
#define SCI2S1_OR_MASK   8
#define SCI2S1_OR_BITNUM 3
#define SCI2S1_IDLE_MASK   16
#define SCI2S1_IDLE_BITNUM 4
#define SCI2S1_RDRF_MASK   32
#define SCI2S1_RDRF_BITNUM 5
#define SCI2S1_TC_MASK   64
#define SCI2S1_TC_BITNUM 6
#define SCI2S1_TDRE_MASK   128
#define SCI2S1_TDRE_BITNUM 7


/*** SCI2S2 - SCI2 Status Register 2; 0x00000025 ***/
typedef union {
  byte Byte;
  struct {
    byte RAF         :1;                                       /* Receiver Active Flag */
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
  } Bits;
} SCI2S2STR;
extern volatile SCI2S2STR _SCI2S2 @0x00000025;
#define SCI2S2 _SCI2S2.Byte
#define SCI2S2_RAF _SCI2S2.Bits.RAF

#define SCI2S2_RAF_MASK   1
#define SCI2S2_RAF_BITNUM 0


/*** SCI2C3 - SCI2 Control Register 3; 0x00000026 ***/
typedef union {
  byte Byte;
  struct {
    byte PEIE        :1;                                       /* Parity Error Interrupt Enable */
    byte FEIE        :1;                                       /* Framing Error Interrupt Enable */
    byte NEIE        :1;                                       /* Noise Error Interrupt Enable */
    byte ORIE        :1;                                       /* Overrun Interrupt Enable */
    byte             :1;
    byte TXDIR       :1;                                       /* TxD Pin Direction in Single-Wire Mode */
    byte T8          :1;                                       /* Ninth Data Bit for Transmitter */
    byte R8          :1;                                       /* Ninth Data Bit for Receiver */
  } Bits;
} SCI2C3STR;
extern volatile SCI2C3STR _SCI2C3 @0x00000026;
#define SCI2C3 _SCI2C3.Byte
#define SCI2C3_PEIE _SCI2C3.Bits.PEIE
#define SCI2C3_FEIE _SCI2C3.Bits.FEIE
#define SCI2C3_NEIE _SCI2C3.Bits.NEIE
#define SCI2C3_ORIE _SCI2C3.Bits.ORIE
#define SCI2C3_TXDIR _SCI2C3.Bits.TXDIR
#define SCI2C3_T8 _SCI2C3.Bits.T8
#define SCI2C3_R8 _SCI2C3.Bits.R8

#define SCI2C3_PEIE_MASK   1
#define SCI2C3_PEIE_BITNUM 0
#define SCI2C3_FEIE_MASK   2
#define SCI2C3_FEIE_BITNUM 1
#define SCI2C3_NEIE_MASK   4
#define SCI2C3_NEIE_BITNUM 2
#define SCI2C3_ORIE_MASK   8
#define SCI2C3_ORIE_BITNUM 3
#define SCI2C3_TXDIR_MASK   32
#define SCI2C3_TXDIR_BITNUM 5
#define SCI2C3_T8_MASK   64
#define SCI2C3_T8_BITNUM 6
#define SCI2C3_R8_MASK   128
#define SCI2C3_R8_BITNUM 7


/*** SCI2D - SCI2 Data Register; 0x00000027 ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Receive/Transmit Data Bit 0 */
    byte R1_T1       :1;                                       /* Receive/Transmit Data Bit 1 */
    byte R2_T2       :1;                                       /* Receive/Transmit Data Bit 2 */
    byte R3_T3       :1;                                       /* Receive/Transmit Data Bit 3 */
    byte R4_T4       :1;                                       /* Receive/Transmit Data Bit 4 */
    byte R5_T5       :1;                                       /* Receive/Transmit Data Bit 5 */
    byte R6_T6       :1;                                       /* Receive/Transmit Data Bit 6 */
    byte R7_T7       :1;                                       /* Receive/Transmit Data Bit 7 */
  } Bits;
} SCI2DSTR;
