AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
extern volatile SCI2DSTR _SCI2D @0x00000027;
#define SCI2D _SCI2D.Byte
#define SCI2D_R0_T0 _SCI2D.Bits.R0_T0
#define SCI2D_R1_T1 _SCI2D.Bits.R1_T1
#define SCI2D_R2_T2 _SCI2D.Bits.R2_T2
#define SCI2D_R3_T3 _SCI2D.Bits.R3_T3
#define SCI2D_R4_T4 _SCI2D.Bits.R4_T4
#define SCI2D_R5_T5 _SCI2D.Bits.R5_T5
#define SCI2D_R6_T6 _SCI2D.Bits.R6_T6
#define SCI2D_R7_T7 _SCI2D.Bits.R7_T7

#define SCI2D_R0_T0_MASK   1
#define SCI2D_R0_T0_BITNUM 0
#define SCI2D_R1_T1_MASK   2
#define SCI2D_R1_T1_BITNUM 1
#define SCI2D_R2_T2_MASK   4
#define SCI2D_R2_T2_BITNUM 2
#define SCI2D_R3_T3_MASK   8
#define SCI2D_R3_T3_BITNUM 3
#define SCI2D_R4_T4_MASK   16
#define SCI2D_R4_T4_BITNUM 4
#define SCI2D_R5_T5_MASK   32
#define SCI2D_R5_T5_BITNUM 5
#define SCI2D_R6_T6_MASK   64
#define SCI2D_R6_T6_BITNUM 6
#define SCI2D_R7_T7_MASK   128
#define SCI2D_R7_T7_BITNUM 7


/*** SPI1C1 - SPI1 Control Register 1; 0x00000028 ***/
typedef union {
  byte Byte;
  struct {
    byte LSBFE       :1;                                       /* LSB First (shifter direction) */
    byte SSOE        :1;                                       /* Slave Select Output Enable */
    byte CPHA        :1;                                       /* Clock Phase */
    byte CPOL        :1;                                       /* Clock Polarity */
    byte MSTR        :1;                                       /* Master/Slave Mode Select */
    byte SPTIE       :1;                                       /* SPI1 Transmit Interrupt Enable */
    byte SPE         :1;                                       /* SPI1 System Enable */
    byte SPI1E       :1;                                       /* SPI1 Interrupt Enable */
  } Bits;
} SPI1C1STR;
extern volatile SPI1C1STR _SPI1C1 @0x00000028;
#define SPI1C1 _SPI1C1.Byte
#define SPI1C1_LSBFE _SPI1C1.Bits.LSBFE
#define SPI1C1_SSOE _SPI1C1.Bits.SSOE
#define SPI1C1_CPHA _SPI1C1.Bits.CPHA
#define SPI1C1_CPOL _SPI1C1.Bits.CPOL
#define SPI1C1_MSTR _SPI1C1.Bits.MSTR
#define SPI1C1_SPTIE _SPI1C1.Bits.SPTIE
#define SPI1C1_SPE _SPI1C1.Bits.SPE
#define SPI1C1_SPI1E _SPI1C1.Bits.SPI1E

#define SPI1C1_LSBFE_MASK   1
#define SPI1C1_LSBFE_BITNUM 0
#define SPI1C1_SSOE_MASK   2
#define SPI1C1_SSOE_BITNUM 1
#define SPI1C1_CPHA_MASK   4
#define SPI1C1_CPHA_BITNUM 2
#define SPI1C1_CPOL_MASK   8
#define SPI1C1_CPOL_BITNUM 3
#define SPI1C1_MSTR_MASK   16
#define SPI1C1_MSTR_BITNUM 4
#define SPI1C1_SPTIE_MASK   32
#define SPI1C1_SPTIE_BITNUM 5
#define SPI1C1_SPE_MASK   64
#define SPI1C1_SPE_BITNUM 6
#define SPI1C1_SPI1E_MASK   128
#define SPI1C1_SPI1E_BITNUM 7


/*** SPI1C2 - SPI1 Control Register 2; 0x00000029 ***/
typedef union {
  byte Byte;
  struct {
    byte SPC0        :1;                                       /* SPI1 Pin Control 0 */
    byte SPISWAI     :1;                                       /* SPI1 Stop in Wait Mode */
    byte             :1;
    byte BIDIROE     :1;                                       /* Bidirectional Mode Output Enable */
    byte MODFEN      :1;                                       /* Master Mode-Fault Function Enable */
    byte             :1;
    byte             :1;
    byte             :1;
  } Bits;
} SPI1C2STR;
extern volatile SPI1C2STR _SPI1C2 @0x00000029;
#define SPI1C2 _SPI1C2.Byte
#define SPI1C2_SPC0 _SPI1C2.Bits.SPC0
#define SPI1C2_SPISWAI _SPI1C2.Bits.SPISWAI
#define SPI1C2_BIDIROE _SPI1C2.Bits.BIDIROE
#define SPI1C2_MODFEN _SPI1C2.Bits.MODFEN

#define SPI1C2_SPC0_MASK   1
#define SPI1C2_SPC0_BITNUM 0
#define SPI1C2_SPISWAI_MASK   2
#define SPI1C2_SPISWAI_BITNUM 1
#define SPI1C2_BIDIROE_MASK   8
#define SPI1C2_BIDIROE_BITNUM 3
#define SPI1C2_MODFEN_MASK   16
#define SPI1C2_MODFEN_BITNUM 4


/*** SPI1BR - SPI1 Baud Rate Register; 0x0000002A ***/
typedef union {
  byte Byte;
  struct {
    byte SPR0        :1;                                       /* SPI1 Baud Rate Divisor Bit 0 */
    byte SPR1        :1;                                       /* SPI1 Baud Rate Divisor Bit 1 */
    byte SPR2        :1;                                       /* SPI1 Baud Rate Divisor Bit 2 */
    byte             :1;
    byte SPPR0       :1;                                       /* SPI1 Baud Rate Prescale Divisor Bit 0 */
    byte SPPR1       :1;                                       /* SPI1 Baud Rate Prescale Divisor Bit 1 */
    byte SPPR2       :1;                                       /* SPI1 Baud Rate Prescale Divisor Bit 2 */
    byte             :1;
  } Bits;
  struct {
    byte grpSPR  :3;
    byte         :1;
    byte grpSPPR :3;
    byte         :1;
  } MergedBits;
} SPI1BRSTR;
extern volatile SPI1BRSTR _SPI1BR @0x0000002A;
#define SPI1BR _SPI1BR.Byte
#define SPI1BR_SPR0 _SPI1BR.Bits.SPR0
#define SPI1BR_SPR1 _SPI1BR.Bits.SPR1
#define SPI1BR_SPR2 _SPI1BR.Bits.SPR2
#define SPI1BR_SPPR0 _SPI1BR.Bits.SPPR0
#define SPI1BR_SPPR1 _SPI1BR.Bits.SPPR1
#define SPI1BR_SPPR2 _SPI1BR.Bits.SPPR2
#define SPI1BR_SPR _SPI1BR.MergedBits.grpSPR
#define SPI1BR_SPPR _SPI1BR.MergedBits.grpSPPR

#define SPI1BR_SPR0_MASK   1
#define SPI1BR_SPR0_BITNUM 0
#define SPI1BR_SPR1_MASK   2
#define SPI1BR_SPR1_BITNUM 1
#define SPI1BR_SPR2_MASK   4
#define SPI1BR_SPR2_BITNUM 2
#define SPI1BR_SPPR0_MASK   16
#define SPI1BR_SPPR0_BITNUM 4
#define SPI1BR_SPPR1_MASK   32
#define SPI1BR_SPPR1_BITNUM 5
#define SPI1BR_SPPR2_MASK   64
#define SPI1BR_SPPR2_BITNUM 6
#define SPI1BR_SPR_MASK  7
#define SPI1BR_SPR_BITNUM  0
#define SPI1BR_SPPR_MASK  112
#define SPI1BR_SPPR_BITNUM  4


/*** SPI1S - SPI1 Status Register; 0x0000002B ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte MODF        :1;                                       /* Master Mode Fault Flag */
    byte SPTEF       :1;                                       /* SPI1 Transmit Buffer Empty Flag */
    byte             :1;
    byte SPRF        :1;                                       /* SPI1 Read Buffer Full Flag */
  } Bits;
} SPI1SSTR;
extern volatile SPI1SSTR _SPI1S @0x0000002B;
#define SPI1S _SPI1S.Byte
#define SPI1S_MODF _SPI1S.Bits.MODF
#define SPI1S_SPTEF _SPI1S.Bits.SPTEF
#define SPI1S_SPRF _SPI1S.Bits.SPRF

