AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
#define SPI1S_MODF_MASK   16
#define SPI1S_MODF_BITNUM 4
#define SPI1S_SPTEF_MASK   32
#define SPI1S_SPTEF_BITNUM 5
#define SPI1S_SPRF_MASK   128
#define SPI1S_SPRF_BITNUM 7


/*** SPI1D - SPI1 Data Register; 0x0000002D ***/
typedef union {
  byte Byte;
  struct {
    byte grpBit  :8;
  } MergedBits;
} SPI1DSTR;
extern volatile SPI1DSTR _SPI1D @0x0000002D;
#define SPI1D _SPI1D.Byte
#define SPI1D_Bit _SPI1D.MergedBits.grpBit

#define SPI1D_Bit_MASK  255
#define SPI1D_Bit_BITNUM  0


/*** TPM1SC - TPM 1 Status and Control Register; 0x00000030 ***/
typedef union {
  byte Byte;
  struct {
    byte PS0         :1;                                       /* Prescale Divisor Select Bit 0 */
    byte PS1         :1;                                       /* Prescale Divisor Select Bit 1 */
    byte PS2         :1;                                       /* Prescale Divisor Select Bit 2 */
    byte CLKSA       :1;                                       /* Clock Source Select A */
    byte CLKSB       :1;                                       /* Clock Source Select B */
    byte CPWMS       :1;                                       /* Center-Aligned PWM Select */
    byte TOIE        :1;                                       /* Timer Overflow Interrupt Enable */
    byte TOF         :1;                                       /* Timer Overflow Flag */
  } Bits;
  struct {
    byte grpPS   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM1SCSTR;
extern volatile TPM1SCSTR _TPM1SC @0x00000030;
#define TPM1SC _TPM1SC.Byte
#define TPM1SC_PS0 _TPM1SC.Bits.PS0
#define TPM1SC_PS1 _TPM1SC.Bits.PS1
#define TPM1SC_PS2 _TPM1SC.Bits.PS2
#define TPM1SC_CLKSA _TPM1SC.Bits.CLKSA
#define TPM1SC_CLKSB _TPM1SC.Bits.CLKSB
#define TPM1SC_CPWMS _TPM1SC.Bits.CPWMS
#define TPM1SC_TOIE _TPM1SC.Bits.TOIE
#define TPM1SC_TOF _TPM1SC.Bits.TOF
#define TPM1SC_PS _TPM1SC.MergedBits.grpPS

#define TPM1SC_PS0_MASK   1
#define TPM1SC_PS0_BITNUM 0
#define TPM1SC_PS1_MASK   2
#define TPM1SC_PS1_BITNUM 1
#define TPM1SC_PS2_MASK   4
#define TPM1SC_PS2_BITNUM 2
#define TPM1SC_CLKSA_MASK   8
#define TPM1SC_CLKSA_BITNUM 3
#define TPM1SC_CLKSB_MASK   16
#define TPM1SC_CLKSB_BITNUM 4
#define TPM1SC_CPWMS_MASK   32
#define TPM1SC_CPWMS_BITNUM 5
#define TPM1SC_TOIE_MASK   64
#define TPM1SC_TOIE_BITNUM 6
#define TPM1SC_TOF_MASK   128
#define TPM1SC_TOF_BITNUM 7
#define TPM1SC_PS_MASK  7
#define TPM1SC_PS_BITNUM  0


/*** TPM1CNT - TPM 1 Counter Register; 0x00000031 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM1CNTH - TPM 1 Counter Register High; 0x00000031 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* TPM Counter Bit 8 */
        byte BIT9        :1;                                       /* TPM Counter Bit 9 */
        byte BIT10       :1;                                       /* TPM Counter Bit 10 */
        byte BIT11       :1;                                       /* TPM Counter Bit 11 */
        byte BIT12       :1;                                       /* TPM Counter Bit 12 */
        byte BIT13       :1;                                       /* TPM Counter Bit 13 */
        byte BIT14       :1;                                       /* TPM Counter Bit 14 */
        byte BIT15       :1;                                       /* TPM Counter Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } TPM1CNTHSTR;
    #define TPM1CNTH _TPM1CNT.Overlap_STR.TPM1CNTHSTR.Byte
    #define TPM1CNTH_BIT8 _TPM1CNT.Overlap_STR.TPM1CNTHSTR.Bits.BIT8
    #define TPM1CNTH_BIT9 _TPM1CNT.Overlap_STR.TPM1CNTHSTR.Bits.BIT9
    #define TPM1CNTH_BIT10 _TPM1CNT.Overlap_STR.TPM1CNTHSTR.Bits.BIT10
    #define TPM1CNTH_BIT11 _TPM1CNT.Overlap_STR.TPM1CNTHSTR.Bits.BIT11
    #define TPM1CNTH_BIT12 _TPM1CNT.Overlap_STR.TPM1CNTHSTR.Bits.BIT12
    #define TPM1CNTH_BIT13 _TPM1CNT.Overlap_STR.TPM1CNTHSTR.Bits.BIT13
    #define TPM1CNTH_BIT14 _TPM1CNT.Overlap_STR.TPM1CNTHSTR.Bits.BIT14
    #define TPM1CNTH_BIT15 _TPM1CNT.Overlap_STR.TPM1CNTHSTR.Bits.BIT15

    #define TPM1CNTH_BIT_8 _TPM1CNT.Overlap_STR.TPM1CNTHSTR.MergedBits.grpBIT_8
    #define TPM1CNTH_BIT TPM1CNTH_BIT_8

    #define TPM1CNTH_BIT8_MASK   1
    #define TPM1CNTH_BIT8_BITNUM 0
    #define TPM1CNTH_BIT9_MASK   2
    #define TPM1CNTH_BIT9_BITNUM 1
    #define TPM1CNTH_BIT10_MASK   4
    #define TPM1CNTH_BIT10_BITNUM 2
    #define TPM1CNTH_BIT11_MASK   8
    #define TPM1CNTH_BIT11_BITNUM 3
    #define TPM1CNTH_BIT12_MASK   16
    #define TPM1CNTH_BIT12_BITNUM 4
    #define TPM1CNTH_BIT13_MASK   32
    #define TPM1CNTH_BIT13_BITNUM 5
    #define TPM1CNTH_BIT14_MASK   64
    #define TPM1CNTH_BIT14_BITNUM 6
    #define TPM1CNTH_BIT15_MASK   128
    #define TPM1CNTH_BIT15_BITNUM 7
    #define TPM1CNTH_BIT_8_MASK  255
    #define TPM1CNTH_BIT_8_BITNUM  0


    /*** TPM1CNTL - TPM 1 Counter Register Low; 0x00000032 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* TPM Counter Bit 0 */
        byte BIT1        :1;                                       /* TPM Counter Bit 1 */
        byte BIT2        :1;                                       /* TPM Counter Bit 2 */
        byte BIT3        :1;                                       /* TPM Counter Bit 3 */
        byte BIT4        :1;                                       /* TPM Counter Bit 4 */
        byte BIT5        :1;                                       /* TPM Counter Bit 5 */
        byte BIT6        :1;                                       /* TPM Counter Bit 6 */
        byte BIT7        :1;                                       /* TPM Counter Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TPM1CNTLSTR;
    #define TPM1CNTL _TPM1CNT.Overlap_STR.TPM1CNTLSTR.Byte
    #define TPM1CNTL_BIT0 _TPM1CNT.Overlap_STR.TPM1CNTLSTR.Bits.BIT0
    #define TPM1CNTL_BIT1 _TPM1CNT.Overlap_STR.TPM1CNTLSTR.Bits.BIT1
    #define TPM1CNTL_BIT2 _TPM1CNT.Overlap_STR.TPM1CNTLSTR.Bits.BIT2
    #define TPM1CNTL_BIT3 _TPM1CNT.Overlap_STR.TPM1CNTLSTR.Bits.BIT3
    #define TPM1CNTL_BIT4 _TPM1CNT.Overlap_STR.TPM1CNTLSTR.Bits.BIT4
    #define TPM1CNTL_BIT5 _TPM1CNT.Overlap_STR.TPM1CNTLSTR.Bits.BIT5
    #define TPM1CNTL_BIT6 _TPM1CNT.Overlap_STR.TPM1CNTLSTR.Bits.BIT6
    #define TPM1CNTL_BIT7 _TPM1CNT.Overlap_STR.TPM1CNTLSTR.Bits.BIT7

    #define TPM1CNTL_BIT _TPM1CNT.Overlap_STR.TPM1CNTLSTR.MergedBits.grpBIT

    #define TPM1CNTL_BIT0_MASK   1
    #define TPM1CNTL_BIT0_BITNUM 0
    #define TPM1CNTL_BIT1_MASK   2
    #define TPM1CNTL_BIT1_BITNUM 1
    #define TPM1CNTL_BIT2_MASK   4
    #define TPM1CNTL_BIT2_BITNUM 2
    #define TPM1CNTL_BIT3_MASK   8
    #define TPM1CNTL_BIT3_BITNUM 3
    #define TPM1CNTL_BIT4_MASK   16
    #define TPM1CNTL_BIT4_BITNUM 4
    #define TPM1CNTL_BIT5_MASK   32
    #define TPM1CNTL_BIT5_BITNUM 5
    #define TPM1CNTL_BIT6_MASK   64
    #define TPM1CNTL_BIT6_BITNUM 6
    #define TPM1CNTL_BIT7_MASK   128
    #define TPM1CNTL_BIT7_BITNUM 7
    #define TPM1CNTL_BIT_MASK  255
    #define TPM1CNTL_BIT_BITNUM  0

  } Overlap_STR;

