AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
  struct {
    word grpBIT  :16;
  } MergedBits;
} TPM1CNTSTR;
extern volatile TPM1CNTSTR _TPM1CNT @0x00000031;
#define TPM1CNT _TPM1CNT.Word
#define TPM1CNT_BIT _TPM1CNT.MergedBits.grpBIT

#define TPM1CNT_BIT_MASK  65535
#define TPM1CNT_BIT_BITNUM  0


/*** TPM1MOD - TPM 1 Timer Counter Modulo Register; 0x00000033 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM1MODH - TPM 1 Timer Counter Modulo Register High; 0x00000033 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Timer Counter Modulo Bit 8 */
        byte BIT9        :1;                                       /* Timer Counter Modulo Bit 9 */
        byte BIT10       :1;                                       /* Timer Counter Modulo Bit 10 */
        byte BIT11       :1;                                       /* Timer Counter Modulo Bit 11 */
        byte BIT12       :1;                                       /* Timer Counter Modulo Bit 12 */
        byte BIT13       :1;                                       /* Timer Counter Modulo Bit 13 */
        byte BIT14       :1;                                       /* Timer Counter Modulo Bit 14 */
        byte BIT15       :1;                                       /* Timer Counter Modulo Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } TPM1MODHSTR;
    #define TPM1MODH _TPM1MOD.Overlap_STR.TPM1MODHSTR.Byte
    #define TPM1MODH_BIT8 _TPM1MOD.Overlap_STR.TPM1MODHSTR.Bits.BIT8
    #define TPM1MODH_BIT9 _TPM1MOD.Overlap_STR.TPM1MODHSTR.Bits.BIT9
    #define TPM1MODH_BIT10 _TPM1MOD.Overlap_STR.TPM1MODHSTR.Bits.BIT10
    #define TPM1MODH_BIT11 _TPM1MOD.Overlap_STR.TPM1MODHSTR.Bits.BIT11
    #define TPM1MODH_BIT12 _TPM1MOD.Overlap_STR.TPM1MODHSTR.Bits.BIT12
    #define TPM1MODH_BIT13 _TPM1MOD.Overlap_STR.TPM1MODHSTR.Bits.BIT13
    #define TPM1MODH_BIT14 _TPM1MOD.Overlap_STR.TPM1MODHSTR.Bits.BIT14
    #define TPM1MODH_BIT15 _TPM1MOD.Overlap_STR.TPM1MODHSTR.Bits.BIT15

    #define TPM1MODH_BIT_8 _TPM1MOD.Overlap_STR.TPM1MODHSTR.MergedBits.grpBIT_8
    #define TPM1MODH_BIT TPM1MODH_BIT_8

    #define TPM1MODH_BIT8_MASK   1
    #define TPM1MODH_BIT8_BITNUM 0
    #define TPM1MODH_BIT9_MASK   2
    #define TPM1MODH_BIT9_BITNUM 1
    #define TPM1MODH_BIT10_MASK   4
    #define TPM1MODH_BIT10_BITNUM 2
    #define TPM1MODH_BIT11_MASK   8
    #define TPM1MODH_BIT11_BITNUM 3
    #define TPM1MODH_BIT12_MASK   16
    #define TPM1MODH_BIT12_BITNUM 4
    #define TPM1MODH_BIT13_MASK   32
    #define TPM1MODH_BIT13_BITNUM 5
    #define TPM1MODH_BIT14_MASK   64
    #define TPM1MODH_BIT14_BITNUM 6
    #define TPM1MODH_BIT15_MASK   128
    #define TPM1MODH_BIT15_BITNUM 7
    #define TPM1MODH_BIT_8_MASK  255
    #define TPM1MODH_BIT_8_BITNUM  0


    /*** TPM1MODL - TPM 1 Timer Counter Modulo Register Low; 0x00000034 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Counter Modulo Bit 0 */
        byte BIT1        :1;                                       /* Timer Counter Modulo Bit 1 */
        byte BIT2        :1;                                       /* Timer Counter Modulo Bit 2 */
        byte BIT3        :1;                                       /* Timer Counter Modulo Bit 3 */
        byte BIT4        :1;                                       /* Timer Counter Modulo Bit 4 */
        byte BIT5        :1;                                       /* Timer Counter Modulo Bit 5 */
        byte BIT6        :1;                                       /* Timer Counter Modulo Bit 6 */
        byte BIT7        :1;                                       /* Timer Counter Modulo Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TPM1MODLSTR;
    #define TPM1MODL _TPM1MOD.Overlap_STR.TPM1MODLSTR.Byte
    #define TPM1MODL_BIT0 _TPM1MOD.Overlap_STR.TPM1MODLSTR.Bits.BIT0
    #define TPM1MODL_BIT1 _TPM1MOD.Overlap_STR.TPM1MODLSTR.Bits.BIT1
    #define TPM1MODL_BIT2 _TPM1MOD.Overlap_STR.TPM1MODLSTR.Bits.BIT2
    #define TPM1MODL_BIT3 _TPM1MOD.Overlap_STR.TPM1MODLSTR.Bits.BIT3
    #define TPM1MODL_BIT4 _TPM1MOD.Overlap_STR.TPM1MODLSTR.Bits.BIT4
    #define TPM1MODL_BIT5 _TPM1MOD.Overlap_STR.TPM1MODLSTR.Bits.BIT5
    #define TPM1MODL_BIT6 _TPM1MOD.Overlap_STR.TPM1MODLSTR.Bits.BIT6
    #define TPM1MODL_BIT7 _TPM1MOD.Overlap_STR.TPM1MODLSTR.Bits.BIT7

    #define TPM1MODL_BIT _TPM1MOD.Overlap_STR.TPM1MODLSTR.MergedBits.grpBIT

    #define TPM1MODL_BIT0_MASK   1
    #define TPM1MODL_BIT0_BITNUM 0
    #define TPM1MODL_BIT1_MASK   2
    #define TPM1MODL_BIT1_BITNUM 1
    #define TPM1MODL_BIT2_MASK   4
    #define TPM1MODL_BIT2_BITNUM 2
    #define TPM1MODL_BIT3_MASK   8
    #define TPM1MODL_BIT3_BITNUM 3
    #define TPM1MODL_BIT4_MASK   16
    #define TPM1MODL_BIT4_BITNUM 4
    #define TPM1MODL_BIT5_MASK   32
    #define TPM1MODL_BIT5_BITNUM 5
    #define TPM1MODL_BIT6_MASK   64
    #define TPM1MODL_BIT6_BITNUM 6
    #define TPM1MODL_BIT7_MASK   128
    #define TPM1MODL_BIT7_BITNUM 7
    #define TPM1MODL_BIT_MASK  255
    #define TPM1MODL_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} TPM1MODSTR;
extern volatile TPM1MODSTR _TPM1MOD @0x00000033;
#define TPM1MOD _TPM1MOD.Word
#define TPM1MOD_BIT _TPM1MOD.MergedBits.grpBIT

#define TPM1MOD_BIT_MASK  65535
#define TPM1MOD_BIT_BITNUM  0


/*** TPM1C0SC - TPM 1 Timer Channel 0 Status and Control Register; 0x00000035 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte ELS0A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS0B       :1;                                       /* Edge/Level Select Bit B */
    byte MS0A        :1;                                       /* Mode Select A for TPM Channel 0 */
    byte MS0B        :1;                                       /* Mode Select B for TPM Channel 0 */
    byte CH0IE       :1;                                       /* Channel 0 Interrupt Enable */
    byte CH0F        :1;                                       /* Channel 0 Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpELS0x :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM1C0SCSTR;
