AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
extern volatile TPM1C0SCSTR _TPM1C0SC @0x00000035;
#define TPM1C0SC _TPM1C0SC.Byte
#define TPM1C0SC_ELS0A _TPM1C0SC.Bits.ELS0A
#define TPM1C0SC_ELS0B _TPM1C0SC.Bits.ELS0B
#define TPM1C0SC_MS0A _TPM1C0SC.Bits.MS0A
#define TPM1C0SC_MS0B _TPM1C0SC.Bits.MS0B
#define TPM1C0SC_CH0IE _TPM1C0SC.Bits.CH0IE
#define TPM1C0SC_CH0F _TPM1C0SC.Bits.CH0F
#define TPM1C0SC_ELS0x _TPM1C0SC.MergedBits.grpELS0x

#define TPM1C0SC_ELS0A_MASK   4
#define TPM1C0SC_ELS0A_BITNUM 2
#define TPM1C0SC_ELS0B_MASK   8
#define TPM1C0SC_ELS0B_BITNUM 3
#define TPM1C0SC_MS0A_MASK   16
#define TPM1C0SC_MS0A_BITNUM 4
#define TPM1C0SC_MS0B_MASK   32
#define TPM1C0SC_MS0B_BITNUM 5
#define TPM1C0SC_CH0IE_MASK   64
#define TPM1C0SC_CH0IE_BITNUM 6
#define TPM1C0SC_CH0F_MASK   128
#define TPM1C0SC_CH0F_BITNUM 7
#define TPM1C0SC_ELS0x_MASK  12
#define TPM1C0SC_ELS0x_BITNUM  2


/*** TPM1C0V - TPM 1 Timer Channel 0 Value Register; 0x00000036 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM1C0VH - TPM 1 Timer Channel 0 Value Register High; 0x00000036 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Timer Channel 0 Value Bit 8 */
        byte BIT9        :1;                                       /* Timer Channel 0 Value Bit 9 */
        byte BIT10       :1;                                       /* Timer Channel 0 Value Bit 10 */
        byte BIT11       :1;                                       /* Timer Channel 0 Value Bit 11 */
        byte BIT12       :1;                                       /* Timer Channel 0 Value Bit 12 */
        byte BIT13       :1;                                       /* Timer Channel 0 Value Bit 13 */
        byte BIT14       :1;                                       /* Timer Channel 0 Value Bit 14 */
        byte BIT15       :1;                                       /* Timer Channel 0 Value Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } TPM1C0VHSTR;
    #define TPM1C0VH _TPM1C0V.Overlap_STR.TPM1C0VHSTR.Byte
    #define TPM1C0VH_BIT8 _TPM1C0V.Overlap_STR.TPM1C0VHSTR.Bits.BIT8
    #define TPM1C0VH_BIT9 _TPM1C0V.Overlap_STR.TPM1C0VHSTR.Bits.BIT9
    #define TPM1C0VH_BIT10 _TPM1C0V.Overlap_STR.TPM1C0VHSTR.Bits.BIT10
    #define TPM1C0VH_BIT11 _TPM1C0V.Overlap_STR.TPM1C0VHSTR.Bits.BIT11
    #define TPM1C0VH_BIT12 _TPM1C0V.Overlap_STR.TPM1C0VHSTR.Bits.BIT12
    #define TPM1C0VH_BIT13 _TPM1C0V.Overlap_STR.TPM1C0VHSTR.Bits.BIT13
    #define TPM1C0VH_BIT14 _TPM1C0V.Overlap_STR.TPM1C0VHSTR.Bits.BIT14
    #define TPM1C0VH_BIT15 _TPM1C0V.Overlap_STR.TPM1C0VHSTR.Bits.BIT15

    #define TPM1C0VH_BIT_8 _TPM1C0V.Overlap_STR.TPM1C0VHSTR.MergedBits.grpBIT_8
    #define TPM1C0VH_BIT TPM1C0VH_BIT_8

    #define TPM1C0VH_BIT8_MASK   1
    #define TPM1C0VH_BIT8_BITNUM 0
    #define TPM1C0VH_BIT9_MASK   2
    #define TPM1C0VH_BIT9_BITNUM 1
    #define TPM1C0VH_BIT10_MASK   4
    #define TPM1C0VH_BIT10_BITNUM 2
    #define TPM1C0VH_BIT11_MASK   8
    #define TPM1C0VH_BIT11_BITNUM 3
    #define TPM1C0VH_BIT12_MASK   16
    #define TPM1C0VH_BIT12_BITNUM 4
    #define TPM1C0VH_BIT13_MASK   32
    #define TPM1C0VH_BIT13_BITNUM 5
    #define TPM1C0VH_BIT14_MASK   64
    #define TPM1C0VH_BIT14_BITNUM 6
    #define TPM1C0VH_BIT15_MASK   128
    #define TPM1C0VH_BIT15_BITNUM 7
    #define TPM1C0VH_BIT_8_MASK  255
    #define TPM1C0VH_BIT_8_BITNUM  0


    /*** TPM1C0VL - TPM 1 Timer Channel 0 Value Register Low; 0x00000037 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Channel 0 Value Bit 0 */
        byte BIT1        :1;                                       /* Timer Channel 0 Value Bit 1 */
        byte BIT2        :1;                                       /* Timer Channel 0 Value Bit 2 */
        byte BIT3        :1;                                       /* Timer Channel 0 Value Bit 3 */
        byte BIT4        :1;                                       /* Timer Channel 0 Value Bit 4 */
        byte BIT5        :1;                                       /* Timer Channel 0 Value Bit 5 */
        byte BIT6        :1;                                       /* Timer Channel 0 Value Bit 6 */
        byte BIT7        :1;                                       /* Timer Channel 0 Value Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TPM1C0VLSTR;
    #define TPM1C0VL _TPM1C0V.Overlap_STR.TPM1C0VLSTR.Byte
    #define TPM1C0VL_BIT0 _TPM1C0V.Overlap_STR.TPM1C0VLSTR.Bits.BIT0
    #define TPM1C0VL_BIT1 _TPM1C0V.Overlap_STR.TPM1C0VLSTR.Bits.BIT1
    #define TPM1C0VL_BIT2 _TPM1C0V.Overlap_STR.TPM1C0VLSTR.Bits.BIT2
    #define TPM1C0VL_BIT3 _TPM1C0V.Overlap_STR.TPM1C0VLSTR.Bits.BIT3
    #define TPM1C0VL_BIT4 _TPM1C0V.Overlap_STR.TPM1C0VLSTR.Bits.BIT4
    #define TPM1C0VL_BIT5 _TPM1C0V.Overlap_STR.TPM1C0VLSTR.Bits.BIT5
    #define TPM1C0VL_BIT6 _TPM1C0V.Overlap_STR.TPM1C0VLSTR.Bits.BIT6
    #define TPM1C0VL_BIT7 _TPM1C0V.Overlap_STR.TPM1C0VLSTR.Bits.BIT7

    #define TPM1C0VL_BIT _TPM1C0V.Overlap_STR.TPM1C0VLSTR.MergedBits.grpBIT

    #define TPM1C0VL_BIT0_MASK   1
    #define TPM1C0VL_BIT0_BITNUM 0
    #define TPM1C0VL_BIT1_MASK   2
    #define TPM1C0VL_BIT1_BITNUM 1
    #define TPM1C0VL_BIT2_MASK   4
    #define TPM1C0VL_BIT2_BITNUM 2
    #define TPM1C0VL_BIT3_MASK   8
    #define TPM1C0VL_BIT3_BITNUM 3
    #define TPM1C0VL_BIT4_MASK   16
    #define TPM1C0VL_BIT4_BITNUM 4
    #define TPM1C0VL_BIT5_MASK   32
    #define TPM1C0VL_BIT5_BITNUM 5
    #define TPM1C0VL_BIT6_MASK   64
    #define TPM1C0VL_BIT6_BITNUM 6
    #define TPM1C0VL_BIT7_MASK   128
    #define TPM1C0VL_BIT7_BITNUM 7
    #define TPM1C0VL_BIT_MASK  255
    #define TPM1C0VL_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} TPM1C0VSTR;
extern volatile TPM1C0VSTR _TPM1C0V @0x00000036;
#define TPM1C0V _TPM1C0V.Word
#define TPM1C0V_BIT _TPM1C0V.MergedBits.grpBIT

#define TPM1C0V_BIT_MASK  65535
#define TPM1C0V_BIT_BITNUM  0


