AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
/*** TPM1C1SC - TPM 1 Timer Channel 1 Status and Control Register; 0x00000038 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte ELS1A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS1B       :1;                                       /* Edge/Level Select Bit B */
    byte MS1A        :1;                                       /* Mode Select A for TPM Channel 1 */
    byte MS1B        :1;                                       /* Mode Select B for TPM Channel 1 */
    byte CH1IE       :1;                                       /* Channel 1 Interrupt Enable */
    byte CH1F        :1;                                       /* Channel 1 Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpELS1x :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM1C1SCSTR;
extern volatile TPM1C1SCSTR _TPM1C1SC @0x00000038;
#define TPM1C1SC _TPM1C1SC.Byte
#define TPM1C1SC_ELS1A _TPM1C1SC.Bits.ELS1A
#define TPM1C1SC_ELS1B _TPM1C1SC.Bits.ELS1B
#define TPM1C1SC_MS1A _TPM1C1SC.Bits.MS1A
#define TPM1C1SC_MS1B _TPM1C1SC.Bits.MS1B
#define TPM1C1SC_CH1IE _TPM1C1SC.Bits.CH1IE
#define TPM1C1SC_CH1F _TPM1C1SC.Bits.CH1F
#define TPM1C1SC_ELS1x _TPM1C1SC.MergedBits.grpELS1x

#define TPM1C1SC_ELS1A_MASK   4
#define TPM1C1SC_ELS1A_BITNUM 2
#define TPM1C1SC_ELS1B_MASK   8
#define TPM1C1SC_ELS1B_BITNUM 3
#define TPM1C1SC_MS1A_MASK   16
#define TPM1C1SC_MS1A_BITNUM 4
#define TPM1C1SC_MS1B_MASK   32
#define TPM1C1SC_MS1B_BITNUM 5
#define TPM1C1SC_CH1IE_MASK   64
#define TPM1C1SC_CH1IE_BITNUM 6
#define TPM1C1SC_CH1F_MASK   128
#define TPM1C1SC_CH1F_BITNUM 7
#define TPM1C1SC_ELS1x_MASK  12
#define TPM1C1SC_ELS1x_BITNUM  2


/*** TPM1C1V - TPM 1 Timer Channel 1 Value Register; 0x00000039 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM1C1VH - TPM 1 Timer Channel 1 Value Register High; 0x00000039 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Timer Channel 1 Value Bit 8 */
        byte BIT9        :1;                                       /* Timer Channel 1 Value Bit 9 */
        byte BIT10       :1;                                       /* Timer Channel 1 Value Bit 10 */
        byte BIT11       :1;                                       /* Timer Channel 1 Value Bit 11 */
        byte BIT12       :1;                                       /* Timer Channel 1 Value Bit 12 */
        byte BIT13       :1;                                       /* Timer Channel 1 Value Bit 13 */
        byte BIT14       :1;                                       /* Timer Channel 1 Value Bit 14 */
        byte BIT15       :1;                                       /* Timer Channel 1 Value Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } TPM1C1VHSTR;
    #define TPM1C1VH _TPM1C1V.Overlap_STR.TPM1C1VHSTR.Byte
    #define TPM1C1VH_BIT8 _TPM1C1V.Overlap_STR.TPM1C1VHSTR.Bits.BIT8
    #define TPM1C1VH_BIT9 _TPM1C1V.Overlap_STR.TPM1C1VHSTR.Bits.BIT9
    #define TPM1C1VH_BIT10 _TPM1C1V.Overlap_STR.TPM1C1VHSTR.Bits.BIT10
    #define TPM1C1VH_BIT11 _TPM1C1V.Overlap_STR.TPM1C1VHSTR.Bits.BIT11
    #define TPM1C1VH_BIT12 _TPM1C1V.Overlap_STR.TPM1C1VHSTR.Bits.BIT12
    #define TPM1C1VH_BIT13 _TPM1C1V.Overlap_STR.TPM1C1VHSTR.Bits.BIT13
    #define TPM1C1VH_BIT14 _TPM1C1V.Overlap_STR.TPM1C1VHSTR.Bits.BIT14
    #define TPM1C1VH_BIT15 _TPM1C1V.Overlap_STR.TPM1C1VHSTR.Bits.BIT15

    #define TPM1C1VH_BIT_8 _TPM1C1V.Overlap_STR.TPM1C1VHSTR.MergedBits.grpBIT_8
    #define TPM1C1VH_BIT TPM1C1VH_BIT_8

    #define TPM1C1VH_BIT8_MASK   1
    #define TPM1C1VH_BIT8_BITNUM 0
    #define TPM1C1VH_BIT9_MASK   2
    #define TPM1C1VH_BIT9_BITNUM 1
    #define TPM1C1VH_BIT10_MASK   4
    #define TPM1C1VH_BIT10_BITNUM 2
    #define TPM1C1VH_BIT11_MASK   8
    #define TPM1C1VH_BIT11_BITNUM 3
    #define TPM1C1VH_BIT12_MASK   16
    #define TPM1C1VH_BIT12_BITNUM 4
    #define TPM1C1VH_BIT13_MASK   32
    #define TPM1C1VH_BIT13_BITNUM 5
    #define TPM1C1VH_BIT14_MASK   64
    #define TPM1C1VH_BIT14_BITNUM 6
    #define TPM1C1VH_BIT15_MASK   128
    #define TPM1C1VH_BIT15_BITNUM 7
    #define TPM1C1VH_BIT_8_MASK  255
    #define TPM1C1VH_BIT_8_BITNUM  0


    /*** TPM1C1VL - TPM 1 Timer Channel 1 Value Register Low; 0x0000003A ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Channel 1 Value Bit 0 */
        byte BIT1        :1;                                       /* Timer Channel 1 Value Bit 1 */
        byte BIT2        :1;                                       /* Timer Channel 1 Value Bit 2 */
        byte BIT3        :1;                                       /* Timer Channel 1 Value Bit 3 */
        byte BIT4        :1;                                       /* Timer Channel 1 Value Bit 4 */
        byte BIT5        :1;                                       /* Timer Channel 1 Value Bit 5 */
        byte BIT6        :1;                                       /* Timer Channel 1 Value Bit 6 */
        byte BIT7        :1;                                       /* Timer Channel 1 Value Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TPM1C1VLSTR;
    #define TPM1C1VL _TPM1C1V.Overlap_STR.TPM1C1VLSTR.Byte
    #define TPM1C1VL_BIT0 _TPM1C1V.Overlap_STR.TPM1C1VLSTR.Bits.BIT0
    #define TPM1C1VL_BIT1 _TPM1C1V.Overlap_STR.TPM1C1VLSTR.Bits.BIT1
    #define TPM1C1VL_BIT2 _TPM1C1V.Overlap_STR.TPM1C1VLSTR.Bits.BIT2
    #define TPM1C1VL_BIT3 _TPM1C1V.Overlap_STR.TPM1C1VLSTR.Bits.BIT3
    #define TPM1C1VL_BIT4 _TPM1C1V.Overlap_STR.TPM1C1VLSTR.Bits.BIT4
    #define TPM1C1VL_BIT5 _TPM1C1V.Overlap_STR.TPM1C1VLSTR.Bits.BIT5
    #define TPM1C1VL_BIT6 _TPM1C1V.Overlap_STR.TPM1C1VLSTR.Bits.BIT6
    #define TPM1C1VL_BIT7 _TPM1C1V.Overlap_STR.TPM1C1VLSTR.Bits.BIT7

    #define TPM1C1VL_BIT _TPM1C1V.Overlap_STR.TPM1C1VLSTR.MergedBits.grpBIT

    #define TPM1C1VL_BIT0_MASK   1
    #define TPM1C1VL_BIT0_BITNUM 0
    #define TPM1C1VL_BIT1_MASK   2
    #define TPM1C1VL_BIT1_BITNUM 1
    #define TPM1C1VL_BIT2_MASK   4
    #define TPM1C1VL_BIT2_BITNUM 2
    #define TPM1C1VL_BIT3_MASK   8
    #define TPM1C1VL_BIT3_BITNUM 3
    #define TPM1C1VL_BIT4_MASK   16
    #define TPM1C1VL_BIT4_BITNUM 4
    #define TPM1C1VL_BIT5_MASK   32
    #define TPM1C1VL_BIT5_BITNUM 5
    #define TPM1C1VL_BIT6_MASK   64
    #define TPM1C1VL_BIT6_BITNUM 6
    #define TPM1C1VL_BIT7_MASK   128
    #define TPM1C1VL_BIT7_BITNUM 7
    #define TPM1C1VL_BIT_MASK  255
    #define TPM1C1VL_BIT_BITNUM  0

  } Overlap_STR;

