AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
  struct {
    word grpBIT  :16;
  } MergedBits;
} TPM1C1VSTR;
extern volatile TPM1C1VSTR _TPM1C1V @0x00000039;
#define TPM1C1V _TPM1C1V.Word
#define TPM1C1V_BIT _TPM1C1V.MergedBits.grpBIT

#define TPM1C1V_BIT_MASK  65535
#define TPM1C1V_BIT_BITNUM  0


/*** TPM1C2SC - TPM 1 Timer Channel 2 Status and Control Register; 0x0000003B ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte ELS2A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS2B       :1;                                       /* Edge/Level Select Bit B */
    byte MS2A        :1;                                       /* Mode Select A for TPM Channel 2 */
    byte MS2B        :1;                                       /* Mode Select B for TPM Channel 2 */
    byte CH2IE       :1;                                       /* Channel 2 Interrupt Enable */
    byte CH2F        :1;                                       /* Channel 2 Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpELS2x :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM1C2SCSTR;
extern volatile TPM1C2SCSTR _TPM1C2SC @0x0000003B;
#define TPM1C2SC _TPM1C2SC.Byte
#define TPM1C2SC_ELS2A _TPM1C2SC.Bits.ELS2A
#define TPM1C2SC_ELS2B _TPM1C2SC.Bits.ELS2B
#define TPM1C2SC_MS2A _TPM1C2SC.Bits.MS2A
#define TPM1C2SC_MS2B _TPM1C2SC.Bits.MS2B
#define TPM1C2SC_CH2IE _TPM1C2SC.Bits.CH2IE
#define TPM1C2SC_CH2F _TPM1C2SC.Bits.CH2F
#define TPM1C2SC_ELS2x _TPM1C2SC.MergedBits.grpELS2x

#define TPM1C2SC_ELS2A_MASK   4
#define TPM1C2SC_ELS2A_BITNUM 2
#define TPM1C2SC_ELS2B_MASK   8
#define TPM1C2SC_ELS2B_BITNUM 3
#define TPM1C2SC_MS2A_MASK   16
#define TPM1C2SC_MS2A_BITNUM 4
#define TPM1C2SC_MS2B_MASK   32
#define TPM1C2SC_MS2B_BITNUM 5
#define TPM1C2SC_CH2IE_MASK   64
#define TPM1C2SC_CH2IE_BITNUM 6
#define TPM1C2SC_CH2F_MASK   128
#define TPM1C2SC_CH2F_BITNUM 7
#define TPM1C2SC_ELS2x_MASK  12
#define TPM1C2SC_ELS2x_BITNUM  2


/*** TPM1C2V - TPM 1 Timer Channel 2 Value Register; 0x0000003C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM1C2VH - TPM 1 Timer Channel 2 Value Register High; 0x0000003C ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Timer Channel 2 Value Bit 8 */
        byte BIT9        :1;                                       /* Timer Channel 2 Value Bit 9 */
        byte BIT10       :1;                                       /* Timer Channel 2 Value Bit 10 */
        byte BIT11       :1;                                       /* Timer Channel 2 Value Bit 11 */
        byte BIT12       :1;                                       /* Timer Channel 2 Value Bit 12 */
        byte BIT13       :1;                                       /* Timer Channel 2 Value Bit 13 */
        byte BIT14       :1;                                       /* Timer Channel 2 Value Bit 14 */
        byte BIT15       :1;                                       /* Timer Channel 2 Value Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } TPM1C2VHSTR;
    #define TPM1C2VH _TPM1C2V.Overlap_STR.TPM1C2VHSTR.Byte
    #define TPM1C2VH_BIT8 _TPM1C2V.Overlap_STR.TPM1C2VHSTR.Bits.BIT8
    #define TPM1C2VH_BIT9 _TPM1C2V.Overlap_STR.TPM1C2VHSTR.Bits.BIT9
    #define TPM1C2VH_BIT10 _TPM1C2V.Overlap_STR.TPM1C2VHSTR.Bits.BIT10
    #define TPM1C2VH_BIT11 _TPM1C2V.Overlap_STR.TPM1C2VHSTR.Bits.BIT11
    #define TPM1C2VH_BIT12 _TPM1C2V.Overlap_STR.TPM1C2VHSTR.Bits.BIT12
    #define TPM1C2VH_BIT13 _TPM1C2V.Overlap_STR.TPM1C2VHSTR.Bits.BIT13
    #define TPM1C2VH_BIT14 _TPM1C2V.Overlap_STR.TPM1C2VHSTR.Bits.BIT14
    #define TPM1C2VH_BIT15 _TPM1C2V.Overlap_STR.TPM1C2VHSTR.Bits.BIT15

    #define TPM1C2VH_BIT_8 _TPM1C2V.Overlap_STR.TPM1C2VHSTR.MergedBits.grpBIT_8
    #define TPM1C2VH_BIT TPM1C2VH_BIT_8

    #define TPM1C2VH_BIT8_MASK   1
    #define TPM1C2VH_BIT8_BITNUM 0
    #define TPM1C2VH_BIT9_MASK   2
    #define TPM1C2VH_BIT9_BITNUM 1
    #define TPM1C2VH_BIT10_MASK   4
    #define TPM1C2VH_BIT10_BITNUM 2
    #define TPM1C2VH_BIT11_MASK   8
    #define TPM1C2VH_BIT11_BITNUM 3
    #define TPM1C2VH_BIT12_MASK   16
    #define TPM1C2VH_BIT12_BITNUM 4
    #define TPM1C2VH_BIT13_MASK   32
    #define TPM1C2VH_BIT13_BITNUM 5
    #define TPM1C2VH_BIT14_MASK   64
    #define TPM1C2VH_BIT14_BITNUM 6
    #define TPM1C2VH_BIT15_MASK   128
    #define TPM1C2VH_BIT15_BITNUM 7
    #define TPM1C2VH_BIT_8_MASK  255
    #define TPM1C2VH_BIT_8_BITNUM  0


    /*** TPM1C2VL - TPM 1 Timer Channel 2 Value Register Low; 0x0000003D ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Channel 2 Value Bit 0 */
        byte BIT1        :1;                                       /* Timer Channel 2 Value Bit 1 */
        byte BIT2        :1;                                       /* Timer Channel 2 Value Bit 2 */
        byte BIT3        :1;                                       /* Timer Channel 2 Value Bit 3 */
        byte BIT4        :1;                                       /* Timer Channel 2 Value Bit 4 */
        byte BIT5        :1;                                       /* Timer Channel 2 Value Bit 5 */
        byte BIT6        :1;                                       /* Timer Channel 2 Value Bit 6 */
        byte BIT7        :1;                                       /* Timer Channel 2 Value Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TPM1C2VLSTR;
    #define TPM1C2VL _TPM1C2V.Overlap_STR.TPM1C2VLSTR.Byte
    #define TPM1C2VL_BIT0 _TPM1C2V.Overlap_STR.TPM1C2VLSTR.Bits.BIT0
    #define TPM1C2VL_BIT1 _TPM1C2V.Overlap_STR.TPM1C2VLSTR.Bits.BIT1
    #define TPM1C2VL_BIT2 _TPM1C2V.Overlap_STR.TPM1C2VLSTR.Bits.BIT2
    #define TPM1C2VL_BIT3 _TPM1C2V.Overlap_STR.TPM1C2VLSTR.Bits.BIT3
    #define TPM1C2VL_BIT4 _TPM1C2V.Overlap_STR.TPM1C2VLSTR.Bits.BIT4
    #define TPM1C2VL_BIT5 _TPM1C2V.Overlap_STR.TPM1C2VLSTR.Bits.BIT5
    #define TPM1C2VL_BIT6 _TPM1C2V.Overlap_STR.TPM1C2VLSTR.Bits.BIT6
    #define TPM1C2VL_BIT7 _TPM1C2V.Overlap_STR.TPM1C2VLSTR.Bits.BIT7

    #define TPM1C2VL_BIT _TPM1C2V.Overlap_STR.TPM1C2VLSTR.MergedBits.grpBIT

    #define TPM1C2VL_BIT0_MASK   1
    #define TPM1C2VL_BIT0_BITNUM 0
    #define TPM1C2VL_BIT1_MASK   2
    #define TPM1C2VL_BIT1_BITNUM 1
    #define TPM1C2VL_BIT2_MASK   4
    #define TPM1C2VL_BIT2_BITNUM 2
    #define TPM1C2VL_BIT3_MASK   8
    #define TPM1C2VL_BIT3_BITNUM 3
    #define TPM1C2VL_BIT4_MASK   16
    #define TPM1C2VL_BIT4_BITNUM 4
    #define TPM1C2VL_BIT5_MASK   32
    #define TPM1C2VL_BIT5_BITNUM 5
    #define TPM1C2VL_BIT6_MASK   64
    #define TPM1C2VL_BIT6_BITNUM 6
    #define TPM1C2VL_BIT7_MASK   128
    #define TPM1C2VL_BIT7_BITNUM 7
    #define TPM1C2VL_BIT_MASK  255
    #define TPM1C2VL_BIT_BITNUM  0

  } Overlap_STR;

