AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
  struct {
    word grpBIT  :16;
  } MergedBits;
} TPM1C2VSTR;
extern volatile TPM1C2VSTR _TPM1C2V @0x0000003C;
#define TPM1C2V _TPM1C2V.Word
#define TPM1C2V_BIT _TPM1C2V.MergedBits.grpBIT

#define TPM1C2V_BIT_MASK  65535
#define TPM1C2V_BIT_BITNUM  0


/*** PTFD - Port F Data Register; 0x00000040 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFD0       :1;                                       /* Port F Data Register Bit 0 */
    byte PTFD1       :1;                                       /* Port F Data Register Bit 1 */
    byte PTFD2       :1;                                       /* Port F Data Register Bit 2 */
    byte PTFD3       :1;                                       /* Port F Data Register Bit 3 */
    byte PTFD4       :1;                                       /* Port F Data Register Bit 4 */
    byte PTFD5       :1;                                       /* Port F Data Register Bit 5 */
    byte PTFD6       :1;                                       /* Port F Data Register Bit 6 */
    byte PTFD7       :1;                                       /* Port F Data Register Bit 7 */
  } Bits;
  struct {
    byte grpPTFD :8;
  } MergedBits;
} PTFDSTR;
extern volatile PTFDSTR _PTFD @0x00000040;
#define PTFD _PTFD.Byte
#define PTFD_PTFD0 _PTFD.Bits.PTFD0
#define PTFD_PTFD1 _PTFD.Bits.PTFD1
#define PTFD_PTFD2 _PTFD.Bits.PTFD2
#define PTFD_PTFD3 _PTFD.Bits.PTFD3
#define PTFD_PTFD4 _PTFD.Bits.PTFD4
#define PTFD_PTFD5 _PTFD.Bits.PTFD5
#define PTFD_PTFD6 _PTFD.Bits.PTFD6
#define PTFD_PTFD7 _PTFD.Bits.PTFD7
#define PTFD_PTFD _PTFD.MergedBits.grpPTFD

#define PTFD_PTFD0_MASK   1
#define PTFD_PTFD0_BITNUM 0
#define PTFD_PTFD1_MASK   2
#define PTFD_PTFD1_BITNUM 1
#define PTFD_PTFD2_MASK   4
#define PTFD_PTFD2_BITNUM 2
#define PTFD_PTFD3_MASK   8
#define PTFD_PTFD3_BITNUM 3
#define PTFD_PTFD4_MASK   16
#define PTFD_PTFD4_BITNUM 4
#define PTFD_PTFD5_MASK   32
#define PTFD_PTFD5_BITNUM 5
#define PTFD_PTFD6_MASK   64
#define PTFD_PTFD6_BITNUM 6
#define PTFD_PTFD7_MASK   128
#define PTFD_PTFD7_BITNUM 7
#define PTFD_PTFD_MASK  255
#define PTFD_PTFD_BITNUM  0


/*** PTFPE - Pullup Enable for Port F; 0x00000041 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFPE0      :1;                                       /* Pullup Enable for Port F Bit 0 */
    byte PTFPE1      :1;                                       /* Pullup Enable for Port F Bit 1 */
    byte PTFPE2      :1;                                       /* Pullup Enable for Port F Bit 2 */
    byte PTFPE3      :1;                                       /* Pullup Enable for Port F Bit 3 */
    byte PTFPE4      :1;                                       /* Pullup Enable for Port F Bit 4 */
    byte PTFPE5      :1;                                       /* Pullup Enable for Port F Bit 5 */
    byte PTFPE6      :1;                                       /* Pullup Enable for Port F Bit 6 */
    byte PTFPE7      :1;                                       /* Pullup Enable for Port F Bit 7 */
  } Bits;
  struct {
    byte grpPTFPE :8;
  } MergedBits;
} PTFPESTR;
extern volatile PTFPESTR _PTFPE @0x00000041;
#define PTFPE _PTFPE.Byte
#define PTFPE_PTFPE0 _PTFPE.Bits.PTFPE0
#define PTFPE_PTFPE1 _PTFPE.Bits.PTFPE1
#define PTFPE_PTFPE2 _PTFPE.Bits.PTFPE2
#define PTFPE_PTFPE3 _PTFPE.Bits.PTFPE3
#define PTFPE_PTFPE4 _PTFPE.Bits.PTFPE4
#define PTFPE_PTFPE5 _PTFPE.Bits.PTFPE5
#define PTFPE_PTFPE6 _PTFPE.Bits.PTFPE6
#define PTFPE_PTFPE7 _PTFPE.Bits.PTFPE7
#define PTFPE_PTFPE _PTFPE.MergedBits.grpPTFPE

#define PTFPE_PTFPE0_MASK   1
#define PTFPE_PTFPE0_BITNUM 0
#define PTFPE_PTFPE1_MASK   2
#define PTFPE_PTFPE1_BITNUM 1
#define PTFPE_PTFPE2_MASK   4
#define PTFPE_PTFPE2_BITNUM 2
#define PTFPE_PTFPE3_MASK   8
#define PTFPE_PTFPE3_BITNUM 3
#define PTFPE_PTFPE4_MASK   16
#define PTFPE_PTFPE4_BITNUM 4
#define PTFPE_PTFPE5_MASK   32
#define PTFPE_PTFPE5_BITNUM 5
#define PTFPE_PTFPE6_MASK   64
#define PTFPE_PTFPE6_BITNUM 6
#define PTFPE_PTFPE7_MASK   128
#define PTFPE_PTFPE7_BITNUM 7
#define PTFPE_PTFPE_MASK  255
#define PTFPE_PTFPE_BITNUM  0


/*** PTFSE - Slew Rate Control Enable for Port F; 0x00000042 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFSE0      :1;                                       /* Slew Rate Control Enable for Port F Bit 0 */
    byte PTFSE1      :1;                                       /* Slew Rate Control Enable for Port F Bit 1 */
    byte PTFSE2      :1;                                       /* Slew Rate Control Enable for Port F Bit 2 */
    byte PTFSE3      :1;                                       /* Slew Rate Control Enable for Port F Bit 3 */
    byte PTFSE4      :1;                                       /* Slew Rate Control Enable for Port F Bit 4 */
    byte PTFSE5      :1;                                       /* Slew Rate Control Enable for Port F Bit 5 */
    byte PTFSE6      :1;                                       /* Slew Rate Control Enable for Port F Bit 6 */
    byte PTFSE7      :1;                                       /* Slew Rate Control Enable for Port F Bit 7 */
  } Bits;
  struct {
    byte grpPTFSE :8;
  } MergedBits;
} PTFSESTR;
extern volatile PTFSESTR _PTFSE @0x00000042;
#define PTFSE _PTFSE.Byte
#define PTFSE_PTFSE0 _PTFSE.Bits.PTFSE0
#define PTFSE_PTFSE1 _PTFSE.Bits.PTFSE1
#define PTFSE_PTFSE2 _PTFSE.Bits.PTFSE2
#define PTFSE_PTFSE3 _PTFSE.Bits.PTFSE3
#define PTFSE_PTFSE4 _PTFSE.Bits.PTFSE4
#define PTFSE_PTFSE5 _PTFSE.Bits.PTFSE5
#define PTFSE_PTFSE6 _PTFSE.Bits.PTFSE6
#define PTFSE_PTFSE7 _PTFSE.Bits.PTFSE7
#define PTFSE_PTFSE _PTFSE.MergedBits.grpPTFSE

#define PTFSE_PTFSE0_MASK   1
#define PTFSE_PTFSE0_BITNUM 0
#define PTFSE_PTFSE1_MASK   2
#define PTFSE_PTFSE1_BITNUM 1
#define PTFSE_PTFSE2_MASK   4
#define PTFSE_PTFSE2_BITNUM 2
#define PTFSE_PTFSE3_MASK   8
#define PTFSE_PTFSE3_BITNUM 3
#define PTFSE_PTFSE4_MASK   16
#define PTFSE_PTFSE4_BITNUM 4
#define PTFSE_PTFSE5_MASK   32
#define PTFSE_PTFSE5_BITNUM 5
#define PTFSE_PTFSE6_MASK   64
#define PTFSE_PTFSE6_BITNUM 6
#define PTFSE_PTFSE7_MASK   128
#define PTFSE_PTFSE7_BITNUM 7
#define PTFSE_PTFSE_MASK  255
#define PTFSE_PTFSE_BITNUM  0


