AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
/*** PTFDD - Data Direction Register F; 0x00000043 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFDD0      :1;                                       /* Data Direction for Port F Bit 0 */
    byte PTFDD1      :1;                                       /* Data Direction for Port F Bit 1 */
    byte PTFDD2      :1;                                       /* Data Direction for Port F Bit 2 */
    byte PTFDD3      :1;                                       /* Data Direction for Port F Bit 3 */
    byte PTFDD4      :1;                                       /* Data Direction for Port F Bit 4 */
    byte PTFDD5      :1;                                       /* Data Direction for Port F Bit 5 */
    byte PTFDD6      :1;                                       /* Data Direction for Port F Bit 6 */
    byte PTFDD7      :1;                                       /* Data Direction for Port F Bit 7 */
  } Bits;
  struct {
    byte grpPTFDD :8;
  } MergedBits;
} PTFDDSTR;
extern volatile PTFDDSTR _PTFDD @0x00000043;
#define PTFDD _PTFDD.Byte
#define PTFDD_PTFDD0 _PTFDD.Bits.PTFDD0
#define PTFDD_PTFDD1 _PTFDD.Bits.PTFDD1
#define PTFDD_PTFDD2 _PTFDD.Bits.PTFDD2
#define PTFDD_PTFDD3 _PTFDD.Bits.PTFDD3
#define PTFDD_PTFDD4 _PTFDD.Bits.PTFDD4
#define PTFDD_PTFDD5 _PTFDD.Bits.PTFDD5
#define PTFDD_PTFDD6 _PTFDD.Bits.PTFDD6
#define PTFDD_PTFDD7 _PTFDD.Bits.PTFDD7
#define PTFDD_PTFDD _PTFDD.MergedBits.grpPTFDD

#define PTFDD_PTFDD0_MASK   1
#define PTFDD_PTFDD0_BITNUM 0
#define PTFDD_PTFDD1_MASK   2
#define PTFDD_PTFDD1_BITNUM 1
#define PTFDD_PTFDD2_MASK   4
#define PTFDD_PTFDD2_BITNUM 2
#define PTFDD_PTFDD3_MASK   8
#define PTFDD_PTFDD3_BITNUM 3
#define PTFDD_PTFDD4_MASK   16
#define PTFDD_PTFDD4_BITNUM 4
#define PTFDD_PTFDD5_MASK   32
#define PTFDD_PTFDD5_BITNUM 5
#define PTFDD_PTFDD6_MASK   64
#define PTFDD_PTFDD6_BITNUM 6
#define PTFDD_PTFDD7_MASK   128
#define PTFDD_PTFDD7_BITNUM 7
#define PTFDD_PTFDD_MASK  255
#define PTFDD_PTFDD_BITNUM  0


/*** PTGD - Port G Data Register; 0x00000044 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGD0       :1;                                       /* Port G Data Register Bit 0 */
    byte PTGD1       :1;                                       /* Port G Data Register Bit 1 */
    byte PTGD2       :1;                                       /* Port G Data Register Bit 2 */
    byte PTGD3       :1;                                       /* Port G Data Register Bit 3 */
    byte PTGD4       :1;                                       /* Port G Data Register Bit 4 */
    byte PTGD5       :1;                                       /* Port G Data Register Bit 5 */
    byte PTGD6       :1;                                       /* Port G Data Register Bit 6 */
    byte PTGD7       :1;                                       /* Port G Data Register Bit 7 */
  } Bits;
  struct {
    byte grpPTGD :8;
  } MergedBits;
} PTGDSTR;
extern volatile PTGDSTR _PTGD @0x00000044;
#define PTGD _PTGD.Byte
#define PTGD_PTGD0 _PTGD.Bits.PTGD0
#define PTGD_PTGD1 _PTGD.Bits.PTGD1
#define PTGD_PTGD2 _PTGD.Bits.PTGD2
#define PTGD_PTGD3 _PTGD.Bits.PTGD3
#define PTGD_PTGD4 _PTGD.Bits.PTGD4
#define PTGD_PTGD5 _PTGD.Bits.PTGD5
#define PTGD_PTGD6 _PTGD.Bits.PTGD6
#define PTGD_PTGD7 _PTGD.Bits.PTGD7
#define PTGD_PTGD _PTGD.MergedBits.grpPTGD

#define PTGD_PTGD0_MASK   1
#define PTGD_PTGD0_BITNUM 0
#define PTGD_PTGD1_MASK   2
#define PTGD_PTGD1_BITNUM 1
#define PTGD_PTGD2_MASK   4
#define PTGD_PTGD2_BITNUM 2
#define PTGD_PTGD3_MASK   8
#define PTGD_PTGD3_BITNUM 3
#define PTGD_PTGD4_MASK   16
#define PTGD_PTGD4_BITNUM 4
#define PTGD_PTGD5_MASK   32
#define PTGD_PTGD5_BITNUM 5
#define PTGD_PTGD6_MASK   64
#define PTGD_PTGD6_BITNUM 6
#define PTGD_PTGD7_MASK   128
#define PTGD_PTGD7_BITNUM 7
#define PTGD_PTGD_MASK  255
#define PTGD_PTGD_BITNUM  0


/*** PTGPE - Pullup Enable for Port G; 0x00000045 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGPE0      :1;                                       /* Pullup Enable for Port G Bit 0 */
    byte PTGPE1      :1;                                       /* Pullup Enable for Port G Bit 1 */
    byte PTGPE2      :1;                                       /* Pullup Enable for Port G Bit 2 */
    byte PTGPE3      :1;                                       /* Pullup Enable for Port G Bit 3 */
    byte PTGPE4      :1;                                       /* Pullup Enable for Port G Bit 4 */
    byte PTGPE5      :1;                                       /* Pullup Enable for Port G Bit 5 */
    byte PTGPE6      :1;                                       /* Pullup Enable for Port G Bit 6 */
    byte PTGPE7      :1;                                       /* Pullup Enable for Port G Bit 7 */
  } Bits;
  struct {
    byte grpPTGPE :8;
  } MergedBits;
} PTGPESTR;
extern volatile PTGPESTR _PTGPE @0x00000045;
#define PTGPE _PTGPE.Byte
#define PTGPE_PTGPE0 _PTGPE.Bits.PTGPE0
#define PTGPE_PTGPE1 _PTGPE.Bits.PTGPE1
#define PTGPE_PTGPE2 _PTGPE.Bits.PTGPE2
#define PTGPE_PTGPE3 _PTGPE.Bits.PTGPE3
#define PTGPE_PTGPE4 _PTGPE.Bits.PTGPE4
#define PTGPE_PTGPE5 _PTGPE.Bits.PTGPE5
#define PTGPE_PTGPE6 _PTGPE.Bits.PTGPE6
#define PTGPE_PTGPE7 _PTGPE.Bits.PTGPE7
#define PTGPE_PTGPE _PTGPE.MergedBits.grpPTGPE

#define PTGPE_PTGPE0_MASK   1
#define PTGPE_PTGPE0_BITNUM 0
#define PTGPE_PTGPE1_MASK   2
#define PTGPE_PTGPE1_BITNUM 1
#define PTGPE_PTGPE2_MASK   4
#define PTGPE_PTGPE2_BITNUM 2
#define PTGPE_PTGPE3_MASK   8
#define PTGPE_PTGPE3_BITNUM 3
#define PTGPE_PTGPE4_MASK   16
#define PTGPE_PTGPE4_BITNUM 4
#define PTGPE_PTGPE5_MASK   32
#define PTGPE_PTGPE5_BITNUM 5
#define PTGPE_PTGPE6_MASK   64
#define PTGPE_PTGPE6_BITNUM 6
#define PTGPE_PTGPE7_MASK   128
#define PTGPE_PTGPE7_BITNUM 7
#define PTGPE_PTGPE_MASK  255
#define PTGPE_PTGPE_BITNUM  0


/*** PTGSE - Slew Rate Control Enable for Port G; 0x00000046 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGSE0      :1;                                       /* Slew Rate Control Enable for Port G Bit 0 */
    byte PTGSE1      :1;                                       /* Slew Rate Control Enable for Port G Bit 1 */
    byte PTGSE2      :1;                                       /* Slew Rate Control Enable for Port G Bit 2 */
    byte PTGSE3      :1;                                       /* Slew Rate Control Enable for Port G Bit 3 */
    byte PTGSE4      :1;                                       /* Slew Rate Control Enable for Port G Bit 4 */
    byte PTGSE5      :1;                                       /* Slew Rate Control Enable for Port G Bit 5 */
    byte PTGSE6      :1;                                       /* Slew Rate Control Enable for Port G Bit 6 */
    byte PTGSE7      :1;                                       /* Slew Rate Control Enable for Port G Bit 7 */
  } Bits;
  struct {
    byte grpPTGSE :8;
  } MergedBits;
} PTGSESTR;
