AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
extern volatile PTGSESTR _PTGSE @0x00000046;
#define PTGSE _PTGSE.Byte
#define PTGSE_PTGSE0 _PTGSE.Bits.PTGSE0
#define PTGSE_PTGSE1 _PTGSE.Bits.PTGSE1
#define PTGSE_PTGSE2 _PTGSE.Bits.PTGSE2
#define PTGSE_PTGSE3 _PTGSE.Bits.PTGSE3
#define PTGSE_PTGSE4 _PTGSE.Bits.PTGSE4
#define PTGSE_PTGSE5 _PTGSE.Bits.PTGSE5
#define PTGSE_PTGSE6 _PTGSE.Bits.PTGSE6
#define PTGSE_PTGSE7 _PTGSE.Bits.PTGSE7
#define PTGSE_PTGSE _PTGSE.MergedBits.grpPTGSE

#define PTGSE_PTGSE0_MASK   1
#define PTGSE_PTGSE0_BITNUM 0
#define PTGSE_PTGSE1_MASK   2
#define PTGSE_PTGSE1_BITNUM 1
#define PTGSE_PTGSE2_MASK   4
#define PTGSE_PTGSE2_BITNUM 2
#define PTGSE_PTGSE3_MASK   8
#define PTGSE_PTGSE3_BITNUM 3
#define PTGSE_PTGSE4_MASK   16
#define PTGSE_PTGSE4_BITNUM 4
#define PTGSE_PTGSE5_MASK   32
#define PTGSE_PTGSE5_BITNUM 5
#define PTGSE_PTGSE6_MASK   64
#define PTGSE_PTGSE6_BITNUM 6
#define PTGSE_PTGSE7_MASK   128
#define PTGSE_PTGSE7_BITNUM 7
#define PTGSE_PTGSE_MASK  255
#define PTGSE_PTGSE_BITNUM  0


/*** PTGDD - Data Direction Register G; 0x00000047 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGDD0      :1;                                       /* Data Direction for Port G Bit 0 */
    byte PTGDD1      :1;                                       /* Data Direction for Port G Bit 1 */
    byte PTGDD2      :1;                                       /* Data Direction for Port G Bit 2 */
    byte PTGDD3      :1;                                       /* Data Direction for Port G Bit 3 */
    byte PTGDD4      :1;                                       /* Data Direction for Port G Bit 4 */
    byte PTGDD5      :1;                                       /* Data Direction for Port G Bit 5 */
    byte PTGDD6      :1;                                       /* Data Direction for Port G Bit 6 */
    byte PTGDD7      :1;                                       /* Data Direction for Port G Bit 7 */
  } Bits;
  struct {
    byte grpPTGDD :8;
  } MergedBits;
} PTGDDSTR;
extern volatile PTGDDSTR _PTGDD @0x00000047;
#define PTGDD _PTGDD.Byte
#define PTGDD_PTGDD0 _PTGDD.Bits.PTGDD0
#define PTGDD_PTGDD1 _PTGDD.Bits.PTGDD1
#define PTGDD_PTGDD2 _PTGDD.Bits.PTGDD2
#define PTGDD_PTGDD3 _PTGDD.Bits.PTGDD3
#define PTGDD_PTGDD4 _PTGDD.Bits.PTGDD4
#define PTGDD_PTGDD5 _PTGDD.Bits.PTGDD5
#define PTGDD_PTGDD6 _PTGDD.Bits.PTGDD6
#define PTGDD_PTGDD7 _PTGDD.Bits.PTGDD7
#define PTGDD_PTGDD _PTGDD.MergedBits.grpPTGDD

#define PTGDD_PTGDD0_MASK   1
#define PTGDD_PTGDD0_BITNUM 0
#define PTGDD_PTGDD1_MASK   2
#define PTGDD_PTGDD1_BITNUM 1
#define PTGDD_PTGDD2_MASK   4
#define PTGDD_PTGDD2_BITNUM 2
#define PTGDD_PTGDD3_MASK   8
#define PTGDD_PTGDD3_BITNUM 3
#define PTGDD_PTGDD4_MASK   16
#define PTGDD_PTGDD4_BITNUM 4
#define PTGDD_PTGDD5_MASK   32
#define PTGDD_PTGDD5_BITNUM 5
#define PTGDD_PTGDD6_MASK   64
#define PTGDD_PTGDD6_BITNUM 6
#define PTGDD_PTGDD7_MASK   128
#define PTGDD_PTGDD7_BITNUM 7
#define PTGDD_PTGDD_MASK  255
#define PTGDD_PTGDD_BITNUM  0


/*** ICGC1 - ICG Control Register 1; 0x00000048 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte OSCSTEN     :1;                                       /* Enable Oscillator in Off Mode */
    byte CLKS0       :1;                                       /* Clock Mode Select Bit 0 */
    byte CLKS1       :1;                                       /* Clock Mode Select Bit 1 */
    byte REFS        :1;                                       /* External Reference Select */
    byte RANGE       :1;                                       /* Frequency Range Select */
    byte             :1;
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpCLKS :2;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ICGC1STR;
extern volatile ICGC1STR _ICGC1 @0x00000048;
#define ICGC1 _ICGC1.Byte
#define ICGC1_OSCSTEN _ICGC1.Bits.OSCSTEN
#define ICGC1_CLKS0 _ICGC1.Bits.CLKS0
#define ICGC1_CLKS1 _ICGC1.Bits.CLKS1
#define ICGC1_REFS _ICGC1.Bits.REFS
#define ICGC1_RANGE _ICGC1.Bits.RANGE
#define ICGC1_CLKS _ICGC1.MergedBits.grpCLKS

#define ICGC1_OSCSTEN_MASK   4
#define ICGC1_OSCSTEN_BITNUM 2
#define ICGC1_CLKS0_MASK   8
#define ICGC1_CLKS0_BITNUM 3
#define ICGC1_CLKS1_MASK   16
#define ICGC1_CLKS1_BITNUM 4
#define ICGC1_REFS_MASK   32
#define ICGC1_REFS_BITNUM 5
#define ICGC1_RANGE_MASK   64
#define ICGC1_RANGE_BITNUM 6
#define ICGC1_CLKS_MASK  24
#define ICGC1_CLKS_BITNUM  3


/*** ICGC2 - ICG Control Register 2; 0x00000049 ***/
typedef union {
  byte Byte;
  struct {
    byte RFD0        :1;                                       /* Reduced Frequency Divider Bit 0 */
    byte RFD1        :1;                                       /* Reduced Frequency Divider Bit 1 */
    byte RFD2        :1;                                       /* Reduced Frequency Divider Bit 2 */
    byte LOCRE       :1;                                       /* Loss of Clock Reset Enable */
    byte MFD0        :1;                                       /* Multiplication Factor Bit 0 */
    byte MFD1        :1;                                       /* Multiplication Factor Bit 1 */
    byte MFD2        :1;                                       /* Multiplication Factor Bit 2 */
    byte LOLRE       :1;                                       /* Loss of Lock Reset Enable */
  } Bits;
  struct {
    byte grpRFD  :3;
    byte         :1;
    byte grpMFD  :3;
    byte         :1;
  } MergedBits;
} ICGC2STR;
extern volatile ICGC2STR _ICGC2 @0x00000049;
#define ICGC2 _ICGC2.Byte
#define ICGC2_RFD0 _ICGC2.Bits.RFD0
#define ICGC2_RFD1 _ICGC2.Bits.RFD1
#define ICGC2_RFD2 _ICGC2.Bits.RFD2
#define ICGC2_LOCRE _ICGC2.Bits.LOCRE
#define ICGC2_MFD0 _ICGC2.Bits.MFD0
#define ICGC2_MFD1 _ICGC2.Bits.MFD1
#define ICGC2_MFD2 _ICGC2.Bits.MFD2
#define ICGC2_LOLRE _ICGC2.Bits.LOLRE
#define ICGC2_RFD _ICGC2.MergedBits.grpRFD
#define ICGC2_MFD _ICGC2.MergedBits.grpMFD

#define ICGC2_RFD0_MASK   1
#define ICGC2_RFD0_BITNUM 0
#define ICGC2_RFD1_MASK   2
#define ICGC2_RFD1_BITNUM 1
#define ICGC2_RFD2_MASK   4
#define ICGC2_RFD2_BITNUM 2
#define ICGC2_LOCRE_MASK   8
#define ICGC2_LOCRE_BITNUM 3
#define ICGC2_MFD0_MASK   16
#define ICGC2_MFD0_BITNUM 4
#define ICGC2_MFD1_MASK   32
#define ICGC2_MFD1_BITNUM 5
#define ICGC2_MFD2_MASK   64
#define ICGC2_MFD2_BITNUM 6
#define ICGC2_LOLRE_MASK   128
#define ICGC2_LOLRE_BITNUM 7
#define ICGC2_RFD_MASK  7
#define ICGC2_RFD_BITNUM  0
#define ICGC2_MFD_MASK  112
#define ICGC2_MFD_BITNUM  4


/*** ICGS1 - ICG Status Register 1; 0x0000004A ***/
typedef union {
  byte Byte;
  struct {
    byte ICGIF       :1;                                       /* ICG Interrupt Flag */
    byte ERCS        :1;                                       /* External Reference Clock Status */
    byte LOCS        :1;                                       /* Loss Of Clock Status */
    byte LOCK        :1;                                       /* FLL Lock Status */
    byte LOLS        :1;                                       /* FLL Loss of Lock Status */
    byte REFST       :1;                                       /* Reference Clock Status */
    byte CLKST0      :1;                                       /* Clock Mode Status Bit 0 */
    byte CLKST1      :1;                                       /* Clock Mode Status Bit 1 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpCLKST :2;
  } MergedBits;
} ICGS1STR;
extern volatile ICGS1STR _ICGS1 @0x0000004A;
#define ICGS1 _ICGS1.Byte
#define ICGS1_ICGIF _ICGS1.Bits.ICGIF
#define ICGS1_ERCS _ICGS1.Bits.ERCS
#define ICGS1_LOCS _ICGS1.Bits.LOCS
#define ICGS1_LOCK _ICGS1.Bits.LOCK
#define ICGS1_LOLS _ICGS1.Bits.LOLS
#define ICGS1_REFST _ICGS1.Bits.REFST
#define ICGS1_CLKST0 _ICGS1.Bits.CLKST0
#define ICGS1_CLKST1 _ICGS1.Bits.CLKST1
#define ICGS1_CLKST _ICGS1.MergedBits.grpCLKST

#define ICGS1_ICGIF_MASK   1
#define ICGS1_ICGIF_BITNUM 0
#define ICGS1_ERCS_MASK   2
#define ICGS1_ERCS_BITNUM 1
#define ICGS1_LOCS_MASK   4
#define ICGS1_LOCS_BITNUM 2
#define ICGS1_LOCK_MASK   8
#define ICGS1_LOCK_BITNUM 3
#define ICGS1_LOLS_MASK   16
#define ICGS1_LOLS_BITNUM 4
#define ICGS1_REFST_MASK   32
#define ICGS1_REFST_BITNUM 5
#define ICGS1_CLKST0_MASK   64
#define ICGS1_CLKST0_BITNUM 6
#define ICGS1_CLKST1_MASK   128
#define ICGS1_CLKST1_BITNUM 7
#define ICGS1_CLKST_MASK  192
#define ICGS1_CLKST_BITNUM  6


/*** ICGS2 - ICG Status Register 2; 0x0000004B ***/
typedef union {
  byte Byte;
  struct {
    byte DCOS        :1;                                       /* DCO Clock Stable */
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
  } Bits;
} ICGS2STR;
extern volatile ICGS2STR _ICGS2 @0x0000004B;
#define ICGS2 _ICGS2.Byte
#define ICGS2_DCOS _ICGS2.Bits.DCOS

#define ICGS2_DCOS_MASK   1
#define ICGS2_DCOS_BITNUM 0


/*** ICGFLT - ICG Filter Register; 0x0000004C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ICGFLTL - ICG Lower Filter Register; 0x0000004C ***/
    union {
      byte Byte;
      struct {
        byte FILT0       :1;                                       /* ICG Filter Bit 0 */
        byte FILT1       :1;                                       /* ICG Filter Bit 1 */
        byte FILT2       :1;                                       /* ICG Filter Bit 2 */
        byte FILT3       :1;                                       /* ICG Filter Bit 3 */
        byte FILT4       :1;                                       /* ICG Filter Bit 4 */
        byte FILT5       :1;                                       /* ICG Filter Bit 5 */
        byte FILT6       :1;                                       /* ICG Filter Bit 6 */
        byte FILT7       :1;                                       /* ICG Filter Bit 7 */
      } Bits;
      struct {
        byte grpFILT :8;
      } MergedBits;
    } ICGFLTLSTR;
    #define ICGFLTL _ICGFLT.Overlap_STR.ICGFLTLSTR.Byte
    #define ICGFLTL_FILT0 _ICGFLT.Overlap_STR.ICGFLTLSTR.Bits.FILT0
    #define ICGFLTL_FILT1 _ICGFLT.Overlap_STR.ICGFLTLSTR.Bits.FILT1
    #define ICGFLTL_FILT2 _ICGFLT.Overlap_STR.ICGFLTLSTR.Bits.FILT2
    #define ICGFLTL_FILT3 _ICGFLT.Overlap_STR.ICGFLTLSTR.Bits.FILT3
    #define ICGFLTL_FILT4 _ICGFLT.Overlap_STR.ICGFLTLSTR.Bits.FILT4
    #define ICGFLTL_FILT5 _ICGFLT.Overlap_STR.ICGFLTLSTR.Bits.FILT5
    #define ICGFLTL_FILT6 _ICGFLT.Overlap_STR.ICGFLTLSTR.Bits.FILT6
    #define ICGFLTL_FILT7 _ICGFLT.Overlap_STR.ICGFLTLSTR.Bits.FILT7

    #define ICGFLTL_FILT _ICGFLT.Overlap_STR.ICGFLTLSTR.MergedBits.grpFILT

    #define ICGFLTL_FILT0_MASK   1
    #define ICGFLTL_FILT0_BITNUM 0
    #define ICGFLTL_FILT1_MASK   2
    #define ICGFLTL_FILT1_BITNUM 1
    #define ICGFLTL_FILT2_MASK   4
    #define ICGFLTL_FILT2_BITNUM 2
    #define ICGFLTL_FILT3_MASK   8
    #define ICGFLTL_FILT3_BITNUM 3
    #define ICGFLTL_FILT4_MASK   16
    #define ICGFLTL_FILT4_BITNUM 4
    #define ICGFLTL_FILT5_MASK   32
    #define ICGFLTL_FILT5_BITNUM 5
    #define ICGFLTL_FILT6_MASK   64
    #define ICGFLTL_FILT6_BITNUM 6
    #define ICGFLTL_FILT7_MASK   128
    #define ICGFLTL_FILT7_BITNUM 7
    #define ICGFLTL_FILT_MASK  255
    #define ICGFLTL_FILT_BITNUM  0


    /*** ICGFLTU - ICG Upper Filter Register; 0x0000004D ***/
    union {
      byte Byte;
      struct {
        byte FILT8       :1;                                       /* ICG Filter Bit 8 */
        byte FILT9       :1;                                       /* ICG Filter Bit 9 */
        byte FILT10      :1;                                       /* ICG Filter Bit 10 */
        byte FILT11      :1;                                       /* ICG Filter Bit 11 */
        byte             :1;
        byte             :1;
        byte             :1;
        byte             :1;
      } Bits;
      struct {
        byte grpFILT_8 :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } ICGFLTUSTR;
    #define ICGFLTU _ICGFLT.Overlap_STR.ICGFLTUSTR.Byte
    #define ICGFLTU_FILT8 _ICGFLT.Overlap_STR.ICGFLTUSTR.Bits.FILT8
    #define ICGFLTU_FILT9 _ICGFLT.Overlap_STR.ICGFLTUSTR.Bits.FILT9
    #define ICGFLTU_FILT10 _ICGFLT.Overlap_STR.ICGFLTUSTR.Bits.FILT10
    #define ICGFLTU_FILT11 _ICGFLT.Overlap_STR.ICGFLTUSTR.Bits.FILT11

    #define ICGFLTU_FILT_8 _ICGFLT.Overlap_STR.ICGFLTUSTR.MergedBits.grpFILT_8
    #define ICGFLTU_FILT ICGFLTU_FILT_8

    #define ICGFLTU_FILT8_MASK   1
    #define ICGFLTU_FILT8_BITNUM 0
    #define ICGFLTU_FILT9_MASK   2
    #define ICGFLTU_FILT9_BITNUM 1
    #define ICGFLTU_FILT10_MASK   4
    #define ICGFLTU_FILT10_BITNUM 2
    #define ICGFLTU_FILT11_MASK   8
    #define ICGFLTU_FILT11_BITNUM 3
    #define ICGFLTU_FILT_8_MASK  15
    #define ICGFLTU_FILT_8_BITNUM  0

  } Overlap_STR;

