AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
  struct {
    word FILT8       :1;                                       /* ICG Filter Bit 8 */
    word FILT9       :1;                                       /* ICG Filter Bit 9 */
    word FILT10      :1;                                       /* ICG Filter Bit 10 */
    word FILT11      :1;                                       /* ICG Filter Bit 11 */
    word             :1;
    word             :1;
    word             :1;
    word             :1;
    word FILT0       :1;                                       /* ICG Filter Bit 0 */
    word FILT1       :1;                                       /* ICG Filter Bit 1 */
    word FILT2       :1;                                       /* ICG Filter Bit 2 */
    word FILT3       :1;                                       /* ICG Filter Bit 3 */
    word FILT4       :1;                                       /* ICG Filter Bit 4 */
    word FILT5       :1;                                       /* ICG Filter Bit 5 */
    word FILT6       :1;                                       /* ICG Filter Bit 6 */
    word FILT7       :1;                                       /* ICG Filter Bit 7 */
  } Bits;
  struct {
    word grpFILT_8 :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpFILT :8;
  } MergedBits;
} ICGFLTSTR;
extern volatile ICGFLTSTR _ICGFLT @0x0000004C;
#define ICGFLT _ICGFLT.Word
#define ICGFLT_FILT8 _ICGFLT.Bits.FILT8
#define ICGFLT_FILT9 _ICGFLT.Bits.FILT9
#define ICGFLT_FILT10 _ICGFLT.Bits.FILT10
#define ICGFLT_FILT11 _ICGFLT.Bits.FILT11
#define ICGFLT_FILT0 _ICGFLT.Bits.FILT0
#define ICGFLT_FILT1 _ICGFLT.Bits.FILT1
#define ICGFLT_FILT2 _ICGFLT.Bits.FILT2
#define ICGFLT_FILT3 _ICGFLT.Bits.FILT3
#define ICGFLT_FILT4 _ICGFLT.Bits.FILT4
#define ICGFLT_FILT5 _ICGFLT.Bits.FILT5
#define ICGFLT_FILT6 _ICGFLT.Bits.FILT6
#define ICGFLT_FILT7 _ICGFLT.Bits.FILT7
#define ICGFLT_FILT_8 _ICGFLT.MergedBits.grpFILT_8
#define ICGFLT_FILT _ICGFLT.MergedBits.grpFILT

#define ICGFLT_FILT8_MASK   1
#define ICGFLT_FILT8_BITNUM 0
#define ICGFLT_FILT9_MASK   2
#define ICGFLT_FILT9_BITNUM 1
#define ICGFLT_FILT10_MASK   4
#define ICGFLT_FILT10_BITNUM 2
#define ICGFLT_FILT11_MASK   8
#define ICGFLT_FILT11_BITNUM 3
#define ICGFLT_FILT0_MASK   256
#define ICGFLT_FILT0_BITNUM 8
#define ICGFLT_FILT1_MASK   512
#define ICGFLT_FILT1_BITNUM 9
#define ICGFLT_FILT2_MASK   1024
#define ICGFLT_FILT2_BITNUM 10
#define ICGFLT_FILT3_MASK   2048
#define ICGFLT_FILT3_BITNUM 11
#define ICGFLT_FILT4_MASK   4096
#define ICGFLT_FILT4_BITNUM 12
#define ICGFLT_FILT5_MASK   8192
#define ICGFLT_FILT5_BITNUM 13
#define ICGFLT_FILT6_MASK   16384
#define ICGFLT_FILT6_BITNUM 14
#define ICGFLT_FILT7_MASK   32768
#define ICGFLT_FILT7_BITNUM 15
#define ICGFLT_FILT_8_MASK  15
#define ICGFLT_FILT_8_BITNUM  0
#define ICGFLT_FILT_MASK  65280
#define ICGFLT_FILT_BITNUM  8


/*** ICGTRM - ICG Trim Register; 0x0000004E ***/
typedef union {
  byte Byte;
  struct {
    byte TRIM0       :1;                                       /* ICG Trim Bit 0 */
    byte TRIM1       :1;                                       /* ICG Trim Bit 1 */
    byte TRIM2       :1;                                       /* ICG Trim Bit 2 */
    byte TRIM3       :1;                                       /* ICG Trim Bit 3 */
    byte TRIM4       :1;                                       /* ICG Trim Bit 4 */
    byte TRIM5       :1;                                       /* ICG Trim Bit 5 */
    byte TRIM6       :1;                                       /* ICG Trim Bit 6 */
    byte TRIM7       :1;                                       /* ICG Trim Bit 7 */
  } Bits;
  struct {
    byte grpTRIM :8;
  } MergedBits;
} ICGTRMSTR;
extern volatile ICGTRMSTR _ICGTRM @0x0000004E;
#define ICGTRM _ICGTRM.Byte
#define ICGTRM_TRIM0 _ICGTRM.Bits.TRIM0
#define ICGTRM_TRIM1 _ICGTRM.Bits.TRIM1
#define ICGTRM_TRIM2 _ICGTRM.Bits.TRIM2
#define ICGTRM_TRIM3 _ICGTRM.Bits.TRIM3
#define ICGTRM_TRIM4 _ICGTRM.Bits.TRIM4
#define ICGTRM_TRIM5 _ICGTRM.Bits.TRIM5
#define ICGTRM_TRIM6 _ICGTRM.Bits.TRIM6
#define ICGTRM_TRIM7 _ICGTRM.Bits.TRIM7
#define ICGTRM_TRIM _ICGTRM.MergedBits.grpTRIM

#define ICGTRM_TRIM0_MASK   1
#define ICGTRM_TRIM0_BITNUM 0
#define ICGTRM_TRIM1_MASK   2
#define ICGTRM_TRIM1_BITNUM 1
#define ICGTRM_TRIM2_MASK   4
#define ICGTRM_TRIM2_BITNUM 2
#define ICGTRM_TRIM3_MASK   8
#define ICGTRM_TRIM3_BITNUM 3
#define ICGTRM_TRIM4_MASK   16
#define ICGTRM_TRIM4_BITNUM 4
#define ICGTRM_TRIM5_MASK   32
#define ICGTRM_TRIM5_BITNUM 5
#define ICGTRM_TRIM6_MASK   64
#define ICGTRM_TRIM6_BITNUM 6
#define ICGTRM_TRIM7_MASK   128
#define ICGTRM_TRIM7_BITNUM 7
#define ICGTRM_TRIM_MASK  255
#define ICGTRM_TRIM_BITNUM  0


/*** ATD1C - ATD1 Control Register; 0x00000050 ***/
typedef union {
  byte Byte;
  struct {
    byte PRS0        :1;                                       /* Prescaler Rate Select Bit 0 */
    byte PRS1        :1;                                       /* Prescaler Rate Select Bit 1 */
    byte PRS2        :1;                                       /* Prescaler Rate Select Bit 2 */
    byte PRS3        :1;                                       /* Prescaler Rate Select Bit 3 */
    byte SGN         :1;                                       /* Signed Result Select */
    byte RES8        :1;                                       /* ATD Resolution Select */
    byte DJM         :1;                                       /* Data Justification Mode */
    byte ATDPU       :1;                                       /* ATD Power Up */
  } Bits;
  struct {
    byte grpPRS  :4;
    byte         :1;
    byte grpRES_8 :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ATD1CSTR;
extern volatile ATD1CSTR _ATD1C @0x00000050;
#define ATD1C _ATD1C.Byte
#define ATD1C_PRS0 _ATD1C.Bits.PRS0
#define ATD1C_PRS1 _ATD1C.Bits.PRS1
#define ATD1C_PRS2 _ATD1C.Bits.PRS2
#define ATD1C_PRS3 _ATD1C.Bits.PRS3
#define ATD1C_SGN _ATD1C.Bits.SGN
#define ATD1C_RES8 _ATD1C.Bits.RES8
#define ATD1C_DJM _ATD1C.Bits.DJM
#define ATD1C_ATDPU _ATD1C.Bits.ATDPU
#define ATD1C_PRS _ATD1C.MergedBits.grpPRS

#define ATD1C_PRS0_MASK   1
#define ATD1C_PRS0_BITNUM 0
#define ATD1C_PRS1_MASK   2
#define ATD1C_PRS1_BITNUM 1
#define ATD1C_PRS2_MASK   4
#define ATD1C_PRS2_BITNUM 2
#define ATD1C_PRS3_MASK   8
#define ATD1C_PRS3_BITNUM 3
#define ATD1C_SGN_MASK   16
#define ATD1C_SGN_BITNUM 4
#define ATD1C_RES8_MASK   32
#define ATD1C_RES8_BITNUM 5
#define ATD1C_DJM_MASK   64
#define ATD1C_DJM_BITNUM 6
#define ATD1C_ATDPU_MASK   128
#define ATD1C_ATDPU_BITNUM 7
#define ATD1C_PRS_MASK  15
#define ATD1C_PRS_BITNUM  0


/*** ATD1SC - ATD1 Status and Control Register; 0x00000051 ***/
typedef union {
  byte Byte;
  struct {
    byte ATDCH0      :1;                                       /* Analog Input Channel Select Bit 0 */
    byte ATDCH1      :1;                                       /* Analog Input Channel Select Bit 1 */
    byte ATDCH2      :1;                                       /* Analog Input Channel Select Bit 2 */
    byte ATDCH3      :1;                                       /* Analog Input Channel Select Bit 3 */
    byte ATDCH4      :1;                                       /* Analog Input Channel Select Bit 4 */
    byte ATDCO       :1;                                       /* ATD Continuous Conversion */
    byte ATDIE       :1;                                       /* ATD Interrupt Enabled */
    byte CCF         :1;                                       /* Conversion Complete Flag */
  } Bits;
  struct {
    byte grpATDCH :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ATD1SCSTR;
