AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
extern volatile ATD1SCSTR _ATD1SC @0x00000051;
#define ATD1SC _ATD1SC.Byte
#define ATD1SC_ATDCH0 _ATD1SC.Bits.ATDCH0
#define ATD1SC_ATDCH1 _ATD1SC.Bits.ATDCH1
#define ATD1SC_ATDCH2 _ATD1SC.Bits.ATDCH2
#define ATD1SC_ATDCH3 _ATD1SC.Bits.ATDCH3
#define ATD1SC_ATDCH4 _ATD1SC.Bits.ATDCH4
#define ATD1SC_ATDCO _ATD1SC.Bits.ATDCO
#define ATD1SC_ATDIE _ATD1SC.Bits.ATDIE
#define ATD1SC_CCF _ATD1SC.Bits.CCF
#define ATD1SC_ATDCH _ATD1SC.MergedBits.grpATDCH

#define ATD1SC_ATDCH0_MASK   1
#define ATD1SC_ATDCH0_BITNUM 0
#define ATD1SC_ATDCH1_MASK   2
#define ATD1SC_ATDCH1_BITNUM 1
#define ATD1SC_ATDCH2_MASK   4
#define ATD1SC_ATDCH2_BITNUM 2
#define ATD1SC_ATDCH3_MASK   8
#define ATD1SC_ATDCH3_BITNUM 3
#define ATD1SC_ATDCH4_MASK   16
#define ATD1SC_ATDCH4_BITNUM 4
#define ATD1SC_ATDCO_MASK   32
#define ATD1SC_ATDCO_BITNUM 5
#define ATD1SC_ATDIE_MASK   64
#define ATD1SC_ATDIE_BITNUM 6
#define ATD1SC_CCF_MASK   128
#define ATD1SC_CCF_BITNUM 7
#define ATD1SC_ATDCH_MASK  31
#define ATD1SC_ATDCH_BITNUM  0


/*** ATD1R - ATD1 Result Data; 0x00000052 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1RH - ATD1 Result Data High Right Justified; 0x00000052 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* ATD Result Data Bit 8 */
        byte BIT9        :1;                                       /* ATD Result Data Bit 9 */
        byte             :1;
        byte             :1;
        byte             :1;
        byte             :1;
        byte             :1;
        byte             :1;
      } Bits;
      struct {
        byte grpBIT_8 :2;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } ATD1RHSTR;
    #define ATD1RH _ATD1R.Overlap_STR.ATD1RHSTR.Byte
    #define ATD1RH_BIT8 _ATD1R.Overlap_STR.ATD1RHSTR.Bits.BIT8
    #define ATD1RH_BIT9 _ATD1R.Overlap_STR.ATD1RHSTR.Bits.BIT9

    #define ATD1RH_BIT_8 _ATD1R.Overlap_STR.ATD1RHSTR.MergedBits.grpBIT_8
    #define ATD1RH_BIT ATD1RH_BIT_8

    #define ATD1RH_BIT8_MASK   1
    #define ATD1RH_BIT8_BITNUM 0
    #define ATD1RH_BIT9_MASK   2
    #define ATD1RH_BIT9_BITNUM 1
    #define ATD1RH_BIT_8_MASK  3
    #define ATD1RH_BIT_8_BITNUM  0


    /*** ATD1RL - ATD1 Result Data Low Right Justified; 0x00000053 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* ATD Result Data Bit 0 */
        byte BIT1        :1;                                       /* ATD Result Data Bit 1 */
        byte BIT2        :1;                                       /* ATD Result Data Bit 2 */
        byte BIT3        :1;                                       /* ATD Result Data Bit 3 */
        byte BIT4        :1;                                       /* ATD Result Data Bit 4 */
        byte BIT5        :1;                                       /* ATD Result Data Bit 5 */
        byte BIT6        :1;                                       /* ATD Result Data Bit 6 */
        byte BIT7        :1;                                       /* ATD Result Data Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } ATD1RLSTR;
    #define ATD1RL _ATD1R.Overlap_STR.ATD1RLSTR.Byte
    #define ATD1RL_BIT0 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT0
    #define ATD1RL_BIT1 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT1
    #define ATD1RL_BIT2 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT2
    #define ATD1RL_BIT3 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT3
    #define ATD1RL_BIT4 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT4
    #define ATD1RL_BIT5 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT5
    #define ATD1RL_BIT6 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT6
    #define ATD1RL_BIT7 _ATD1R.Overlap_STR.ATD1RLSTR.Bits.BIT7

    #define ATD1RL_BIT _ATD1R.Overlap_STR.ATD1RLSTR.MergedBits.grpBIT

    #define ATD1RL_BIT0_MASK   1
    #define ATD1RL_BIT0_BITNUM 0
    #define ATD1RL_BIT1_MASK   2
    #define ATD1RL_BIT1_BITNUM 1
    #define ATD1RL_BIT2_MASK   4
    #define ATD1RL_BIT2_BITNUM 2
    #define ATD1RL_BIT3_MASK   8
    #define ATD1RL_BIT3_BITNUM 3
    #define ATD1RL_BIT4_MASK   16
    #define ATD1RL_BIT4_BITNUM 4
    #define ATD1RL_BIT5_MASK   32
    #define ATD1RL_BIT5_BITNUM 5
    #define ATD1RL_BIT6_MASK   64
    #define ATD1RL_BIT6_BITNUM 6
    #define ATD1RL_BIT7_MASK   128
    #define ATD1RL_BIT7_BITNUM 7
    #define ATD1RL_BIT_MASK  255
    #define ATD1RL_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word BIT0        :1;                                       /* ATD Result Data Bit 0 */
    word BIT1        :1;                                       /* ATD Result Data Bit 1 */
    word BIT2        :1;                                       /* ATD Result Data Bit 2 */
    word BIT3        :1;                                       /* ATD Result Data Bit 3 */
    word BIT4        :1;                                       /* ATD Result Data Bit 4 */
    word BIT5        :1;                                       /* ATD Result Data Bit 5 */
    word BIT6        :1;                                       /* ATD Result Data Bit 6 */
    word BIT7        :1;                                       /* ATD Result Data Bit 7 */
    word BIT8        :1;                                       /* ATD Result Data Bit 8 */
    word BIT9        :1;                                       /* ATD Result Data Bit 9 */
    word             :1;
    word             :1;
    word             :1;
    word             :1;
    word             :1;
    word             :1;
  } Bits;
  struct {
    word grpBIT  :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} ATD1RSTR;
extern volatile ATD1RSTR _ATD1R @0x00000052;
#define ATD1R _ATD1R.Word
#define ATD1R_BIT0 _ATD1R.Bits.BIT0
#define ATD1R_BIT1 _ATD1R.Bits.BIT1
#define ATD1R_BIT2 _ATD1R.Bits.BIT2
#define ATD1R_BIT3 _ATD1R.Bits.BIT3
#define ATD1R_BIT4 _ATD1R.Bits.BIT4
#define ATD1R_BIT5 _ATD1R.Bits.BIT5
#define ATD1R_BIT6 _ATD1R.Bits.BIT6
#define ATD1R_BIT7 _ATD1R.Bits.BIT7
#define ATD1R_BIT8 _ATD1R.Bits.BIT8
#define ATD1R_BIT9 _ATD1R.Bits.BIT9
#define ATD1R_BIT _ATD1R.MergedBits.grpBIT

#define ATD1R_BIT0_MASK   1
#define ATD1R_BIT0_BITNUM 0
#define ATD1R_BIT1_MASK   2
#define ATD1R_BIT1_BITNUM 1
#define ATD1R_BIT2_MASK   4
#define ATD1R_BIT2_BITNUM 2
#define ATD1R_BIT3_MASK   8
#define ATD1R_BIT3_BITNUM 3
#define ATD1R_BIT4_MASK   16
#define ATD1R_BIT4_BITNUM 4
#define ATD1R_BIT5_MASK   32
#define ATD1R_BIT5_BITNUM 5
#define ATD1R_BIT6_MASK   64
#define ATD1R_BIT6_BITNUM 6
#define ATD1R_BIT7_MASK   128
#define ATD1R_BIT7_BITNUM 7
#define ATD1R_BIT8_MASK   256
#define ATD1R_BIT8_BITNUM 8
#define ATD1R_BIT9_MASK   512
#define ATD1R_BIT9_BITNUM 9
#define ATD1R_BIT_MASK  1023
#define ATD1R_BIT_BITNUM  0


