AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
/*** ATD1PE - ATD1 Pin Enable; 0x00000054 ***/
typedef union {
  byte Byte;
  struct {
    byte ATDPE0      :1;                                       /* ATD Pin Enable Bit 0 */
    byte ATDPE1      :1;                                       /* ATD Pin Enable Bit 1 */
    byte ATDPE2      :1;                                       /* ATD Pin Enable Bit 2 */
    byte ATDPE3      :1;                                       /* ATD Pin Enable Bit 3 */
    byte ATDPE4      :1;                                       /* ATD Pin Enable Bit 4 */
    byte ATDPE5      :1;                                       /* ATD Pin Enable Bit 5 */
    byte ATDPE6      :1;                                       /* ATD Pin Enable Bit 6 */
    byte ATDPE7      :1;                                       /* ATD Pin Enable Bit 7 */
  } Bits;
  struct {
    byte grpATDPE :8;
  } MergedBits;
} ATD1PESTR;
extern volatile ATD1PESTR _ATD1PE @0x00000054;
#define ATD1PE _ATD1PE.Byte
#define ATD1PE_ATDPE0 _ATD1PE.Bits.ATDPE0
#define ATD1PE_ATDPE1 _ATD1PE.Bits.ATDPE1
#define ATD1PE_ATDPE2 _ATD1PE.Bits.ATDPE2
#define ATD1PE_ATDPE3 _ATD1PE.Bits.ATDPE3
#define ATD1PE_ATDPE4 _ATD1PE.Bits.ATDPE4
#define ATD1PE_ATDPE5 _ATD1PE.Bits.ATDPE5
#define ATD1PE_ATDPE6 _ATD1PE.Bits.ATDPE6
#define ATD1PE_ATDPE7 _ATD1PE.Bits.ATDPE7
#define ATD1PE_ATDPE _ATD1PE.MergedBits.grpATDPE

#define ATD1PE_ATDPE0_MASK   1
#define ATD1PE_ATDPE0_BITNUM 0
#define ATD1PE_ATDPE1_MASK   2
#define ATD1PE_ATDPE1_BITNUM 1
#define ATD1PE_ATDPE2_MASK   4
#define ATD1PE_ATDPE2_BITNUM 2
#define ATD1PE_ATDPE3_MASK   8
#define ATD1PE_ATDPE3_BITNUM 3
#define ATD1PE_ATDPE4_MASK   16
#define ATD1PE_ATDPE4_BITNUM 4
#define ATD1PE_ATDPE5_MASK   32
#define ATD1PE_ATDPE5_BITNUM 5
#define ATD1PE_ATDPE6_MASK   64
#define ATD1PE_ATDPE6_BITNUM 6
#define ATD1PE_ATDPE7_MASK   128
#define ATD1PE_ATDPE7_BITNUM 7
#define ATD1PE_ATDPE_MASK  255
#define ATD1PE_ATDPE_BITNUM  0


/*** IIC1A - IIC1 Address Register; 0x00000058 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte ADDR0       :1;                                       /* IIC1 Address Bit 0 */
    byte ADDR1       :1;                                       /* IIC1 Address Bit 1 */
    byte ADDR2       :1;                                       /* IIC1 Address Bit 2 */
    byte ADDR3       :1;                                       /* IIC1 Address Bit 3 */
    byte ADDR4       :1;                                       /* IIC1 Address Bit 4 */
    byte ADDR5       :1;                                       /* IIC1 Address Bit 5 */
    byte ADDR6       :1;                                       /* IIC1 Address Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpADDR :7;
  } MergedBits;
} IIC1ASTR;
extern volatile IIC1ASTR _IIC1A @0x00000058;
#define IIC1A _IIC1A.Byte
#define IIC1A_ADDR0 _IIC1A.Bits.ADDR0
#define IIC1A_ADDR1 _IIC1A.Bits.ADDR1
#define IIC1A_ADDR2 _IIC1A.Bits.ADDR2
#define IIC1A_ADDR3 _IIC1A.Bits.ADDR3
#define IIC1A_ADDR4 _IIC1A.Bits.ADDR4
#define IIC1A_ADDR5 _IIC1A.Bits.ADDR5
#define IIC1A_ADDR6 _IIC1A.Bits.ADDR6
#define IIC1A_ADDR _IIC1A.MergedBits.grpADDR

#define IIC1A_ADDR0_MASK   2
#define IIC1A_ADDR0_BITNUM 1
#define IIC1A_ADDR1_MASK   4
#define IIC1A_ADDR1_BITNUM 2
#define IIC1A_ADDR2_MASK   8
#define IIC1A_ADDR2_BITNUM 3
#define IIC1A_ADDR3_MASK   16
#define IIC1A_ADDR3_BITNUM 4
#define IIC1A_ADDR4_MASK   32
#define IIC1A_ADDR4_BITNUM 5
#define IIC1A_ADDR5_MASK   64
#define IIC1A_ADDR5_BITNUM 6
#define IIC1A_ADDR6_MASK   128
#define IIC1A_ADDR6_BITNUM 7
#define IIC1A_ADDR_MASK  254
#define IIC1A_ADDR_BITNUM  1


/*** IIC1F - IIC1 Frequency Divider Register; 0x00000059 ***/
typedef union {
  byte Byte;
  struct {
    byte ICR0        :1;                                       /* IIC1 Clock Rate Bit 0 */
    byte ICR1        :1;                                       /* IIC1 Clock Rate Bit 1 */
    byte ICR2        :1;                                       /* IIC1 Clock Rate Bit 2 */
    byte ICR3        :1;                                       /* IIC1 Clock Rate Bit 3 */
    byte ICR4        :1;                                       /* IIC1 Clock Rate Bit 4 */
    byte ICR5        :1;                                       /* IIC1 Clock Rate Bit 5 */
    byte MULT0       :1;                                       /* Multiplier Factor Bit 0 */
    byte MULT1       :1;                                       /* Multiplier Factor Bit 1 */
  } Bits;
  struct {
    byte grpICR  :6;
    byte grpMULT :2;
  } MergedBits;
} IIC1FSTR;
extern volatile IIC1FSTR _IIC1F @0x00000059;
#define IIC1F _IIC1F.Byte
#define IIC1F_ICR0 _IIC1F.Bits.ICR0
#define IIC1F_ICR1 _IIC1F.Bits.ICR1
#define IIC1F_ICR2 _IIC1F.Bits.ICR2
#define IIC1F_ICR3 _IIC1F.Bits.ICR3
#define IIC1F_ICR4 _IIC1F.Bits.ICR4
#define IIC1F_ICR5 _IIC1F.Bits.ICR5
#define IIC1F_MULT0 _IIC1F.Bits.MULT0
#define IIC1F_MULT1 _IIC1F.Bits.MULT1
#define IIC1F_ICR _IIC1F.MergedBits.grpICR
#define IIC1F_MULT _IIC1F.MergedBits.grpMULT

#define IIC1F_ICR0_MASK   1
#define IIC1F_ICR0_BITNUM 0
#define IIC1F_ICR1_MASK   2
#define IIC1F_ICR1_BITNUM 1
#define IIC1F_ICR2_MASK   4
#define IIC1F_ICR2_BITNUM 2
#define IIC1F_ICR3_MASK   8
#define IIC1F_ICR3_BITNUM 3
#define IIC1F_ICR4_MASK   16
#define IIC1F_ICR4_BITNUM 4
#define IIC1F_ICR5_MASK   32
#define IIC1F_ICR5_BITNUM 5
#define IIC1F_MULT0_MASK   64
#define IIC1F_MULT0_BITNUM 6
#define IIC1F_MULT1_MASK   128
#define IIC1F_MULT1_BITNUM 7
#define IIC1F_ICR_MASK  63
#define IIC1F_ICR_BITNUM  0
#define IIC1F_MULT_MASK  192
#define IIC1F_MULT_BITNUM  6


/*** IIC1C - IIC1 Control Register; 0x0000005A ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte RSTA        :1;                                       /* Repeat START Bit */
    byte TXAK        :1;                                       /* Transmit Acknowledge Enable Bit */
    byte TX          :1;                                       /* Transmit Mode Select Bit */
    byte MST         :1;                                       /* Master Mode Select Bit */
    byte IIC1IE      :1;                                       /* IIC1 Interrupt Enable Bit */
    byte IIC1EN      :1;                                       /* IIC1 Enable Bit */
  } Bits;
} IIC1CSTR;
extern volatile IIC1CSTR _IIC1C @0x0000005A;
#define IIC1C _IIC1C.Byte
#define IIC1C_RSTA _IIC1C.Bits.RSTA
#define IIC1C_TXAK _IIC1C.Bits.TXAK
#define IIC1C_TX _IIC1C.Bits.TX
#define IIC1C_MST _IIC1C.Bits.MST
#define IIC1C_IIC1IE _IIC1C.Bits.IIC1IE
#define IIC1C_IIC1EN _IIC1C.Bits.IIC1EN

#define IIC1C_RSTA_MASK   4
#define IIC1C_RSTA_BITNUM 2
#define IIC1C_TXAK_MASK   8
#define IIC1C_TXAK_BITNUM 3
#define IIC1C_TX_MASK   16
#define IIC1C_TX_BITNUM 4
#define IIC1C_MST_MASK   32
#define IIC1C_MST_BITNUM 5
#define IIC1C_IIC1IE_MASK   64
#define IIC1C_IIC1IE_BITNUM 6
#define IIC1C_IIC1EN_MASK   128
#define IIC1C_IIC1EN_BITNUM 7


/*** IIC1S - IIC1 Status Register; 0x0000005B ***/
typedef union {
  byte Byte;
  struct {
    byte RXAK        :1;                                       /* Receive Acknowledge */
    byte IIC1IF      :1;                                       /* IIC1 Interrupt Flag */
    byte SRW         :1;                                       /* Slave Read/Write */
    byte             :1;
    byte ARBL        :1;                                       /* Arbitration Lost */
    byte BUSY        :1;                                       /* Bus Busy bit */
    byte IAAS        :1;                                       /* Addressed as a Slave Bit */
    byte TCF         :1;                                       /* Transfer Complete Flag */
  } Bits;
} IIC1SSTR;
extern volatile IIC1SSTR _IIC1S @0x0000005B;
#define IIC1S _IIC1S.Byte
#define IIC1S_RXAK _IIC1S.Bits.RXAK
#define IIC1S_IIC1IF _IIC1S.Bits.IIC1IF
#define IIC1S_SRW _IIC1S.Bits.SRW
#define IIC1S_ARBL _IIC1S.Bits.ARBL
#define IIC1S_BUSY _IIC1S.Bits.BUSY
#define IIC1S_IAAS _IIC1S.Bits.IAAS
#define IIC1S_TCF _IIC1S.Bits.TCF

#define IIC1S_RXAK_MASK   1
#define IIC1S_RXAK_BITNUM 0
#define IIC1S_IIC1IF_MASK   2
#define IIC1S_IIC1IF_BITNUM 1
#define IIC1S_SRW_MASK   4
#define IIC1S_SRW_BITNUM 2
#define IIC1S_ARBL_MASK   16
#define IIC1S_ARBL_BITNUM 4
#define IIC1S_BUSY_MASK   32
#define IIC1S_BUSY_BITNUM 5
#define IIC1S_IAAS_MASK   64
#define IIC1S_IAAS_BITNUM 6
#define IIC1S_TCF_MASK   128
#define IIC1S_TCF_BITNUM 7


/*** IIC1D - IIC1 Data I/O Register; 0x0000005C ***/
typedef union {
  byte Byte;
  struct {
    byte DATA0       :1;                                       /* IIC1 Data Bit 0 */
    byte DATA1       :1;                                       /* IIC1 Data Bit 1 */
    byte DATA2       :1;                                       /* IIC1 Data Bit 2 */
    byte DATA3       :1;                                       /* IIC1 Data Bit 3 */
    byte DATA4       :1;                                       /* IIC1 Data Bit 4 */
    byte DATA5       :1;                                       /* IIC1 Data Bit 5 */
    byte DATA6       :1;                                       /* IIC1 Data Bit 6 */
    byte DATA7       :1;                                       /* IIC1 Data Bit 7 */
  } Bits;
  struct {
    byte grpDATA :8;
  } MergedBits;
} IIC1DSTR;
extern volatile IIC1DSTR _IIC1D @0x0000005C;
#define IIC1D _IIC1D.Byte
#define IIC1D_DATA0 _IIC1D.Bits.DATA0
#define IIC1D_DATA1 _IIC1D.Bits.DATA1
#define IIC1D_DATA2 _IIC1D.Bits.DATA2
#define IIC1D_DATA3 _IIC1D.Bits.DATA3
#define IIC1D_DATA4 _IIC1D.Bits.DATA4
#define IIC1D_DATA5 _IIC1D.Bits.DATA5
#define IIC1D_DATA6 _IIC1D.Bits.DATA6
#define IIC1D_DATA7 _IIC1D.Bits.DATA7
#define IIC1D_DATA _IIC1D.MergedBits.grpDATA

