AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
#define IIC1D_DATA0_MASK   1
#define IIC1D_DATA0_BITNUM 0
#define IIC1D_DATA1_MASK   2
#define IIC1D_DATA1_BITNUM 1
#define IIC1D_DATA2_MASK   4
#define IIC1D_DATA2_BITNUM 2
#define IIC1D_DATA3_MASK   8
#define IIC1D_DATA3_BITNUM 3
#define IIC1D_DATA4_MASK   16
#define IIC1D_DATA4_BITNUM 4
#define IIC1D_DATA5_MASK   32
#define IIC1D_DATA5_BITNUM 5
#define IIC1D_DATA6_MASK   64
#define IIC1D_DATA6_BITNUM 6
#define IIC1D_DATA7_MASK   128
#define IIC1D_DATA7_BITNUM 7
#define IIC1D_DATA_MASK  255
#define IIC1D_DATA_BITNUM  0


/*** TPM2SC - TPM 2 Status and Control Register; 0x00000060 ***/
typedef union {
  byte Byte;
  struct {
    byte PS0         :1;                                       /* Prescale Divisor Select Bit 0 */
    byte PS1         :1;                                       /* Prescale Divisor Select Bit 1 */
    byte PS2         :1;                                       /* Prescale Divisor Select Bit 2 */
    byte CLKSA       :1;                                       /* Clock Source Select A */
    byte CLKSB       :1;                                       /* Clock Source Select B */
    byte CPWMS       :1;                                       /* Center-Aligned PWM Select */
    byte TOIE        :1;                                       /* Timer Overflow Interrupt Enable */
    byte TOF         :1;                                       /* Timer Overflow Flag */
  } Bits;
  struct {
    byte grpPS   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM2SCSTR;
extern volatile TPM2SCSTR _TPM2SC @0x00000060;
#define TPM2SC _TPM2SC.Byte
#define TPM2SC_PS0 _TPM2SC.Bits.PS0
#define TPM2SC_PS1 _TPM2SC.Bits.PS1
#define TPM2SC_PS2 _TPM2SC.Bits.PS2
#define TPM2SC_CLKSA _TPM2SC.Bits.CLKSA
#define TPM2SC_CLKSB _TPM2SC.Bits.CLKSB
#define TPM2SC_CPWMS _TPM2SC.Bits.CPWMS
#define TPM2SC_TOIE _TPM2SC.Bits.TOIE
#define TPM2SC_TOF _TPM2SC.Bits.TOF
#define TPM2SC_PS _TPM2SC.MergedBits.grpPS

#define TPM2SC_PS0_MASK   1
#define TPM2SC_PS0_BITNUM 0
#define TPM2SC_PS1_MASK   2
#define TPM2SC_PS1_BITNUM 1
#define TPM2SC_PS2_MASK   4
#define TPM2SC_PS2_BITNUM 2
#define TPM2SC_CLKSA_MASK   8
#define TPM2SC_CLKSA_BITNUM 3
#define TPM2SC_CLKSB_MASK   16
#define TPM2SC_CLKSB_BITNUM 4
#define TPM2SC_CPWMS_MASK   32
#define TPM2SC_CPWMS_BITNUM 5
#define TPM2SC_TOIE_MASK   64
#define TPM2SC_TOIE_BITNUM 6
#define TPM2SC_TOF_MASK   128
#define TPM2SC_TOF_BITNUM 7
#define TPM2SC_PS_MASK  7
#define TPM2SC_PS_BITNUM  0


/*** TPM2CNT - TPM 2 Counter Register; 0x00000061 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM2CNTH - TPM 2 Counter Register High; 0x00000061 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* TPM Counter Bit 8 */
        byte BIT9        :1;                                       /* TPM Counter Bit 9 */
        byte BIT10       :1;                                       /* TPM Counter Bit 10 */
        byte BIT11       :1;                                       /* TPM Counter Bit 11 */
        byte BIT12       :1;                                       /* TPM Counter Bit 12 */
        byte BIT13       :1;                                       /* TPM Counter Bit 13 */
        byte BIT14       :1;                                       /* TPM Counter Bit 14 */
        byte BIT15       :1;                                       /* TPM Counter Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } TPM2CNTHSTR;
    #define TPM2CNTH _TPM2CNT.Overlap_STR.TPM2CNTHSTR.Byte
    #define TPM2CNTH_BIT8 _TPM2CNT.Overlap_STR.TPM2CNTHSTR.Bits.BIT8
    #define TPM2CNTH_BIT9 _TPM2CNT.Overlap_STR.TPM2CNTHSTR.Bits.BIT9
    #define TPM2CNTH_BIT10 _TPM2CNT.Overlap_STR.TPM2CNTHSTR.Bits.BIT10
    #define TPM2CNTH_BIT11 _TPM2CNT.Overlap_STR.TPM2CNTHSTR.Bits.BIT11
    #define TPM2CNTH_BIT12 _TPM2CNT.Overlap_STR.TPM2CNTHSTR.Bits.BIT12
    #define TPM2CNTH_BIT13 _TPM2CNT.Overlap_STR.TPM2CNTHSTR.Bits.BIT13
    #define TPM2CNTH_BIT14 _TPM2CNT.Overlap_STR.TPM2CNTHSTR.Bits.BIT14
    #define TPM2CNTH_BIT15 _TPM2CNT.Overlap_STR.TPM2CNTHSTR.Bits.BIT15

    #define TPM2CNTH_BIT_8 _TPM2CNT.Overlap_STR.TPM2CNTHSTR.MergedBits.grpBIT_8
    #define TPM2CNTH_BIT TPM2CNTH_BIT_8

    #define TPM2CNTH_BIT8_MASK   1
    #define TPM2CNTH_BIT8_BITNUM 0
    #define TPM2CNTH_BIT9_MASK   2
    #define TPM2CNTH_BIT9_BITNUM 1
    #define TPM2CNTH_BIT10_MASK   4
    #define TPM2CNTH_BIT10_BITNUM 2
    #define TPM2CNTH_BIT11_MASK   8
    #define TPM2CNTH_BIT11_BITNUM 3
    #define TPM2CNTH_BIT12_MASK   16
    #define TPM2CNTH_BIT12_BITNUM 4
    #define TPM2CNTH_BIT13_MASK   32
    #define TPM2CNTH_BIT13_BITNUM 5
    #define TPM2CNTH_BIT14_MASK   64
    #define TPM2CNTH_BIT14_BITNUM 6
    #define TPM2CNTH_BIT15_MASK   128
    #define TPM2CNTH_BIT15_BITNUM 7
    #define TPM2CNTH_BIT_8_MASK  255
    #define TPM2CNTH_BIT_8_BITNUM  0


    /*** TPM2CNTL - TPM 2 Counter Register Low; 0x00000062 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* TPM Counter Bit 0 */
        byte BIT1        :1;                                       /* TPM Counter Bit 1 */
        byte BIT2        :1;                                       /* TPM Counter Bit 2 */
        byte BIT3        :1;                                       /* TPM Counter Bit 3 */
        byte BIT4        :1;                                       /* TPM Counter Bit 4 */
        byte BIT5        :1;                                       /* TPM Counter Bit 5 */
        byte BIT6        :1;                                       /* TPM Counter Bit 6 */
        byte BIT7        :1;                                       /* TPM Counter Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TPM2CNTLSTR;
    #define TPM2CNTL _TPM2CNT.Overlap_STR.TPM2CNTLSTR.Byte
    #define TPM2CNTL_BIT0 _TPM2CNT.Overlap_STR.TPM2CNTLSTR.Bits.BIT0
    #define TPM2CNTL_BIT1 _TPM2CNT.Overlap_STR.TPM2CNTLSTR.Bits.BIT1
    #define TPM2CNTL_BIT2 _TPM2CNT.Overlap_STR.TPM2CNTLSTR.Bits.BIT2
    #define TPM2CNTL_BIT3 _TPM2CNT.Overlap_STR.TPM2CNTLSTR.Bits.BIT3
    #define TPM2CNTL_BIT4 _TPM2CNT.Overlap_STR.TPM2CNTLSTR.Bits.BIT4
    #define TPM2CNTL_BIT5 _TPM2CNT.Overlap_STR.TPM2CNTLSTR.Bits.BIT5
    #define TPM2CNTL_BIT6 _TPM2CNT.Overlap_STR.TPM2CNTLSTR.Bits.BIT6
    #define TPM2CNTL_BIT7 _TPM2CNT.Overlap_STR.TPM2CNTLSTR.Bits.BIT7

    #define TPM2CNTL_BIT _TPM2CNT.Overlap_STR.TPM2CNTLSTR.MergedBits.grpBIT

    #define TPM2CNTL_BIT0_MASK   1
    #define TPM2CNTL_BIT0_BITNUM 0
    #define TPM2CNTL_BIT1_MASK   2
    #define TPM2CNTL_BIT1_BITNUM 1
    #define TPM2CNTL_BIT2_MASK   4
    #define TPM2CNTL_BIT2_BITNUM 2
    #define TPM2CNTL_BIT3_MASK   8
    #define TPM2CNTL_BIT3_BITNUM 3
    #define TPM2CNTL_BIT4_MASK   16
    #define TPM2CNTL_BIT4_BITNUM 4
    #define TPM2CNTL_BIT5_MASK   32
    #define TPM2CNTL_BIT5_BITNUM 5
    #define TPM2CNTL_BIT6_MASK   64
    #define TPM2CNTL_BIT6_BITNUM 6
    #define TPM2CNTL_BIT7_MASK   128
    #define TPM2CNTL_BIT7_BITNUM 7
    #define TPM2CNTL_BIT_MASK  255
    #define TPM2CNTL_BIT_BITNUM  0

  } Overlap_STR;

