AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
  struct {
    word grpBIT  :16;
  } MergedBits;
} TPM2CNTSTR;
extern volatile TPM2CNTSTR _TPM2CNT @0x00000061;
#define TPM2CNT _TPM2CNT.Word
#define TPM2CNT_BIT _TPM2CNT.MergedBits.grpBIT

#define TPM2CNT_BIT_MASK  65535
#define TPM2CNT_BIT_BITNUM  0


/*** TPM2MOD - TPM 2 Timer Counter Modulo Register; 0x00000063 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM2MODH - TPM 2 Timer Counter Modulo Register High; 0x00000063 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Timer Counter Modulo Bit 8 */
        byte BIT9        :1;                                       /* Timer Counter Modulo Bit 9 */
        byte BIT10       :1;                                       /* Timer Counter Modulo Bit 10 */
        byte BIT11       :1;                                       /* Timer Counter Modulo Bit 11 */
        byte BIT12       :1;                                       /* Timer Counter Modulo Bit 12 */
        byte BIT13       :1;                                       /* Timer Counter Modulo Bit 13 */
        byte BIT14       :1;                                       /* Timer Counter Modulo Bit 14 */
        byte BIT15       :1;                                       /* Timer Counter Modulo Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } TPM2MODHSTR;
    #define TPM2MODH _TPM2MOD.Overlap_STR.TPM2MODHSTR.Byte
    #define TPM2MODH_BIT8 _TPM2MOD.Overlap_STR.TPM2MODHSTR.Bits.BIT8
    #define TPM2MODH_BIT9 _TPM2MOD.Overlap_STR.TPM2MODHSTR.Bits.BIT9
    #define TPM2MODH_BIT10 _TPM2MOD.Overlap_STR.TPM2MODHSTR.Bits.BIT10
    #define TPM2MODH_BIT11 _TPM2MOD.Overlap_STR.TPM2MODHSTR.Bits.BIT11
    #define TPM2MODH_BIT12 _TPM2MOD.Overlap_STR.TPM2MODHSTR.Bits.BIT12
    #define TPM2MODH_BIT13 _TPM2MOD.Overlap_STR.TPM2MODHSTR.Bits.BIT13
    #define TPM2MODH_BIT14 _TPM2MOD.Overlap_STR.TPM2MODHSTR.Bits.BIT14
    #define TPM2MODH_BIT15 _TPM2MOD.Overlap_STR.TPM2MODHSTR.Bits.BIT15

    #define TPM2MODH_BIT_8 _TPM2MOD.Overlap_STR.TPM2MODHSTR.MergedBits.grpBIT_8
    #define TPM2MODH_BIT TPM2MODH_BIT_8

    #define TPM2MODH_BIT8_MASK   1
    #define TPM2MODH_BIT8_BITNUM 0
    #define TPM2MODH_BIT9_MASK   2
    #define TPM2MODH_BIT9_BITNUM 1
    #define TPM2MODH_BIT10_MASK   4
    #define TPM2MODH_BIT10_BITNUM 2
    #define TPM2MODH_BIT11_MASK   8
    #define TPM2MODH_BIT11_BITNUM 3
    #define TPM2MODH_BIT12_MASK   16
    #define TPM2MODH_BIT12_BITNUM 4
    #define TPM2MODH_BIT13_MASK   32
    #define TPM2MODH_BIT13_BITNUM 5
    #define TPM2MODH_BIT14_MASK   64
    #define TPM2MODH_BIT14_BITNUM 6
    #define TPM2MODH_BIT15_MASK   128
    #define TPM2MODH_BIT15_BITNUM 7
    #define TPM2MODH_BIT_8_MASK  255
    #define TPM2MODH_BIT_8_BITNUM  0


    /*** TPM2MODL - TPM 2 Timer Counter Modulo Register Low; 0x00000064 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Counter Modulo Bit 0 */
        byte BIT1        :1;                                       /* Timer Counter Modulo Bit 1 */
        byte BIT2        :1;                                       /* Timer Counter Modulo Bit 2 */
        byte BIT3        :1;                                       /* Timer Counter Modulo Bit 3 */
        byte BIT4        :1;                                       /* Timer Counter Modulo Bit 4 */
        byte BIT5        :1;                                       /* Timer Counter Modulo Bit 5 */
        byte BIT6        :1;                                       /* Timer Counter Modulo Bit 6 */
        byte BIT7        :1;                                       /* Timer Counter Modulo Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TPM2MODLSTR;
    #define TPM2MODL _TPM2MOD.Overlap_STR.TPM2MODLSTR.Byte
    #define TPM2MODL_BIT0 _TPM2MOD.Overlap_STR.TPM2MODLSTR.Bits.BIT0
    #define TPM2MODL_BIT1 _TPM2MOD.Overlap_STR.TPM2MODLSTR.Bits.BIT1
    #define TPM2MODL_BIT2 _TPM2MOD.Overlap_STR.TPM2MODLSTR.Bits.BIT2
    #define TPM2MODL_BIT3 _TPM2MOD.Overlap_STR.TPM2MODLSTR.Bits.BIT3
    #define TPM2MODL_BIT4 _TPM2MOD.Overlap_STR.TPM2MODLSTR.Bits.BIT4
    #define TPM2MODL_BIT5 _TPM2MOD.Overlap_STR.TPM2MODLSTR.Bits.BIT5
    #define TPM2MODL_BIT6 _TPM2MOD.Overlap_STR.TPM2MODLSTR.Bits.BIT6
    #define TPM2MODL_BIT7 _TPM2MOD.Overlap_STR.TPM2MODLSTR.Bits.BIT7

    #define TPM2MODL_BIT _TPM2MOD.Overlap_STR.TPM2MODLSTR.MergedBits.grpBIT

    #define TPM2MODL_BIT0_MASK   1
    #define TPM2MODL_BIT0_BITNUM 0
    #define TPM2MODL_BIT1_MASK   2
    #define TPM2MODL_BIT1_BITNUM 1
    #define TPM2MODL_BIT2_MASK   4
    #define TPM2MODL_BIT2_BITNUM 2
    #define TPM2MODL_BIT3_MASK   8
    #define TPM2MODL_BIT3_BITNUM 3
    #define TPM2MODL_BIT4_MASK   16
    #define TPM2MODL_BIT4_BITNUM 4
    #define TPM2MODL_BIT5_MASK   32
    #define TPM2MODL_BIT5_BITNUM 5
    #define TPM2MODL_BIT6_MASK   64
    #define TPM2MODL_BIT6_BITNUM 6
    #define TPM2MODL_BIT7_MASK   128
    #define TPM2MODL_BIT7_BITNUM 7
    #define TPM2MODL_BIT_MASK  255
    #define TPM2MODL_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} TPM2MODSTR;
extern volatile TPM2MODSTR _TPM2MOD @0x00000063;
#define TPM2MOD _TPM2MOD.Word
#define TPM2MOD_BIT _TPM2MOD.MergedBits.grpBIT

#define TPM2MOD_BIT_MASK  65535
#define TPM2MOD_BIT_BITNUM  0


/*** TPM2C0SC - TPM 2 Timer Channel 0 Status and Control Register; 0x00000065 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte ELS0A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS0B       :1;                                       /* Edge/Level Select Bit B */
    byte MS0A        :1;                                       /* Mode Select A for TPM Channel 0 */
    byte MS0B        :1;                                       /* Mode Select B for TPM Channel 0 */
    byte CH0IE       :1;                                       /* Channel 0 Interrupt Enable */
    byte CH0F        :1;                                       /* Channel 0 Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpELS0x :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM2C0SCSTR;
extern volatile TPM2C0SCSTR _TPM2C0SC @0x00000065;
#define TPM2C0SC _TPM2C0SC.Byte
#define TPM2C0SC_ELS0A _TPM2C0SC.Bits.ELS0A
#define TPM2C0SC_ELS0B _TPM2C0SC.Bits.ELS0B
#define TPM2C0SC_MS0A _TPM2C0SC.Bits.MS0A
#define TPM2C0SC_MS0B _TPM2C0SC.Bits.MS0B
#define TPM2C0SC_CH0IE _TPM2C0SC.Bits.CH0IE
#define TPM2C0SC_CH0F _TPM2C0SC.Bits.CH0F
#define TPM2C0SC_ELS0x _TPM2C0SC.MergedBits.grpELS0x

#define TPM2C0SC_ELS0A_MASK   4
#define TPM2C0SC_ELS0A_BITNUM 2
#define TPM2C0SC_ELS0B_MASK   8
#define TPM2C0SC_ELS0B_BITNUM 3
#define TPM2C0SC_MS0A_MASK   16
#define TPM2C0SC_MS0A_BITNUM 4
#define TPM2C0SC_MS0B_MASK   32
#define TPM2C0SC_MS0B_BITNUM 5
#define TPM2C0SC_CH0IE_MASK   64
#define TPM2C0SC_CH0IE_BITNUM 6
#define TPM2C0SC_CH0F_MASK   128
#define TPM2C0SC_CH0F_BITNUM 7
#define TPM2C0SC_ELS0x_MASK  12
#define TPM2C0SC_ELS0x_BITNUM  2


/*** TPM2C0V - TPM 2 Timer Channel 0 Value Register; 0x00000066 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM2C0VH - TPM 2 Timer Channel 0 Value Register High; 0x00000066 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Timer Channel 0 Value Bit 8 */
        byte BIT9        :1;                                       /* Timer Channel 0 Value Bit 9 */
        byte BIT10       :1;                                       /* Timer Channel 0 Value Bit 10 */
        byte BIT11       :1;                                       /* Timer Channel 0 Value Bit 11 */
        byte BIT12       :1;                                       /* Timer Channel 0 Value Bit 12 */
        byte BIT13       :1;                                       /* Timer Channel 0 Value Bit 13 */
        byte BIT14       :1;                                       /* Timer Channel 0 Value Bit 14 */
        byte BIT15       :1;                                       /* Timer Channel 0 Value Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } TPM2C0VHSTR;
    #define TPM2C0VH _TPM2C0V.Overlap_STR.TPM2C0VHSTR.Byte
    #define TPM2C0VH_BIT8 _TPM2C0V.Overlap_STR.TPM2C0VHSTR.Bits.BIT8
    #define TPM2C0VH_BIT9 _TPM2C0V.Overlap_STR.TPM2C0VHSTR.Bits.BIT9
    #define TPM2C0VH_BIT10 _TPM2C0V.Overlap_STR.TPM2C0VHSTR.Bits.BIT10
    #define TPM2C0VH_BIT11 _TPM2C0V.Overlap_STR.TPM2C0VHSTR.Bits.BIT11
    #define TPM2C0VH_BIT12 _TPM2C0V.Overlap_STR.TPM2C0VHSTR.Bits.BIT12
    #define TPM2C0VH_BIT13 _TPM2C0V.Overlap_STR.TPM2C0VHSTR.Bits.BIT13
    #define TPM2C0VH_BIT14 _TPM2C0V.Overlap_STR.TPM2C0VHSTR.Bits.BIT14
    #define TPM2C0VH_BIT15 _TPM2C0V.Overlap_STR.TPM2C0VHSTR.Bits.BIT15

    #define TPM2C0VH_BIT_8 _TPM2C0V.Overlap_STR.TPM2C0VHSTR.MergedBits.grpBIT_8
    #define TPM2C0VH_BIT TPM2C0VH_BIT_8

    #define TPM2C0VH_BIT8_MASK   1
    #define TPM2C0VH_BIT8_BITNUM 0
    #define TPM2C0VH_BIT9_MASK   2
    #define TPM2C0VH_BIT9_BITNUM 1
    #define TPM2C0VH_BIT10_MASK   4
    #define TPM2C0VH_BIT10_BITNUM 2
    #define TPM2C0VH_BIT11_MASK   8
    #define TPM2C0VH_BIT11_BITNUM 3
    #define TPM2C0VH_BIT12_MASK   16
    #define TPM2C0VH_BIT12_BITNUM 4
    #define TPM2C0VH_BIT13_MASK   32
    #define TPM2C0VH_BIT13_BITNUM 5
    #define TPM2C0VH_BIT14_MASK   64
    #define TPM2C0VH_BIT14_BITNUM 6
    #define TPM2C0VH_BIT15_MASK   128
    #define TPM2C0VH_BIT15_BITNUM 7
    #define TPM2C0VH_BIT_8_MASK  255
    #define TPM2C0VH_BIT_8_BITNUM  0


    /*** TPM2C0VL - TPM 2 Timer Channel 0 Value Register Low; 0x00000067 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Channel 0 Value Bit 0 */
        byte BIT1        :1;                                       /* Timer Channel 0 Value Bit 1 */
        byte BIT2        :1;                                       /* Timer Channel 0 Value Bit 2 */
        byte BIT3        :1;                                       /* Timer Channel 0 Value Bit 3 */
        byte BIT4        :1;                                       /* Timer Channel 0 Value Bit 4 */
        byte BIT5        :1;                                       /* Timer Channel 0 Value Bit 5 */
        byte BIT6        :1;                                       /* Timer Channel 0 Value Bit 6 */
        byte BIT7        :1;                                       /* Timer Channel 0 Value Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TPM2C0VLSTR;
    #define TPM2C0VL _TPM2C0V.Overlap_STR.TPM2C0VLSTR.Byte
    #define TPM2C0VL_BIT0 _TPM2C0V.Overlap_STR.TPM2C0VLSTR.Bits.BIT0
    #define TPM2C0VL_BIT1 _TPM2C0V.Overlap_STR.TPM2C0VLSTR.Bits.BIT1
    #define TPM2C0VL_BIT2 _TPM2C0V.Overlap_STR.TPM2C0VLSTR.Bits.BIT2
    #define TPM2C0VL_BIT3 _TPM2C0V.Overlap_STR.TPM2C0VLSTR.Bits.BIT3
    #define TPM2C0VL_BIT4 _TPM2C0V.Overlap_STR.TPM2C0VLSTR.Bits.BIT4
    #define TPM2C0VL_BIT5 _TPM2C0V.Overlap_STR.TPM2C0VLSTR.Bits.BIT5
    #define TPM2C0VL_BIT6 _TPM2C0V.Overlap_STR.TPM2C0VLSTR.Bits.BIT6
    #define TPM2C0VL_BIT7 _TPM2C0V.Overlap_STR.TPM2C0VLSTR.Bits.BIT7

    #define TPM2C0VL_BIT _TPM2C0V.Overlap_STR.TPM2C0VLSTR.MergedBits.grpBIT

    #define TPM2C0VL_BIT0_MASK   1
    #define TPM2C0VL_BIT0_BITNUM 0
    #define TPM2C0VL_BIT1_MASK   2
    #define TPM2C0VL_BIT1_BITNUM 1
    #define TPM2C0VL_BIT2_MASK   4
    #define TPM2C0VL_BIT2_BITNUM 2
    #define TPM2C0VL_BIT3_MASK   8
    #define TPM2C0VL_BIT3_BITNUM 3
    #define TPM2C0VL_BIT4_MASK   16
    #define TPM2C0VL_BIT4_BITNUM 4
    #define TPM2C0VL_BIT5_MASK   32
    #define TPM2C0VL_BIT5_BITNUM 5
    #define TPM2C0VL_BIT6_MASK   64
    #define TPM2C0VL_BIT6_BITNUM 6
    #define TPM2C0VL_BIT7_MASK   128
    #define TPM2C0VL_BIT7_BITNUM 7
    #define TPM2C0VL_BIT_MASK  255
    #define TPM2C0VL_BIT_BITNUM  0

  } Overlap_STR;

