AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
    #define TPM2C2VL_BIT _TPM2C2V.Overlap_STR.TPM2C2VLSTR.MergedBits.grpBIT

    #define TPM2C2VL_BIT0_MASK   1
    #define TPM2C2VL_BIT0_BITNUM 0
    #define TPM2C2VL_BIT1_MASK   2
    #define TPM2C2VL_BIT1_BITNUM 1
    #define TPM2C2VL_BIT2_MASK   4
    #define TPM2C2VL_BIT2_BITNUM 2
    #define TPM2C2VL_BIT3_MASK   8
    #define TPM2C2VL_BIT3_BITNUM 3
    #define TPM2C2VL_BIT4_MASK   16
    #define TPM2C2VL_BIT4_BITNUM 4
    #define TPM2C2VL_BIT5_MASK   32
    #define TPM2C2VL_BIT5_BITNUM 5
    #define TPM2C2VL_BIT6_MASK   64
    #define TPM2C2VL_BIT6_BITNUM 6
    #define TPM2C2VL_BIT7_MASK   128
    #define TPM2C2VL_BIT7_BITNUM 7
    #define TPM2C2VL_BIT_MASK  255
    #define TPM2C2VL_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} TPM2C2VSTR;
extern volatile TPM2C2VSTR _TPM2C2V @0x0000006C;
#define TPM2C2V _TPM2C2V.Word
#define TPM2C2V_BIT _TPM2C2V.MergedBits.grpBIT

#define TPM2C2V_BIT_MASK  65535
#define TPM2C2V_BIT_BITNUM  0


/*** TPM2C3SC - TPM 2 Timer Channel 3 Status and Control Register; 0x0000006E ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte ELS3A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS3B       :1;                                       /* Edge/Level Select Bit B */
    byte MS3A        :1;                                       /* Mode Select A for TPM Channel 3 */
    byte MS3B        :1;                                       /* Mode Select B for TPM Channel 3 */
    byte CH3IE       :1;                                       /* Channel 3 Interrupt Enable */
    byte CH3F        :1;                                       /* Channel 3 Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpELS3x :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM2C3SCSTR;
extern volatile TPM2C3SCSTR _TPM2C3SC @0x0000006E;
#define TPM2C3SC _TPM2C3SC.Byte
#define TPM2C3SC_ELS3A _TPM2C3SC.Bits.ELS3A
#define TPM2C3SC_ELS3B _TPM2C3SC.Bits.ELS3B
#define TPM2C3SC_MS3A _TPM2C3SC.Bits.MS3A
#define TPM2C3SC_MS3B _TPM2C3SC.Bits.MS3B
#define TPM2C3SC_CH3IE _TPM2C3SC.Bits.CH3IE
#define TPM2C3SC_CH3F _TPM2C3SC.Bits.CH3F
#define TPM2C3SC_ELS3x _TPM2C3SC.MergedBits.grpELS3x

#define TPM2C3SC_ELS3A_MASK   4
#define TPM2C3SC_ELS3A_BITNUM 2
#define TPM2C3SC_ELS3B_MASK   8
#define TPM2C3SC_ELS3B_BITNUM 3
#define TPM2C3SC_MS3A_MASK   16
#define TPM2C3SC_MS3A_BITNUM 4
#define TPM2C3SC_MS3B_MASK   32
#define TPM2C3SC_MS3B_BITNUM 5
#define TPM2C3SC_CH3IE_MASK   64
#define TPM2C3SC_CH3IE_BITNUM 6
#define TPM2C3SC_CH3F_MASK   128
#define TPM2C3SC_CH3F_BITNUM 7
#define TPM2C3SC_ELS3x_MASK  12
#define TPM2C3SC_ELS3x_BITNUM  2


/*** TPM2C3V - TPM 2 Timer Channel 3 Value Register; 0x0000006F ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM2C3VH - TPM 2 Timer Channel 3 Value Register High; 0x0000006F ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Timer Channel 3 Value Bit 8 */
        byte BIT9        :1;                                       /* Timer Channel 3 Value Bit 9 */
        byte BIT10       :1;                                       /* Timer Channel 3 Value Bit 10 */
        byte BIT11       :1;                                       /* Timer Channel 3 Value Bit 11 */
        byte BIT12       :1;                                       /* Timer Channel 3 Value Bit 12 */
        byte BIT13       :1;                                       /* Timer Channel 3 Value Bit 13 */
        byte BIT14       :1;                                       /* Timer Channel 3 Value Bit 14 */
        byte BIT15       :1;                                       /* Timer Channel 3 Value Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } TPM2C3VHSTR;
    #define TPM2C3VH _TPM2C3V.Overlap_STR.TPM2C3VHSTR.Byte
    #define TPM2C3VH_BIT8 _TPM2C3V.Overlap_STR.TPM2C3VHSTR.Bits.BIT8
    #define TPM2C3VH_BIT9 _TPM2C3V.Overlap_STR.TPM2C3VHSTR.Bits.BIT9
    #define TPM2C3VH_BIT10 _TPM2C3V.Overlap_STR.TPM2C3VHSTR.Bits.BIT10
    #define TPM2C3VH_BIT11 _TPM2C3V.Overlap_STR.TPM2C3VHSTR.Bits.BIT11
    #define TPM2C3VH_BIT12 _TPM2C3V.Overlap_STR.TPM2C3VHSTR.Bits.BIT12
    #define TPM2C3VH_BIT13 _TPM2C3V.Overlap_STR.TPM2C3VHSTR.Bits.BIT13
    #define TPM2C3VH_BIT14 _TPM2C3V.Overlap_STR.TPM2C3VHSTR.Bits.BIT14
    #define TPM2C3VH_BIT15 _TPM2C3V.Overlap_STR.TPM2C3VHSTR.Bits.BIT15

    #define TPM2C3VH_BIT_8 _TPM2C3V.Overlap_STR.TPM2C3VHSTR.MergedBits.grpBIT_8
    #define TPM2C3VH_BIT TPM2C3VH_BIT_8

    #define TPM2C3VH_BIT8_MASK   1
    #define TPM2C3VH_BIT8_BITNUM 0
    #define TPM2C3VH_BIT9_MASK   2
    #define TPM2C3VH_BIT9_BITNUM 1
    #define TPM2C3VH_BIT10_MASK   4
    #define TPM2C3VH_BIT10_BITNUM 2
    #define TPM2C3VH_BIT11_MASK   8
    #define TPM2C3VH_BIT11_BITNUM 3
    #define TPM2C3VH_BIT12_MASK   16
    #define TPM2C3VH_BIT12_BITNUM 4
    #define TPM2C3VH_BIT13_MASK   32
    #define TPM2C3VH_BIT13_BITNUM 5
    #define TPM2C3VH_BIT14_MASK   64
    #define TPM2C3VH_BIT14_BITNUM 6
    #define TPM2C3VH_BIT15_MASK   128
    #define TPM2C3VH_BIT15_BITNUM 7
    #define TPM2C3VH_BIT_8_MASK  255
    #define TPM2C3VH_BIT_8_BITNUM  0


    /*** TPM2C3VL - TPM 2 Timer Channel 3 Value Register Low; 0x00000070 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Channel 3 Value Bit 0 */
        byte BIT1        :1;                                       /* Timer Channel 3 Value Bit 1 */
        byte BIT2        :1;                                       /* Timer Channel 3 Value Bit 2 */
        byte BIT3        :1;                                       /* Timer Channel 3 Value Bit 3 */
        byte BIT4        :1;                                       /* Timer Channel 3 Value Bit 4 */
        byte BIT5        :1;                                       /* Timer Channel 3 Value Bit 5 */
        byte BIT6        :1;                                       /* Timer Channel 3 Value Bit 6 */
        byte BIT7        :1;                                       /* Timer Channel 3 Value Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TPM2C3VLSTR;
    #define TPM2C3VL _TPM2C3V.Overlap_STR.TPM2C3VLSTR.Byte
    #define TPM2C3VL_BIT0 _TPM2C3V.Overlap_STR.TPM2C3VLSTR.Bits.BIT0
    #define TPM2C3VL_BIT1 _TPM2C3V.Overlap_STR.TPM2C3VLSTR.Bits.BIT1
    #define TPM2C3VL_BIT2 _TPM2C3V.Overlap_STR.TPM2C3VLSTR.Bits.BIT2
    #define TPM2C3VL_BIT3 _TPM2C3V.Overlap_STR.TPM2C3VLSTR.Bits.BIT3
    #define TPM2C3VL_BIT4 _TPM2C3V.Overlap_STR.TPM2C3VLSTR.Bits.BIT4
    #define TPM2C3VL_BIT5 _TPM2C3V.Overlap_STR.TPM2C3VLSTR.Bits.BIT5
    #define TPM2C3VL_BIT6 _TPM2C3V.Overlap_STR.TPM2C3VLSTR.Bits.BIT6
    #define TPM2C3VL_BIT7 _TPM2C3V.Overlap_STR.TPM2C3VLSTR.Bits.BIT7

    #define TPM2C3VL_BIT _TPM2C3V.Overlap_STR.TPM2C3VLSTR.MergedBits.grpBIT

    #define TPM2C3VL_BIT0_MASK   1
    #define TPM2C3VL_BIT0_BITNUM 0
    #define TPM2C3VL_BIT1_MASK   2
    #define TPM2C3VL_BIT1_BITNUM 1
    #define TPM2C3VL_BIT2_MASK   4
    #define TPM2C3VL_BIT2_BITNUM 2
    #define TPM2C3VL_BIT3_MASK   8
    #define TPM2C3VL_BIT3_BITNUM 3
    #define TPM2C3VL_BIT4_MASK   16
    #define TPM2C3VL_BIT4_BITNUM 4
    #define TPM2C3VL_BIT5_MASK   32
    #define TPM2C3VL_BIT5_BITNUM 5
    #define TPM2C3VL_BIT6_MASK   64
    #define TPM2C3VL_BIT6_BITNUM 6
    #define TPM2C3VL_BIT7_MASK   128
    #define TPM2C3VL_BIT7_BITNUM 7
    #define TPM2C3VL_BIT_MASK  255
    #define TPM2C3VL_BIT_BITNUM  0

  } Overlap_STR;

