AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
  struct {
    word grpBIT  :16;
  } MergedBits;
} TPM2C3VSTR;
extern volatile TPM2C3VSTR _TPM2C3V @0x0000006F;
#define TPM2C3V _TPM2C3V.Word
#define TPM2C3V_BIT _TPM2C3V.MergedBits.grpBIT

#define TPM2C3V_BIT_MASK  65535
#define TPM2C3V_BIT_BITNUM  0


/*** TPM2C4SC - TPM 2 Timer Channel 4 Status and Control Register; 0x00000071 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte ELS4A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS4B       :1;                                       /* Edge/Level Select Bit B */
    byte MS4A        :1;                                       /* Mode Select A for TPM Channel 4 */
    byte MS4B        :1;                                       /* Mode Select B for TPM Channel 4 */
    byte CH4IE       :1;                                       /* Channel 4 Interrupt Enable */
    byte CH4F        :1;                                       /* Channel 4 Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpELS4x :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM2C4SCSTR;
extern volatile TPM2C4SCSTR _TPM2C4SC @0x00000071;
#define TPM2C4SC _TPM2C4SC.Byte
#define TPM2C4SC_ELS4A _TPM2C4SC.Bits.ELS4A
#define TPM2C4SC_ELS4B _TPM2C4SC.Bits.ELS4B
#define TPM2C4SC_MS4A _TPM2C4SC.Bits.MS4A
#define TPM2C4SC_MS4B _TPM2C4SC.Bits.MS4B
#define TPM2C4SC_CH4IE _TPM2C4SC.Bits.CH4IE
#define TPM2C4SC_CH4F _TPM2C4SC.Bits.CH4F
#define TPM2C4SC_ELS4x _TPM2C4SC.MergedBits.grpELS4x

#define TPM2C4SC_ELS4A_MASK   4
#define TPM2C4SC_ELS4A_BITNUM 2
#define TPM2C4SC_ELS4B_MASK   8
#define TPM2C4SC_ELS4B_BITNUM 3
#define TPM2C4SC_MS4A_MASK   16
#define TPM2C4SC_MS4A_BITNUM 4
#define TPM2C4SC_MS4B_MASK   32
#define TPM2C4SC_MS4B_BITNUM 5
#define TPM2C4SC_CH4IE_MASK   64
#define TPM2C4SC_CH4IE_BITNUM 6
#define TPM2C4SC_CH4F_MASK   128
#define TPM2C4SC_CH4F_BITNUM 7
#define TPM2C4SC_ELS4x_MASK  12
#define TPM2C4SC_ELS4x_BITNUM  2


/*** TPM2C4V - TPM 2 Timer Channel 4 Value Register; 0x00000072 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM2C4VH - TPM 2 Timer Channel 4 Value Register High; 0x00000072 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Timer Channel 4 Value Bit 8 */
        byte BIT9        :1;                                       /* Timer Channel 4 Value Bit 9 */
        byte BIT10       :1;                                       /* Timer Channel 4 Value Bit 10 */
        byte BIT11       :1;                                       /* Timer Channel 4 Value Bit 11 */
        byte BIT12       :1;                                       /* Timer Channel 4 Value Bit 12 */
        byte BIT13       :1;                                       /* Timer Channel 4 Value Bit 13 */
        byte BIT14       :1;                                       /* Timer Channel 4 Value Bit 14 */
        byte BIT15       :1;                                       /* Timer Channel 4 Value Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } TPM2C4VHSTR;
    #define TPM2C4VH _TPM2C4V.Overlap_STR.TPM2C4VHSTR.Byte
    #define TPM2C4VH_BIT8 _TPM2C4V.Overlap_STR.TPM2C4VHSTR.Bits.BIT8
    #define TPM2C4VH_BIT9 _TPM2C4V.Overlap_STR.TPM2C4VHSTR.Bits.BIT9
    #define TPM2C4VH_BIT10 _TPM2C4V.Overlap_STR.TPM2C4VHSTR.Bits.BIT10
    #define TPM2C4VH_BIT11 _TPM2C4V.Overlap_STR.TPM2C4VHSTR.Bits.BIT11
    #define TPM2C4VH_BIT12 _TPM2C4V.Overlap_STR.TPM2C4VHSTR.Bits.BIT12
    #define TPM2C4VH_BIT13 _TPM2C4V.Overlap_STR.TPM2C4VHSTR.Bits.BIT13
    #define TPM2C4VH_BIT14 _TPM2C4V.Overlap_STR.TPM2C4VHSTR.Bits.BIT14
    #define TPM2C4VH_BIT15 _TPM2C4V.Overlap_STR.TPM2C4VHSTR.Bits.BIT15

    #define TPM2C4VH_BIT_8 _TPM2C4V.Overlap_STR.TPM2C4VHSTR.MergedBits.grpBIT_8
    #define TPM2C4VH_BIT TPM2C4VH_BIT_8

    #define TPM2C4VH_BIT8_MASK   1
    #define TPM2C4VH_BIT8_BITNUM 0
    #define TPM2C4VH_BIT9_MASK   2
    #define TPM2C4VH_BIT9_BITNUM 1
    #define TPM2C4VH_BIT10_MASK   4
    #define TPM2C4VH_BIT10_BITNUM 2
    #define TPM2C4VH_BIT11_MASK   8
    #define TPM2C4VH_BIT11_BITNUM 3
    #define TPM2C4VH_BIT12_MASK   16
    #define TPM2C4VH_BIT12_BITNUM 4
    #define TPM2C4VH_BIT13_MASK   32
    #define TPM2C4VH_BIT13_BITNUM 5
    #define TPM2C4VH_BIT14_MASK   64
    #define TPM2C4VH_BIT14_BITNUM 6
    #define TPM2C4VH_BIT15_MASK   128
    #define TPM2C4VH_BIT15_BITNUM 7
    #define TPM2C4VH_BIT_8_MASK  255
    #define TPM2C4VH_BIT_8_BITNUM  0


    /*** TPM2C4VL - TPM 2 Timer Channel 4 Value Register Low; 0x00000073 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Timer Channel 4 Value Bit 0 */
        byte BIT1        :1;                                       /* Timer Channel 4 Value Bit 1 */
        byte BIT2        :1;                                       /* Timer Channel 4 Value Bit 2 */
        byte BIT3        :1;                                       /* Timer Channel 4 Value Bit 3 */
        byte BIT4        :1;                                       /* Timer Channel 4 Value Bit 4 */
        byte BIT5        :1;                                       /* Timer Channel 4 Value Bit 5 */
        byte BIT6        :1;                                       /* Timer Channel 4 Value Bit 6 */
        byte BIT7        :1;                                       /* Timer Channel 4 Value Bit 7 */
      } Bits;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } TPM2C4VLSTR;
    #define TPM2C4VL _TPM2C4V.Overlap_STR.TPM2C4VLSTR.Byte
    #define TPM2C4VL_BIT0 _TPM2C4V.Overlap_STR.TPM2C4VLSTR.Bits.BIT0
    #define TPM2C4VL_BIT1 _TPM2C4V.Overlap_STR.TPM2C4VLSTR.Bits.BIT1
    #define TPM2C4VL_BIT2 _TPM2C4V.Overlap_STR.TPM2C4VLSTR.Bits.BIT2
    #define TPM2C4VL_BIT3 _TPM2C4V.Overlap_STR.TPM2C4VLSTR.Bits.BIT3
    #define TPM2C4VL_BIT4 _TPM2C4V.Overlap_STR.TPM2C4VLSTR.Bits.BIT4
    #define TPM2C4VL_BIT5 _TPM2C4V.Overlap_STR.TPM2C4VLSTR.Bits.BIT5
    #define TPM2C4VL_BIT6 _TPM2C4V.Overlap_STR.TPM2C4VLSTR.Bits.BIT6
    #define TPM2C4VL_BIT7 _TPM2C4V.Overlap_STR.TPM2C4VLSTR.Bits.BIT7

    #define TPM2C4VL_BIT _TPM2C4V.Overlap_STR.TPM2C4VLSTR.MergedBits.grpBIT

    #define TPM2C4VL_BIT0_MASK   1
    #define TPM2C4VL_BIT0_BITNUM 0
    #define TPM2C4VL_BIT1_MASK   2
    #define TPM2C4VL_BIT1_BITNUM 1
    #define TPM2C4VL_BIT2_MASK   4
    #define TPM2C4VL_BIT2_BITNUM 2
    #define TPM2C4VL_BIT3_MASK   8
    #define TPM2C4VL_BIT3_BITNUM 3
    #define TPM2C4VL_BIT4_MASK   16
    #define TPM2C4VL_BIT4_BITNUM 4
    #define TPM2C4VL_BIT5_MASK   32
    #define TPM2C4VL_BIT5_BITNUM 5
    #define TPM2C4VL_BIT6_MASK   64
    #define TPM2C4VL_BIT6_BITNUM 6
    #define TPM2C4VL_BIT7_MASK   128
    #define TPM2C4VL_BIT7_BITNUM 7
    #define TPM2C4VL_BIT_MASK  255
    #define TPM2C4VL_BIT_BITNUM  0

  } Overlap_STR;

