AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
  struct {
    word grpBIT  :16;
  } MergedBits;
} TPM2C4VSTR;
extern volatile TPM2C4VSTR _TPM2C4V @0x00000072;
#define TPM2C4V _TPM2C4V.Word
#define TPM2C4V_BIT _TPM2C4V.MergedBits.grpBIT

#define TPM2C4V_BIT_MASK  65535
#define TPM2C4V_BIT_BITNUM  0


/*** SRS - System Reset Status; 0x00001800 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte LVD         :1;                                       /* Low Voltage Detect */
    byte ICG         :1;                                       /* Internal Clock Generation Module Reset */
    byte             :1;
    byte ILOP        :1;                                       /* Illegal Opcode */
    byte COP         :1;                                       /* Computer Operating Properly (COP) Watchdog */
    byte PIN         :1;                                       /* External Reset Pin */
    byte POR         :1;                                       /* Power-On Reset */
  } Bits;
} SRSSTR;
extern volatile SRSSTR _SRS @0x00001800;
#define SRS _SRS.Byte
#define SRS_LVD _SRS.Bits.LVD
#define SRS_ICG _SRS.Bits.ICG
#define SRS_ILOP _SRS.Bits.ILOP
#define SRS_COP _SRS.Bits.COP
#define SRS_PIN _SRS.Bits.PIN
#define SRS_POR _SRS.Bits.POR

#define SRS_LVD_MASK   2
#define SRS_LVD_BITNUM 1
#define SRS_ICG_MASK   4
#define SRS_ICG_BITNUM 2
#define SRS_ILOP_MASK   16
#define SRS_ILOP_BITNUM 4
#define SRS_COP_MASK   32
#define SRS_COP_BITNUM 5
#define SRS_PIN_MASK   64
#define SRS_PIN_BITNUM 6
#define SRS_POR_MASK   128
#define SRS_POR_BITNUM 7


/*** SBDFR - System Background Debug Force Reset Register; 0x00001801 ***/
typedef union {
  byte Byte;
  struct {
    byte BDFR        :1;                                       /* Background Debug Force Reset */
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
  } Bits;
} SBDFRSTR;
extern volatile SBDFRSTR _SBDFR @0x00001801;
#define SBDFR _SBDFR.Byte
#define SBDFR_BDFR _SBDFR.Bits.BDFR

#define SBDFR_BDFR_MASK   1
#define SBDFR_BDFR_BITNUM 0


/*** SOPT - System Options Register; 0x00001802 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte BKGDPE      :1;                                       /* Background Debug Mode Pin Enable */
    byte             :1;
    byte             :1;
    byte             :1;
    byte STOPE       :1;                                       /* Stop Mode Enable */
    byte COPT        :1;                                       /* COP Watchdog Timeout */
    byte COPE        :1;                                       /* COP Watchdog Enable */
  } Bits;
} SOPTSTR;
extern volatile SOPTSTR _SOPT @0x00001802;
#define SOPT _SOPT.Byte
#define SOPT_BKGDPE _SOPT.Bits.BKGDPE
#define SOPT_STOPE _SOPT.Bits.STOPE
#define SOPT_COPT _SOPT.Bits.COPT
#define SOPT_COPE _SOPT.Bits.COPE

#define SOPT_BKGDPE_MASK   2
#define SOPT_BKGDPE_BITNUM 1
#define SOPT_STOPE_MASK   32
#define SOPT_STOPE_BITNUM 5
#define SOPT_COPT_MASK   64
#define SOPT_COPT_BITNUM 6
#define SOPT_COPE_MASK   128
#define SOPT_COPE_BITNUM 7


/*** SIMID - System Integration Module Part ID Register; 0x00001806 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SIMIDH - System Integration Module Part ID Register High; 0x00001806 ***/
    union {
      byte Byte;
      struct {
        byte ID8         :1;                                       /* Part Identification Number 8 */
        byte ID9         :1;                                       /* Part Identification Number 9 */
        byte ID10        :1;                                       /* Part Identification Number 10 */
        byte ID11        :1;                                       /* Part Identification Number 11 */
        byte REV0        :1;                                       /* Revision Number 0 */
        byte REV1        :1;                                       /* Revision Number 1 */
        byte REV2        :1;                                       /* Revision Number 2 */
        byte REV3        :1;                                       /* Revision Number 3 */
      } Bits;
      struct {
        byte grpID_8 :4;
        byte grpREV :4;
      } MergedBits;
    } SIMIDHSTR;
    #define SIMIDH _SIMID.Overlap_STR.SIMIDHSTR.Byte
    #define SIMIDH_ID8 _SIMID.Overlap_STR.SIMIDHSTR.Bits.ID8
    #define SIMIDH_ID9 _SIMID.Overlap_STR.SIMIDHSTR.Bits.ID9
    #define SIMIDH_ID10 _SIMID.Overlap_STR.SIMIDHSTR.Bits.ID10
    #define SIMIDH_ID11 _SIMID.Overlap_STR.SIMIDHSTR.Bits.ID11
    #define SIMIDH_REV0 _SIMID.Overlap_STR.SIMIDHSTR.Bits.REV0
    #define SIMIDH_REV1 _SIMID.Overlap_STR.SIMIDHSTR.Bits.REV1
    #define SIMIDH_REV2 _SIMID.Overlap_STR.SIMIDHSTR.Bits.REV2
    #define SIMIDH_REV3 _SIMID.Overlap_STR.SIMIDHSTR.Bits.REV3

    #define SIMIDH_ID_8 _SIMID.Overlap_STR.SIMIDHSTR.MergedBits.grpID_8
    #define SIMIDH_REV _SIMID.Overlap_STR.SIMIDHSTR.MergedBits.grpREV
    #define SIMIDH_ID SIMIDH_ID_8

    #define SIMIDH_ID8_MASK   1
    #define SIMIDH_ID8_BITNUM 0
    #define SIMIDH_ID9_MASK   2
    #define SIMIDH_ID9_BITNUM 1
    #define SIMIDH_ID10_MASK   4
    #define SIMIDH_ID10_BITNUM 2
    #define SIMIDH_ID11_MASK   8
    #define SIMIDH_ID11_BITNUM 3
    #define SIMIDH_REV0_MASK   16
    #define SIMIDH_REV0_BITNUM 4
    #define SIMIDH_REV1_MASK   32
    #define SIMIDH_REV1_BITNUM 5
    #define SIMIDH_REV2_MASK   64
    #define SIMIDH_REV2_BITNUM 6
    #define SIMIDH_REV3_MASK   128
    #define SIMIDH_REV3_BITNUM 7
    #define SIMIDH_ID_8_MASK  15
    #define SIMIDH_ID_8_BITNUM  0
    #define SIMIDH_REV_MASK  240
    #define SIMIDH_REV_BITNUM  4


    /*** SIMIDL - System Integration Module Part ID Register Low; 0x00001807 ***/
    union {
      byte Byte;
      struct {
        byte ID0         :1;                                       /* Part Identification Number 0 */
        byte ID1         :1;                                       /* Part Identification Number 1 */
        byte ID2         :1;                                       /* Part Identification Number 2 */
        byte ID3         :1;                                       /* Part Identification Number 3 */
        byte ID4         :1;                                       /* Part Identification Number 4 */
        byte ID5         :1;                                       /* Part Identification Number 5 */
        byte ID6         :1;                                       /* Part Identification Number 6 */
        byte ID7         :1;                                       /* Part Identification Number 7 */
      } Bits;
      struct {
        byte grpID :8;
      } MergedBits;
    } SIMIDLSTR;
    #define SIMIDL _SIMID.Overlap_STR.SIMIDLSTR.Byte
    #define SIMIDL_ID0 _SIMID.Overlap_STR.SIMIDLSTR.Bits.ID0
    #define SIMIDL_ID1 _SIMID.Overlap_STR.SIMIDLSTR.Bits.ID1
    #define SIMIDL_ID2 _SIMID.Overlap_STR.SIMIDLSTR.Bits.ID2
    #define SIMIDL_ID3 _SIMID.Overlap_STR.SIMIDLSTR.Bits.ID3
    #define SIMIDL_ID4 _SIMID.Overlap_STR.SIMIDLSTR.Bits.ID4
    #define SIMIDL_ID5 _SIMID.Overlap_STR.SIMIDLSTR.Bits.ID5
    #define SIMIDL_ID6 _SIMID.Overlap_STR.SIMIDLSTR.Bits.ID6
    #define SIMIDL_ID7 _SIMID.Overlap_STR.SIMIDLSTR.Bits.ID7

    #define SIMIDL_ID _SIMID.Overlap_STR.SIMIDLSTR.MergedBits.grpID

    #define SIMIDL_ID0_MASK   1
    #define SIMIDL_ID0_BITNUM 0
    #define SIMIDL_ID1_MASK   2
    #define SIMIDL_ID1_BITNUM 1
    #define SIMIDL_ID2_MASK   4
    #define SIMIDL_ID2_BITNUM 2
    #define SIMIDL_ID3_MASK   8
    #define SIMIDL_ID3_BITNUM 3
    #define SIMIDL_ID4_MASK   16
    #define SIMIDL_ID4_BITNUM 4
    #define SIMIDL_ID5_MASK   32
    #define SIMIDL_ID5_BITNUM 5
    #define SIMIDL_ID6_MASK   64
    #define SIMIDL_ID6_BITNUM 6
    #define SIMIDL_ID7_MASK   128
    #define SIMIDL_ID7_BITNUM 7
    #define SIMIDL_ID_MASK  255
    #define SIMIDL_ID_BITNUM  0

  } Overlap_STR;

