AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
  struct {
    word ID0         :1;                                       /* Part Identification Number 0 */
    word ID1         :1;                                       /* Part Identification Number 1 */
    word ID2         :1;                                       /* Part Identification Number 2 */
    word ID3         :1;                                       /* Part Identification Number 3 */
    word ID4         :1;                                       /* Part Identification Number 4 */
    word ID5         :1;                                       /* Part Identification Number 5 */
    word ID6         :1;                                       /* Part Identification Number 6 */
    word ID7         :1;                                       /* Part Identification Number 7 */
    word ID8         :1;                                       /* Part Identification Number 8 */
    word ID9         :1;                                       /* Part Identification Number 9 */
    word ID10        :1;                                       /* Part Identification Number 10 */
    word ID11        :1;                                       /* Part Identification Number 11 */
    word REV0        :1;                                       /* Revision Number 0 */
    word REV1        :1;                                       /* Revision Number 1 */
    word REV2        :1;                                       /* Revision Number 2 */
    word REV3        :1;                                       /* Revision Number 3 */
  } Bits;
  struct {
    word grpID   :12;
    word grpREV  :4;
  } MergedBits;
} SIMIDSTR;
extern volatile SIMIDSTR _SIMID @0x00001806;
#define SIMID _SIMID.Word
#define SIMID_ID0 _SIMID.Bits.ID0
#define SIMID_ID1 _SIMID.Bits.ID1
#define SIMID_ID2 _SIMID.Bits.ID2
#define SIMID_ID3 _SIMID.Bits.ID3
#define SIMID_ID4 _SIMID.Bits.ID4
#define SIMID_ID5 _SIMID.Bits.ID5
#define SIMID_ID6 _SIMID.Bits.ID6
#define SIMID_ID7 _SIMID.Bits.ID7
#define SIMID_ID8 _SIMID.Bits.ID8
#define SIMID_ID9 _SIMID.Bits.ID9
#define SIMID_ID10 _SIMID.Bits.ID10
#define SIMID_ID11 _SIMID.Bits.ID11
#define SIMID_REV0 _SIMID.Bits.REV0
#define SIMID_REV1 _SIMID.Bits.REV1
#define SIMID_REV2 _SIMID.Bits.REV2
#define SIMID_REV3 _SIMID.Bits.REV3
#define SIMID_ID _SIMID.MergedBits.grpID
#define SIMID_REV _SIMID.MergedBits.grpREV

#define SIMID_ID0_MASK   1
#define SIMID_ID0_BITNUM 0
#define SIMID_ID1_MASK   2
#define SIMID_ID1_BITNUM 1
#define SIMID_ID2_MASK   4
#define SIMID_ID2_BITNUM 2
#define SIMID_ID3_MASK   8
#define SIMID_ID3_BITNUM 3
#define SIMID_ID4_MASK   16
#define SIMID_ID4_BITNUM 4
#define SIMID_ID5_MASK   32
#define SIMID_ID5_BITNUM 5
#define SIMID_ID6_MASK   64
#define SIMID_ID6_BITNUM 6
#define SIMID_ID7_MASK   128
#define SIMID_ID7_BITNUM 7
#define SIMID_ID8_MASK   256
#define SIMID_ID8_BITNUM 8
#define SIMID_ID9_MASK   512
#define SIMID_ID9_BITNUM 9
#define SIMID_ID10_MASK   1024
#define SIMID_ID10_BITNUM 10
#define SIMID_ID11_MASK   2048
#define SIMID_ID11_BITNUM 11
#define SIMID_REV0_MASK   4096
#define SIMID_REV0_BITNUM 12
#define SIMID_REV1_MASK   8192
#define SIMID_REV1_BITNUM 13
#define SIMID_REV2_MASK   16384
#define SIMID_REV2_BITNUM 14
#define SIMID_REV3_MASK   32768
#define SIMID_REV3_BITNUM 15
#define SIMID_ID_MASK  4095
#define SIMID_ID_BITNUM  0
#define SIMID_REV_MASK  61440
#define SIMID_REV_BITNUM  12


/*** SRTISC - System RTI Status and Control Register; 0x00001808 ***/
typedef union {
  byte Byte;
  struct {
    byte RTIS0       :1;                                       /* Real-Time Interrupt Delay Select Bit 0 */
    byte RTIS1       :1;                                       /* Real-Time Interrupt Delay Select Bit 1 */
    byte RTIS2       :1;                                       /* Real-Time Interrupt Delay Select Bit 2 */
    byte             :1;
    byte RTIE        :1;                                       /* Real-Time Interrupt Enable */
    byte RTICLKS     :1;                                       /* Real-Time Interrupt Clock Select */
    byte RTIACK      :1;                                       /* Real-Time Interrupt Acknowledge */
    byte RTIF        :1;                                       /* Real-Time Interrupt Flag */
  } Bits;
  struct {
    byte grpRTIS :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} SRTISCSTR;
extern volatile SRTISCSTR _SRTISC @0x00001808;
#define SRTISC _SRTISC.Byte
#define SRTISC_RTIS0 _SRTISC.Bits.RTIS0
#define SRTISC_RTIS1 _SRTISC.Bits.RTIS1
#define SRTISC_RTIS2 _SRTISC.Bits.RTIS2
#define SRTISC_RTIE _SRTISC.Bits.RTIE
#define SRTISC_RTICLKS _SRTISC.Bits.RTICLKS
#define SRTISC_RTIACK _SRTISC.Bits.RTIACK
#define SRTISC_RTIF _SRTISC.Bits.RTIF
#define SRTISC_RTIS _SRTISC.MergedBits.grpRTIS

#define SRTISC_RTIS0_MASK   1
#define SRTISC_RTIS0_BITNUM 0
#define SRTISC_RTIS1_MASK   2
#define SRTISC_RTIS1_BITNUM 1
#define SRTISC_RTIS2_MASK   4
#define SRTISC_RTIS2_BITNUM 2
#define SRTISC_RTIE_MASK   16
#define SRTISC_RTIE_BITNUM 4
#define SRTISC_RTICLKS_MASK   32
#define SRTISC_RTICLKS_BITNUM 5
#define SRTISC_RTIACK_MASK   64
#define SRTISC_RTIACK_BITNUM 6
#define SRTISC_RTIF_MASK   128
#define SRTISC_RTIF_BITNUM 7
#define SRTISC_RTIS_MASK  7
#define SRTISC_RTIS_BITNUM  0


/*** SPMSC1 - PM Status and Control 1 Register; 0x00001809 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte LVDE        :1;                                       /* Low-Voltage Detect Enable */
    byte LVDSE       :1;                                       /* Low-Voltage Detect Stop Enable */
    byte LVDRE       :1;                                       /* Low-Voltage Detect Reset Enable */
    byte LVDIE       :1;                                       /* Low-Voltage Detect Interrrupt Enable */
    byte LVDACK      :1;                                       /* Low-Voltage Detect Acknowledge */
    byte LVDF        :1;                                       /* Low-Voltage Detect Flag */
  } Bits;
} SPMSC1STR;
extern volatile SPMSC1STR _SPMSC1 @0x00001809;
#define SPMSC1 _SPMSC1.Byte
#define SPMSC1_LVDE _SPMSC1.Bits.LVDE
#define SPMSC1_LVDSE _SPMSC1.Bits.LVDSE
#define SPMSC1_LVDRE _SPMSC1.Bits.LVDRE
#define SPMSC1_LVDIE _SPMSC1.Bits.LVDIE
#define SPMSC1_LVDACK _SPMSC1.Bits.LVDACK
#define SPMSC1_LVDF _SPMSC1.Bits.LVDF

#define SPMSC1_LVDE_MASK   4
#define SPMSC1_LVDE_BITNUM 2
#define SPMSC1_LVDSE_MASK   8
#define SPMSC1_LVDSE_BITNUM 3
#define SPMSC1_LVDRE_MASK   16
#define SPMSC1_LVDRE_BITNUM 4
#define SPMSC1_LVDIE_MASK   32
#define SPMSC1_LVDIE_BITNUM 5
#define SPMSC1_LVDACK_MASK   64
#define SPMSC1_LVDACK_BITNUM 6
#define SPMSC1_LVDF_MASK   128
#define SPMSC1_LVDF_BITNUM 7


/*** SPMSC2 - PM Status and Control 2 Register; 0x0000180A ***/
typedef union {
  byte Byte;
  struct {
    byte PPDC        :1;                                       /* Partial Power Down Control */
    byte PDC         :1;                                       /* Power Down Control */
    byte PPDACK      :1;                                       /* Partial Power Down Acknowlege */
    byte PPDF        :1;                                       /* Partial Power Down Flag */
    byte LVWV        :1;                                       /* Low-Voltage Warning Voltage Select */
    byte LVDV        :1;                                       /* Low-Voltage Detect Voltage Select */
    byte LVWACK      :1;                                       /* Low-Voltage Warning Acknowlege */
    byte LVWF        :1;                                       /* Low-Voltage Warning Flag */
  } Bits;
} SPMSC2STR;
