AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
extern volatile SPMSC2STR _SPMSC2 @0x0000180A;
#define SPMSC2 _SPMSC2.Byte
#define SPMSC2_PPDC _SPMSC2.Bits.PPDC
#define SPMSC2_PDC _SPMSC2.Bits.PDC
#define SPMSC2_PPDACK _SPMSC2.Bits.PPDACK
#define SPMSC2_PPDF _SPMSC2.Bits.PPDF
#define SPMSC2_LVWV _SPMSC2.Bits.LVWV
#define SPMSC2_LVDV _SPMSC2.Bits.LVDV
#define SPMSC2_LVWACK _SPMSC2.Bits.LVWACK
#define SPMSC2_LVWF _SPMSC2.Bits.LVWF

#define SPMSC2_PPDC_MASK   1
#define SPMSC2_PPDC_BITNUM 0
#define SPMSC2_PDC_MASK   2
#define SPMSC2_PDC_BITNUM 1
#define SPMSC2_PPDACK_MASK   4
#define SPMSC2_PPDACK_BITNUM 2
#define SPMSC2_PPDF_MASK   8
#define SPMSC2_PPDF_BITNUM 3
#define SPMSC2_LVWV_MASK   16
#define SPMSC2_LVWV_BITNUM 4
#define SPMSC2_LVDV_MASK   32
#define SPMSC2_LVDV_BITNUM 5
#define SPMSC2_LVWACK_MASK   64
#define SPMSC2_LVWACK_BITNUM 6
#define SPMSC2_LVWF_MASK   128
#define SPMSC2_LVWF_BITNUM 7


/*** DBGCAH - Debug Comparator A High Register; 0x00001810 ***/
typedef union {
  byte Byte;
  struct {
    byte Bit8        :1;                                       /* Debug Comparator A Bit 8 */
    byte Bit9        :1;                                       /* Debug Comparator A Bit 9 */
    byte Bit10       :1;                                       /* Debug Comparator A Bit 10 */
    byte Bit11       :1;                                       /* Debug Comparator A Bit 11 */
    byte Bit12       :1;                                       /* Debug Comparator A Bit 12 */
    byte Bit13       :1;                                       /* Debug Comparator A Bit 13 */
    byte Bit14       :1;                                       /* Debug Comparator A Bit 14 */
    byte Bit15       :1;                                       /* Debug Comparator A Bit 15 */
  } Bits;
  struct {
    byte grpBit_8 :8;
  } MergedBits;
} DBGCAHSTR;
extern volatile DBGCAHSTR _DBGCAH @0x00001810;
#define DBGCAH _DBGCAH.Byte
#define DBGCAH_Bit8 _DBGCAH.Bits.Bit8
#define DBGCAH_Bit9 _DBGCAH.Bits.Bit9
#define DBGCAH_Bit10 _DBGCAH.Bits.Bit10
#define DBGCAH_Bit11 _DBGCAH.Bits.Bit11
#define DBGCAH_Bit12 _DBGCAH.Bits.Bit12
#define DBGCAH_Bit13 _DBGCAH.Bits.Bit13
#define DBGCAH_Bit14 _DBGCAH.Bits.Bit14
#define DBGCAH_Bit15 _DBGCAH.Bits.Bit15
#define DBGCAH_Bit_8 _DBGCAH.MergedBits.grpBit_8
#define DBGCAH_Bit DBGCAH_Bit_8

#define DBGCAH_Bit8_MASK   1
#define DBGCAH_Bit8_BITNUM 0
#define DBGCAH_Bit9_MASK   2
#define DBGCAH_Bit9_BITNUM 1
#define DBGCAH_Bit10_MASK   4
#define DBGCAH_Bit10_BITNUM 2
#define DBGCAH_Bit11_MASK   8
#define DBGCAH_Bit11_BITNUM 3
#define DBGCAH_Bit12_MASK   16
#define DBGCAH_Bit12_BITNUM 4
#define DBGCAH_Bit13_MASK   32
#define DBGCAH_Bit13_BITNUM 5
#define DBGCAH_Bit14_MASK   64
#define DBGCAH_Bit14_BITNUM 6
#define DBGCAH_Bit15_MASK   128
#define DBGCAH_Bit15_BITNUM 7
#define DBGCAH_Bit_8_MASK  255
#define DBGCAH_Bit_8_BITNUM  0


/*** DBGCAL - Debug Comparator A Low Register; 0x00001811 ***/
typedef union {
  byte Byte;
  struct {
    byte Bit0        :1;                                       /* Debug Comparator A Bit 0 */
    byte Bit1        :1;                                       /* Debug Comparator A Bit 1 */
    byte Bit2        :1;                                       /* Debug Comparator A Bit 2 */
    byte Bit3        :1;                                       /* Debug Comparator A Bit 3 */
    byte Bit4        :1;                                       /* Debug Comparator A Bit 4 */
    byte Bit5        :1;                                       /* Debug Comparator A Bit 5 */
    byte Bit6        :1;                                       /* Debug Comparator A Bit 6 */
    byte Bit7        :1;                                       /* Debug Comparator A Bit 7 */
  } Bits;
  struct {
    byte grpBit  :8;
  } MergedBits;
} DBGCALSTR;
extern volatile DBGCALSTR _DBGCAL @0x00001811;
#define DBGCAL _DBGCAL.Byte
#define DBGCAL_Bit0 _DBGCAL.Bits.Bit0
#define DBGCAL_Bit1 _DBGCAL.Bits.Bit1
#define DBGCAL_Bit2 _DBGCAL.Bits.Bit2
#define DBGCAL_Bit3 _DBGCAL.Bits.Bit3
#define DBGCAL_Bit4 _DBGCAL.Bits.Bit4
#define DBGCAL_Bit5 _DBGCAL.Bits.Bit5
#define DBGCAL_Bit6 _DBGCAL.Bits.Bit6
#define DBGCAL_Bit7 _DBGCAL.Bits.Bit7
#define DBGCAL_Bit _DBGCAL.MergedBits.grpBit

#define DBGCAL_Bit0_MASK   1
#define DBGCAL_Bit0_BITNUM 0
#define DBGCAL_Bit1_MASK   2
#define DBGCAL_Bit1_BITNUM 1
#define DBGCAL_Bit2_MASK   4
#define DBGCAL_Bit2_BITNUM 2
#define DBGCAL_Bit3_MASK   8
#define DBGCAL_Bit3_BITNUM 3
#define DBGCAL_Bit4_MASK   16
#define DBGCAL_Bit4_BITNUM 4
#define DBGCAL_Bit5_MASK   32
#define DBGCAL_Bit5_BITNUM 5
#define DBGCAL_Bit6_MASK   64
#define DBGCAL_Bit6_BITNUM 6
#define DBGCAL_Bit7_MASK   128
#define DBGCAL_Bit7_BITNUM 7
#define DBGCAL_Bit_MASK  255
#define DBGCAL_Bit_BITNUM  0


/*** DBGCBH - Debug Comparator B High Register; 0x00001812 ***/
typedef union {
  byte Byte;
  struct {
    byte Bit8        :1;                                       /* Debug Comparator B Bit 8 */
    byte Bit9        :1;                                       /* Debug Comparator B Bit 9 */
    byte Bit10       :1;                                       /* Debug Comparator B Bit 10 */
    byte Bit11       :1;                                       /* Debug Comparator B Bit 11 */
    byte Bit12       :1;                                       /* Debug Comparator B Bit 12 */
    byte Bit13       :1;                                       /* Debug Comparator B Bit 13 */
    byte Bit14       :1;                                       /* Debug Comparator B Bit 14 */
    byte Bit15       :1;                                       /* Debug Comparator B Bit 15 */
  } Bits;
  struct {
    byte grpBit_8 :8;
  } MergedBits;
} DBGCBHSTR;
extern volatile DBGCBHSTR _DBGCBH @0x00001812;
#define DBGCBH _DBGCBH.Byte
#define DBGCBH_Bit8 _DBGCBH.Bits.Bit8
#define DBGCBH_Bit9 _DBGCBH.Bits.Bit9
#define DBGCBH_Bit10 _DBGCBH.Bits.Bit10
#define DBGCBH_Bit11 _DBGCBH.Bits.Bit11
#define DBGCBH_Bit12 _DBGCBH.Bits.Bit12
#define DBGCBH_Bit13 _DBGCBH.Bits.Bit13
#define DBGCBH_Bit14 _DBGCBH.Bits.Bit14
#define DBGCBH_Bit15 _DBGCBH.Bits.Bit15
#define DBGCBH_Bit_8 _DBGCBH.MergedBits.grpBit_8
#define DBGCBH_Bit DBGCBH_Bit_8

#define DBGCBH_Bit8_MASK   1
#define DBGCBH_Bit8_BITNUM 0
#define DBGCBH_Bit9_MASK   2
#define DBGCBH_Bit9_BITNUM 1
#define DBGCBH_Bit10_MASK   4
#define DBGCBH_Bit10_BITNUM 2
#define DBGCBH_Bit11_MASK   8
#define DBGCBH_Bit11_BITNUM 3
#define DBGCBH_Bit12_MASK   16
#define DBGCBH_Bit12_BITNUM 4
#define DBGCBH_Bit13_MASK   32
#define DBGCBH_Bit13_BITNUM 5
#define DBGCBH_Bit14_MASK   64
#define DBGCBH_Bit14_BITNUM 6
#define DBGCBH_Bit15_MASK   128
#define DBGCBH_Bit15_BITNUM 7
#define DBGCBH_Bit_8_MASK  255
#define DBGCBH_Bit_8_BITNUM  0


/*** DBGCBL - Debug Comparator B Low Register; 0x00001813 ***/
typedef union {
  byte Byte;
  struct {
    byte Bit0        :1;                                       /* Debug Comparator B Bit 0 */
    byte Bit1        :1;                                       /* Debug Comparator B Bit 1 */
    byte Bit2        :1;                                       /* Debug Comparator B Bit 2 */
    byte Bit3        :1;                                       /* Debug Comparator B Bit 3 */
    byte Bit4        :1;                                       /* Debug Comparator B Bit 4 */
    byte Bit5        :1;                                       /* Debug Comparator B Bit 5 */
    byte Bit6        :1;                                       /* Debug Comparator B Bit 6 */
    byte Bit7        :1;                                       /* Debug Comparator B Bit 7 */
  } Bits;
  struct {
    byte grpBit  :8;
  } MergedBits;
} DBGCBLSTR;
extern volatile DBGCBLSTR _DBGCBL @0x00001813;
#define DBGCBL _DBGCBL.Byte
#define DBGCBL_Bit0 _DBGCBL.Bits.Bit0
#define DBGCBL_Bit1 _DBGCBL.Bits.Bit1
#define DBGCBL_Bit2 _DBGCBL.Bits.Bit2
#define DBGCBL_Bit3 _DBGCBL.Bits.Bit3
#define DBGCBL_Bit4 _DBGCBL.Bits.Bit4
#define DBGCBL_Bit5 _DBGCBL.Bits.Bit5
#define DBGCBL_Bit6 _DBGCBL.Bits.Bit6
#define DBGCBL_Bit7 _DBGCBL.Bits.Bit7
#define DBGCBL_Bit _DBGCBL.MergedBits.grpBit

#define DBGCBL_Bit0_MASK   1
#define DBGCBL_Bit0_BITNUM 0
#define DBGCBL_Bit1_MASK   2
#define DBGCBL_Bit1_BITNUM 1
#define DBGCBL_Bit2_MASK   4
#define DBGCBL_Bit2_BITNUM 2
#define DBGCBL_Bit3_MASK   8
#define DBGCBL_Bit3_BITNUM 3
#define DBGCBL_Bit4_MASK   16
#define DBGCBL_Bit4_BITNUM 4
#define DBGCBL_Bit5_MASK   32
#define DBGCBL_Bit5_BITNUM 5
#define DBGCBL_Bit6_MASK   64
#define DBGCBL_Bit6_BITNUM 6
#define DBGCBL_Bit7_MASK   128
#define DBGCBL_Bit7_BITNUM 7
#define DBGCBL_Bit_MASK  255
#define DBGCBL_Bit_BITNUM  0


/*** DBGF - Debug FIFO Register; 0x00001814 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DBGFH - Debug FIFO High Register; 0x00001814 ***/
    union {
      byte Byte;
      struct {
        byte Bit8        :1;                                       /* Debug FIFO Bit 8 */
        byte Bit9        :1;                                       /* Debug FIFO Bit 9 */
        byte Bit10       :1;                                       /* Debug FIFO Bit 10 */
        byte Bit11       :1;                                       /* Debug FIFO Bit 11 */
        byte Bit12       :1;                                       /* Debug FIFO Bit 12 */
        byte Bit13       :1;                                       /* Debug FIFO Bit 13 */
        byte Bit14       :1;                                       /* Debug FIFO Bit 14 */
        byte Bit15       :1;                                       /* Debug FIFO Bit 15 */
      } Bits;
      struct {
        byte grpBit_8 :8;
      } MergedBits;
    } DBGFHSTR;
    #define DBGFH _DBGF.Overlap_STR.DBGFHSTR.Byte
    #define DBGFH_Bit8 _DBGF.Overlap_STR.DBGFHSTR.Bits.Bit8
    #define DBGFH_Bit9 _DBGF.Overlap_STR.DBGFHSTR.Bits.Bit9
    #define DBGFH_Bit10 _DBGF.Overlap_STR.DBGFHSTR.Bits.Bit10
    #define DBGFH_Bit11 _DBGF.Overlap_STR.DBGFHSTR.Bits.Bit11
    #define DBGFH_Bit12 _DBGF.Overlap_STR.DBGFHSTR.Bits.Bit12
    #define DBGFH_Bit13 _DBGF.Overlap_STR.DBGFHSTR.Bits.Bit13
    #define DBGFH_Bit14 _DBGF.Overlap_STR.DBGFHSTR.Bits.Bit14
    #define DBGFH_Bit15 _DBGF.Overlap_STR.DBGFHSTR.Bits.Bit15

    #define DBGFH_Bit_8 _DBGF.Overlap_STR.DBGFHSTR.MergedBits.grpBit_8
    #define DBGFH_Bit DBGFH_Bit_8

