AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
    #define DBGFH_Bit8_MASK   1
    #define DBGFH_Bit8_BITNUM 0
    #define DBGFH_Bit9_MASK   2
    #define DBGFH_Bit9_BITNUM 1
    #define DBGFH_Bit10_MASK   4
    #define DBGFH_Bit10_BITNUM 2
    #define DBGFH_Bit11_MASK   8
    #define DBGFH_Bit11_BITNUM 3
    #define DBGFH_Bit12_MASK   16
    #define DBGFH_Bit12_BITNUM 4
    #define DBGFH_Bit13_MASK   32
    #define DBGFH_Bit13_BITNUM 5
    #define DBGFH_Bit14_MASK   64
    #define DBGFH_Bit14_BITNUM 6
    #define DBGFH_Bit15_MASK   128
    #define DBGFH_Bit15_BITNUM 7
    #define DBGFH_Bit_8_MASK  255
    #define DBGFH_Bit_8_BITNUM  0


    /*** DBGFL - Debug FIFO Low Register; 0x00001815 ***/
    union {
      byte Byte;
      struct {
        byte Bit0        :1;                                       /* Debug FIFO Bit 0 */
        byte Bit1        :1;                                       /* Debug FIFO Bit 1 */
        byte Bit2        :1;                                       /* Debug FIFO Bit 2 */
        byte Bit3        :1;                                       /* Debug FIFO Bit 3 */
        byte Bit4        :1;                                       /* Debug FIFO Bit 4 */
        byte Bit5        :1;                                       /* Debug FIFO Bit 5 */
        byte Bit6        :1;                                       /* Debug FIFO Bit 6 */
        byte Bit7        :1;                                       /* Debug FIFO Bit 7 */
      } Bits;
      struct {
        byte grpBit :8;
      } MergedBits;
    } DBGFLSTR;
    #define DBGFL _DBGF.Overlap_STR.DBGFLSTR.Byte
    #define DBGFL_Bit0 _DBGF.Overlap_STR.DBGFLSTR.Bits.Bit0
    #define DBGFL_Bit1 _DBGF.Overlap_STR.DBGFLSTR.Bits.Bit1
    #define DBGFL_Bit2 _DBGF.Overlap_STR.DBGFLSTR.Bits.Bit2
    #define DBGFL_Bit3 _DBGF.Overlap_STR.DBGFLSTR.Bits.Bit3
    #define DBGFL_Bit4 _DBGF.Overlap_STR.DBGFLSTR.Bits.Bit4
    #define DBGFL_Bit5 _DBGF.Overlap_STR.DBGFLSTR.Bits.Bit5
    #define DBGFL_Bit6 _DBGF.Overlap_STR.DBGFLSTR.Bits.Bit6
    #define DBGFL_Bit7 _DBGF.Overlap_STR.DBGFLSTR.Bits.Bit7

    #define DBGFL_Bit _DBGF.Overlap_STR.DBGFLSTR.MergedBits.grpBit

    #define DBGFL_Bit0_MASK   1
    #define DBGFL_Bit0_BITNUM 0
    #define DBGFL_Bit1_MASK   2
    #define DBGFL_Bit1_BITNUM 1
    #define DBGFL_Bit2_MASK   4
    #define DBGFL_Bit2_BITNUM 2
    #define DBGFL_Bit3_MASK   8
    #define DBGFL_Bit3_BITNUM 3
    #define DBGFL_Bit4_MASK   16
    #define DBGFL_Bit4_BITNUM 4
    #define DBGFL_Bit5_MASK   32
    #define DBGFL_Bit5_BITNUM 5
    #define DBGFL_Bit6_MASK   64
    #define DBGFL_Bit6_BITNUM 6
    #define DBGFL_Bit7_MASK   128
    #define DBGFL_Bit7_BITNUM 7
    #define DBGFL_Bit_MASK  255
    #define DBGFL_Bit_BITNUM  0

  } Overlap_STR;

  struct {
    word Bit0        :1;                                       /* Debug FIFO Bit 0 */
    word Bit1        :1;                                       /* Debug FIFO Bit 1 */
    word Bit2        :1;                                       /* Debug FIFO Bit 2 */
    word Bit3        :1;                                       /* Debug FIFO Bit 3 */
    word Bit4        :1;                                       /* Debug FIFO Bit 4 */
    word Bit5        :1;                                       /* Debug FIFO Bit 5 */
    word Bit6        :1;                                       /* Debug FIFO Bit 6 */
    word Bit7        :1;                                       /* Debug FIFO Bit 7 */
    word Bit8        :1;                                       /* Debug FIFO Bit 8 */
    word Bit9        :1;                                       /* Debug FIFO Bit 9 */
    word Bit10       :1;                                       /* Debug FIFO Bit 10 */
    word Bit11       :1;                                       /* Debug FIFO Bit 11 */
    word Bit12       :1;                                       /* Debug FIFO Bit 12 */
    word Bit13       :1;                                       /* Debug FIFO Bit 13 */
    word Bit14       :1;                                       /* Debug FIFO Bit 14 */
    word Bit15       :1;                                       /* Debug FIFO Bit 15 */
  } Bits;
  struct {
    word grpBit  :16;
  } MergedBits;
} DBGFSTR;
extern volatile DBGFSTR _DBGF @0x00001814;
#define DBGF _DBGF.Word
#define DBGF_Bit0 _DBGF.Bits.Bit0
#define DBGF_Bit1 _DBGF.Bits.Bit1
#define DBGF_Bit2 _DBGF.Bits.Bit2
#define DBGF_Bit3 _DBGF.Bits.Bit3
#define DBGF_Bit4 _DBGF.Bits.Bit4
#define DBGF_Bit5 _DBGF.Bits.Bit5
#define DBGF_Bit6 _DBGF.Bits.Bit6
#define DBGF_Bit7 _DBGF.Bits.Bit7
#define DBGF_Bit8 _DBGF.Bits.Bit8
#define DBGF_Bit9 _DBGF.Bits.Bit9
#define DBGF_Bit10 _DBGF.Bits.Bit10
#define DBGF_Bit11 _DBGF.Bits.Bit11
#define DBGF_Bit12 _DBGF.Bits.Bit12
#define DBGF_Bit13 _DBGF.Bits.Bit13
#define DBGF_Bit14 _DBGF.Bits.Bit14
#define DBGF_Bit15 _DBGF.Bits.Bit15
#define DBGF_Bit _DBGF.MergedBits.grpBit

#define DBGF_Bit0_MASK   1
#define DBGF_Bit0_BITNUM 0
#define DBGF_Bit1_MASK   2
#define DBGF_Bit1_BITNUM 1
#define DBGF_Bit2_MASK   4
#define DBGF_Bit2_BITNUM 2
#define DBGF_Bit3_MASK   8
#define DBGF_Bit3_BITNUM 3
#define DBGF_Bit4_MASK   16
#define DBGF_Bit4_BITNUM 4
#define DBGF_Bit5_MASK   32
#define DBGF_Bit5_BITNUM 5
#define DBGF_Bit6_MASK   64
#define DBGF_Bit6_BITNUM 6
#define DBGF_Bit7_MASK   128
#define DBGF_Bit7_BITNUM 7
#define DBGF_Bit8_MASK   256
#define DBGF_Bit8_BITNUM 8
#define DBGF_Bit9_MASK   512
#define DBGF_Bit9_BITNUM 9
#define DBGF_Bit10_MASK   1024
#define DBGF_Bit10_BITNUM 10
#define DBGF_Bit11_MASK   2048
#define DBGF_Bit11_BITNUM 11
#define DBGF_Bit12_MASK   4096
#define DBGF_Bit12_BITNUM 12
#define DBGF_Bit13_MASK   8192
#define DBGF_Bit13_BITNUM 13
#define DBGF_Bit14_MASK   16384
#define DBGF_Bit14_BITNUM 14
#define DBGF_Bit15_MASK   32768
#define DBGF_Bit15_BITNUM 15
#define DBGF_Bit_MASK  65535
#define DBGF_Bit_BITNUM  0


/*** DBGC - Debug Control Register; 0x00001816 ***/
typedef union {
  byte Byte;
  struct {
    byte RWBEN       :1;                                       /* Enable R/W for Comparator B */
    byte RWB         :1;                                       /* R/W Comparison Value for Comparator B */
    byte RWAEN       :1;                                       /* Enable R/W for Comparator A */
    byte RWA         :1;                                       /* R/W Comparison Value for Comparator A */
    byte BRKEN       :1;                                       /*  Break Enable */
    byte TAG         :1;                                       /* Tag/Force Select */
    byte ARM         :1;                                       /* Arm Control */
    byte DBGEN       :1;                                       /* Debug Module Enable */
  } Bits;
} DBGCSTR;
extern volatile DBGCSTR _DBGC @0x00001816;
#define DBGC _DBGC.Byte
#define DBGC_RWBEN _DBGC.Bits.RWBEN
#define DBGC_RWB _DBGC.Bits.RWB
#define DBGC_RWAEN _DBGC.Bits.RWAEN
#define DBGC_RWA _DBGC.Bits.RWA
#define DBGC_BRKEN _DBGC.Bits.BRKEN
#define DBGC_TAG _DBGC.Bits.TAG
#define DBGC_ARM _DBGC.Bits.ARM
#define DBGC_DBGEN _DBGC.Bits.DBGEN

