AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
#define DBGC_RWBEN_MASK   1
#define DBGC_RWBEN_BITNUM 0
#define DBGC_RWB_MASK   2
#define DBGC_RWB_BITNUM 1
#define DBGC_RWAEN_MASK   4
#define DBGC_RWAEN_BITNUM 2
#define DBGC_RWA_MASK   8
#define DBGC_RWA_BITNUM 3
#define DBGC_BRKEN_MASK   16
#define DBGC_BRKEN_BITNUM 4
#define DBGC_TAG_MASK   32
#define DBGC_TAG_BITNUM 5
#define DBGC_ARM_MASK   64
#define DBGC_ARM_BITNUM 6
#define DBGC_DBGEN_MASK   128
#define DBGC_DBGEN_BITNUM 7


/*** DBGT - Debug Trigger Register; 0x00001817 ***/
typedef union {
  byte Byte;
  struct {
    byte TRG0        :1;                                       /* Select Trigger Mode Bit 0 */
    byte TRG1        :1;                                       /* Select Trigger Mode Bit 1 */
    byte TRG2        :1;                                       /* Select Trigger Mode Bit 2 */
    byte TRG3        :1;                                       /* Select Trigger Mode Bit 3 */
    byte             :1;
    byte             :1;
    byte BEGIN       :1;                                       /* Begin/End Trigger Select */
    byte TRGSEL      :1;                                       /* Trigger Type */
  } Bits;
  struct {
    byte grpTRG  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} DBGTSTR;
extern volatile DBGTSTR _DBGT @0x00001817;
#define DBGT _DBGT.Byte
#define DBGT_TRG0 _DBGT.Bits.TRG0
#define DBGT_TRG1 _DBGT.Bits.TRG1
#define DBGT_TRG2 _DBGT.Bits.TRG2
#define DBGT_TRG3 _DBGT.Bits.TRG3
#define DBGT_BEGIN _DBGT.Bits.BEGIN
#define DBGT_TRGSEL _DBGT.Bits.TRGSEL
#define DBGT_TRG _DBGT.MergedBits.grpTRG

#define DBGT_TRG0_MASK   1
#define DBGT_TRG0_BITNUM 0
#define DBGT_TRG1_MASK   2
#define DBGT_TRG1_BITNUM 1
#define DBGT_TRG2_MASK   4
#define DBGT_TRG2_BITNUM 2
#define DBGT_TRG3_MASK   8
#define DBGT_TRG3_BITNUM 3
#define DBGT_BEGIN_MASK   64
#define DBGT_BEGIN_BITNUM 6
#define DBGT_TRGSEL_MASK   128
#define DBGT_TRGSEL_BITNUM 7
#define DBGT_TRG_MASK  15
#define DBGT_TRG_BITNUM  0


/*** DBGS - Debug Status Register; 0x00001818 ***/
typedef union {
  byte Byte;
  struct {
    byte CNT0        :1;                                       /* FIFO Valid Count Bit 0 */
    byte CNT1        :1;                                       /* FIFO Valid Count Bit 1 */
    byte CNT2        :1;                                       /* FIFO Valid Count Bit 2 */
    byte CNT3        :1;                                       /* FIFO Valid Count Bit 3 */
    byte             :1;
    byte ARMF        :1;                                       /* Arm Flag */
    byte BF          :1;                                       /* Trigger Match B Flag */
    byte AF          :1;                                       /* Trigger Match A Flag */
  } Bits;
  struct {
    byte grpCNT  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} DBGSSTR;
extern volatile DBGSSTR _DBGS @0x00001818;
#define DBGS _DBGS.Byte
#define DBGS_CNT0 _DBGS.Bits.CNT0
#define DBGS_CNT1 _DBGS.Bits.CNT1
#define DBGS_CNT2 _DBGS.Bits.CNT2
#define DBGS_CNT3 _DBGS.Bits.CNT3
#define DBGS_ARMF _DBGS.Bits.ARMF
#define DBGS_BF _DBGS.Bits.BF
#define DBGS_AF _DBGS.Bits.AF
#define DBGS_CNT _DBGS.MergedBits.grpCNT

#define DBGS_CNT0_MASK   1
#define DBGS_CNT0_BITNUM 0
#define DBGS_CNT1_MASK   2
#define DBGS_CNT1_BITNUM 1
#define DBGS_CNT2_MASK   4
#define DBGS_CNT2_BITNUM 2
#define DBGS_CNT3_MASK   8
#define DBGS_CNT3_BITNUM 3
#define DBGS_ARMF_MASK   32
#define DBGS_ARMF_BITNUM 5
#define DBGS_BF_MASK   64
#define DBGS_BF_BITNUM 6
#define DBGS_AF_MASK   128
#define DBGS_AF_BITNUM 7
#define DBGS_CNT_MASK  15
#define DBGS_CNT_BITNUM  0


/*** FCDIV - FLASH Clock Divider Register; 0x00001820 ***/
typedef union {
  byte Byte;
  struct {
    byte DIV0        :1;                                       /* Divisor for FLASH Clock Divider Bit 0 */
    byte DIV1        :1;                                       /* Divisor for FLASH Clock Divider Bit 1 */
    byte DIV2        :1;                                       /* Divisor for FLASH Clock Divider Bit 2 */
    byte DIV3        :1;                                       /* Divisor for FLASH Clock Divider Bit 3 */
    byte DIV4        :1;                                       /* Divisor for FLASH Clock Divider Bit 4 */
    byte DIV5        :1;                                       /* Divisor for FLASH Clock Divider Bit 5 */
    byte PRDIV8      :1;                                       /* Prescale (Divide) FLASH Clock by 8 */
    byte DIVLD       :1;                                       /* Divisor Loaded Status Flag */
  } Bits;
  struct {
    byte grpDIV  :6;
    byte grpPRDIV_8 :1;
    byte         :1;
  } MergedBits;
} FCDIVSTR;
extern volatile FCDIVSTR _FCDIV @0x00001820;
#define FCDIV _FCDIV.Byte
#define FCDIV_DIV0 _FCDIV.Bits.DIV0
#define FCDIV_DIV1 _FCDIV.Bits.DIV1
#define FCDIV_DIV2 _FCDIV.Bits.DIV2
#define FCDIV_DIV3 _FCDIV.Bits.DIV3
#define FCDIV_DIV4 _FCDIV.Bits.DIV4
#define FCDIV_DIV5 _FCDIV.Bits.DIV5
#define FCDIV_PRDIV8 _FCDIV.Bits.PRDIV8
#define FCDIV_DIVLD _FCDIV.Bits.DIVLD
#define FCDIV_DIV _FCDIV.MergedBits.grpDIV

#define FCDIV_DIV0_MASK   1
#define FCDIV_DIV0_BITNUM 0
#define FCDIV_DIV1_MASK   2
#define FCDIV_DIV1_BITNUM 1
#define FCDIV_DIV2_MASK   4
#define FCDIV_DIV2_BITNUM 2
#define FCDIV_DIV3_MASK   8
#define FCDIV_DIV3_BITNUM 3
#define FCDIV_DIV4_MASK   16
#define FCDIV_DIV4_BITNUM 4
#define FCDIV_DIV5_MASK   32
#define FCDIV_DIV5_BITNUM 5
#define FCDIV_PRDIV8_MASK   64
#define FCDIV_PRDIV8_BITNUM 6
#define FCDIV_DIVLD_MASK   128
#define FCDIV_DIVLD_BITNUM 7
#define FCDIV_DIV_MASK  63
#define FCDIV_DIV_BITNUM  0


/*** FOPT - FLASH Options Register; 0x00001821 ***/
typedef union {
  byte Byte;
  struct {
    byte SEC00       :1;                                       /* Security State Code Bit 0 */
    byte SEC01       :1;                                       /* Security State Code Bit 1 */
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte FNORED      :1;                                       /* Vector Redirection Disable */
    byte KEYEN       :1;                                       /* Backdoor Key Mechanism Enable */
  } Bits;
  struct {
    byte grpSEC0 :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} FOPTSTR;
extern volatile FOPTSTR _FOPT @0x00001821;
#define FOPT _FOPT.Byte
#define FOPT_SEC00 _FOPT.Bits.SEC00
#define FOPT_SEC01 _FOPT.Bits.SEC01
#define FOPT_FNORED _FOPT.Bits.FNORED
#define FOPT_KEYEN _FOPT.Bits.KEYEN
#define FOPT_SEC0 _FOPT.MergedBits.grpSEC0

#define FOPT_SEC00_MASK   1
#define FOPT_SEC00_BITNUM 0
#define FOPT_SEC01_MASK   2
#define FOPT_SEC01_BITNUM 1
#define FOPT_FNORED_MASK   64
#define FOPT_FNORED_BITNUM 6
#define FOPT_KEYEN_MASK   128
#define FOPT_KEYEN_BITNUM 7
#define FOPT_SEC0_MASK  3
#define FOPT_SEC0_BITNUM  0


/*** FCNFG - FLASH Configuration Register; 0x00001823 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte             :1;
    byte KEYACC      :1;                                       /* Enable Writing of Access Key */
    byte             :1;
    byte             :1;
  } Bits;
} FCNFGSTR;
extern volatile FCNFGSTR _FCNFG @0x00001823;
#define FCNFG _FCNFG.Byte
#define FCNFG_KEYACC _FCNFG.Bits.KEYACC

#define FCNFG_KEYACC_MASK   32
#define FCNFG_KEYACC_BITNUM 5


/*** FPROT - FLASH Protection Register; 0x00001824 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte             :1;
    byte FPS0        :1;                                       /* FLASH Protect Size Select Bit 0 */
    byte FPS1        :1;                                       /* FLASH Protect Size Select Bit 1 */
    byte FPS2        :1;                                       /* FLASH Protect Size Select Bit 2 */
    byte FPDIS       :1;                                       /* FLASH Protection Disable */
    byte FPOPEN      :1;                                       /* Open Unprotected FLASH for Program/Erase */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpFPS  :3;
    byte         :1;
    byte         :1;
  } MergedBits;
} FPROTSTR;
extern volatile FPROTSTR _FPROT @0x00001824;
#define FPROT _FPROT.Byte
#define FPROT_FPS0 _FPROT.Bits.FPS0
#define FPROT_FPS1 _FPROT.Bits.FPS1
#define FPROT_FPS2 _FPROT.Bits.FPS2
#define FPROT_FPDIS _FPROT.Bits.FPDIS
#define FPROT_FPOPEN _FPROT.Bits.FPOPEN
#define FPROT_FPS _FPROT.MergedBits.grpFPS

#define FPROT_FPS0_MASK   8
#define FPROT_FPS0_BITNUM 3
#define FPROT_FPS1_MASK   16
#define FPROT_FPS1_BITNUM 4
#define FPROT_FPS2_MASK   32
#define FPROT_FPS2_BITNUM 5
#define FPROT_FPDIS_MASK   64
#define FPROT_FPDIS_BITNUM 6
#define FPROT_FPOPEN_MASK   128
#define FPROT_FPOPEN_BITNUM 7
#define FPROT_FPS_MASK  56
#define FPROT_FPS_BITNUM  3


/*** FSTAT - FLASH Status Register; 0x00001825 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1;
    byte             :1;
    byte FBLANK      :1;                                       /* FLASH Verified as All Blank (erased) Flag */
    byte             :1;
    byte FACCERR     :1;                                       /* Access Error Flag */
    byte FPVIOL      :1;                                       /* Protection Violation Flag */
    byte FCCF        :1;                                       /* FLASH Command Complete Flag */
    byte FCBEF       :1;                                       /* FLASH Command Buffer Empty Flag */
  } Bits;
} FSTATSTR;
extern volatile FSTATSTR _FSTAT @0x00001825;
#define FSTAT _FSTAT.Byte
#define FSTAT_FBLANK _FSTAT.Bits.FBLANK
#define FSTAT_FACCERR _FSTAT.Bits.FACCERR
#define FSTAT_FPVIOL _FSTAT.Bits.FPVIOL
#define FSTAT_FCCF _FSTAT.Bits.FCCF
#define FSTAT_FCBEF _FSTAT.Bits.FCBEF

#define FSTAT_FBLANK_MASK   4
#define FSTAT_FBLANK_BITNUM 2
#define FSTAT_FACCERR_MASK   16
#define FSTAT_FACCERR_BITNUM 4
#define FSTAT_FPVIOL_MASK   32
#define FSTAT_FPVIOL_BITNUM 5
#define FSTAT_FCCF_MASK   64
#define FSTAT_FCCF_BITNUM 6
#define FSTAT_FCBEF_MASK   128
#define FSTAT_FCBEF_BITNUM 7


