AndEmi81/indesit_inertia_rx210/HAL/FS_HCS08_GB60/FS_HCS08_GB60_reg.h
/*** FCMD - FLASH Command Register; 0x00001826 ***/
typedef union {
  byte Byte;
  struct {
    byte FCMD0       :1;                                       /* FLASH Command Bit 0 */
    byte FCMD1       :1;                                       /* FLASH Command Bit 1 */
    byte FCMD2       :1;                                       /* FLASH Command Bit 2 */
    byte FCMD3       :1;                                       /* FLASH Command Bit 3 */
    byte FCMD4       :1;                                       /* FLASH Command Bit 4 */
    byte FCMD5       :1;                                       /* FLASH Command Bit 5 */
    byte FCMD6       :1;                                       /* FLASH Command Bit 6 */
    byte FCMD7       :1;                                       /* FLASH Command Bit 7 */
  } Bits;
  struct {
    byte grpFCMD :8;
  } MergedBits;
} FCMDSTR;
extern volatile FCMDSTR _FCMD @0x00001826;
#define FCMD _FCMD.Byte
#define FCMD_FCMD0 _FCMD.Bits.FCMD0
#define FCMD_FCMD1 _FCMD.Bits.FCMD1
#define FCMD_FCMD2 _FCMD.Bits.FCMD2
#define FCMD_FCMD3 _FCMD.Bits.FCMD3
#define FCMD_FCMD4 _FCMD.Bits.FCMD4
#define FCMD_FCMD5 _FCMD.Bits.FCMD5
#define FCMD_FCMD6 _FCMD.Bits.FCMD6
#define FCMD_FCMD7 _FCMD.Bits.FCMD7
#define FCMD_FCMD _FCMD.MergedBits.grpFCMD

#define FCMD_FCMD0_MASK   1
#define FCMD_FCMD0_BITNUM 0
#define FCMD_FCMD1_MASK   2
#define FCMD_FCMD1_BITNUM 1
#define FCMD_FCMD2_MASK   4
#define FCMD_FCMD2_BITNUM 2
#define FCMD_FCMD3_MASK   8
#define FCMD_FCMD3_BITNUM 3
#define FCMD_FCMD4_MASK   16
#define FCMD_FCMD4_BITNUM 4
#define FCMD_FCMD5_MASK   32
#define FCMD_FCMD5_BITNUM 5
#define FCMD_FCMD6_MASK   64
#define FCMD_FCMD6_BITNUM 6
#define FCMD_FCMD7_MASK   128
#define FCMD_FCMD7_BITNUM 7
#define FCMD_FCMD_MASK  255
#define FCMD_FCMD_BITNUM  0


/* ---------------------------------------------------------------------------------------------------
Exceptions in bit names of timer status and control registers (TASC, TSC, TBSC) for every channel
due to backward compatibility with HC08 AZx versions  */
#define TPM1C0SC_ELSxA    _TPM1C0SC.Bits.ELS0A
#define TPM1C0SC_ELSxB    _TPM1C0SC.Bits.ELS0B
#define TPM1C0SC_MSxA     _TPM1C0SC.Bits.MS0A
#define TPM1C0SC_MSxB     _TPM1C0SC.Bits.MS0B
#define TPM1C0SC_CHxIE    _TPM1C0SC.Bits.CH0IE
#define TPM1C0SC_CHxF     _TPM1C0SC.Bits.CH0F

#define TPM1C1SC_ELSxA    _TPM1C1SC.Bits.ELS1A
#define TPM1C1SC_ELSxB    _TPM1C1SC.Bits.ELS1B
#define TPM1C1SC_MSxA     _TPM1C1SC.Bits.MS1A
#define TPM1C1SC_MSxB     _TPM1C1SC.Bits.MS1B
#define TPM1C1SC_CHxIE    _TPM1C1SC.Bits.CH1IE
#define TPM1C1SC_CHxF     _TPM1C1SC.Bits.CH1F

#define TPM1C2SC_ELSxA    _TPM1C2SC.Bits.ELS2A
#define TPM1C2SC_ELSxB    _TPM1C2SC.Bits.ELS2B
#define TPM1C2SC_MSxA     _TPM1C2SC.Bits.MS2A
#define TPM1C2SC_MSxB     _TPM1C2SC.Bits.MS2B
#define TPM1C2SC_CHxIE    _TPM1C2SC.Bits.CH2IE
#define TPM1C2SC_CHxF     _TPM1C2SC.Bits.CH2F

#define TPM2C0SC_ELSxA    _TPM2C0SC.Bits.ELS0A
#define TPM2C0SC_ELSxB    _TPM2C0SC.Bits.ELS0B
#define TPM2C0SC_MSxA     _TPM2C0SC.Bits.MS0A
#define TPM2C0SC_MSxB     _TPM2C0SC.Bits.MS0B
#define TPM2C0SC_CHxIE    _TPM2C0SC.Bits.CH0IE
#define TPM2C0SC_CHxF     _TPM2C0SC.Bits.CH0F

#define TPM2C1SC_ELSxA    _TPM2C1SC.Bits.ELS1A
#define TPM2C1SC_ELSxB    _TPM2C1SC.Bits.ELS1B
#define TPM2C1SC_MSxA     _TPM2C1SC.Bits.MS1A
#define TPM2C1SC_MSxB     _TPM2C1SC.Bits.MS1B
#define TPM2C1SC_CHxIE    _TPM2C1SC.Bits.CH1IE
#define TPM2C1SC_CHxF     _TPM2C1SC.Bits.CH1F

#define TPM2C2SC_ELSxA    _TPM2C2SC.Bits.ELS2A
#define TPM2C2SC_ELSxB    _TPM2C2SC.Bits.ELS2B
#define TPM2C2SC_MSxA     _TPM2C2SC.Bits.MS2A
#define TPM2C2SC_MSxB     _TPM2C2SC.Bits.MS2B
#define TPM2C2SC_CHxIE    _TPM2C2SC.Bits.CH2IE
#define TPM2C2SC_CHxF     _TPM2C2SC.Bits.CH2F

#define TPM2C3SC_ELSxA    _TPM2C3SC.Bits.ELS3A
#define TPM2C3SC_ELSxB    _TPM2C3SC.Bits.ELS3B
#define TPM2C3SC_MSxA     _TPM2C3SC.Bits.MS3A
#define TPM2C3SC_MSxB     _TPM2C3SC.Bits.MS3B
#define TPM2C3SC_CHxIE    _TPM2C3SC.Bits.CH3IE
#define TPM2C3SC_CHxF     _TPM2C3SC.Bits.CH3F

#define TPM2C4SC_ELSxA    _TPM2C4SC.Bits.ELS4A
#define TPM2C4SC_ELSxB    _TPM2C4SC.Bits.ELS4B
#define TPM2C4SC_MSxA     _TPM2C4SC.Bits.MS4A
#define TPM2C4SC_MSxB     _TPM2C4SC.Bits.MS4B
#define TPM2C4SC_CHxIE    _TPM2C4SC.Bits.CH4IE
#define TPM2C4SC_CHxF     _TPM2C4SC.Bits.CH4F

#endif

